let PAGES = {
    // עמוד ראשי
    mainPage : {
        topNavBar : {
            backgroundColor : `#0D635F`,
            img_button_about : `about_icon.svg`, // אודות / איקס / תפריט
            div_topNavText_main : `אומנות הבישול בה"ד 6`,
            img_bhdLogo : `בהד 6.png`,
            img_tillLogo : `till_logo_white.svg`,
        },
    },
    // עמוד אודות
    aboutPage : {
        topNavBar : {
            backgroundColor : `#0D635F`,
            img_button_menu : `3lines_white.svg`, // אודות / איקס / תפריט
            img_SearchIcon : `search_white.svg`, 
            div_topNavLine : ``,
            div_topNavText_about : `אודות`,
            img_tillLogo : `about_icon.svg`,
        },
        listeners : {
            backToMain : "showPage",
        }
    },
    // עמוד תפריט
    menuPage : {
        topNavBar : {
            backgroundColor : `#E8E8E8`,
            img_button_x : `x_nobackground.svg`, // אודות / איקס / תפריט
            img_SearchIcon : `green_search.svg`, 
            div_topNavLineGray : ``,
            img_home : `home_no_circle.svg`, 
            img_bhdLogo : `בהד 6.png`,
            img_tillLogo : `till_logo_black.svg`,
        },
        functions : [`showMenu()`], // פונקציות שצריכות לפעול
        content : {
            recipe : ["ספר מתכונים","black_cookbook", { // תפריט נפתח
                salads : ["סלטים", "black_salads"],
                starters : ["מנות ראשונות", "black_starters"],
                sides : ["מנות ביניים", "black_sidedishes"],
                vegan : ["מנות טבעוניות", "black_vegan"],
                mainCourse : ["מנות עיקריות", "black_maincourse"],
                baking : ["קונדיטוריה", "black_baking"],
            }],
            learning : ["חומרי לימוד","black_materials", { // תפריט נפתח
                subTopic : ["חומרי לימוד", "black_materials"],
            }],
            gallery : ["תמונות","black_gallery", { // תפריט נפתח
                gallerys : ["גלריה", "black_gallery"],
            }],
            videos : ["סרטוני הדרכה","black_videos", { // תפריט נפתח
                recipes : ["מתכונים", "black_cookbook"],
                safety : ["בטיחות", "black_protection"],
                publicHealth : [`בוה"צ`, "black_health"],
            }],
        }
    },
    // ספר מתכונים
    recipePage : { 
        topNavBar : {
            backgroundColor : `#0D635F`,
            img_button_menu : `3lines_white.svg`, // אודות / איקס / תפריט
            img_SearchIcon : `search_white.svg`, 
            div_topNavLine : ``,
            img_topNavTextIcon : `white_cookbook.svg`,
            div_topNavText_recipe : `ספר מתכונים`,
            img_bhdLogo : `בהד 6.png`,
            img_tillLogo : `till_logo_white.svg`,
        },
        bottomNavBar : { // סמלים של הקטגוריות של המתכונים
            salads : ["סלטים", "green_salads", 0],
            starters : ["מנות ראשונות", "green_starters", 0],
            sides : ["מנות ביניים", "green_sidedishes", -100],
            vegan : ["מנות טבעוניות", "green_vegan", -245],
            mainCourse : ["מנות עיקריות", "green_maincourse", -450],
            baking : ["קונדיטוריה", "green_baking", -450],
        },  
        functions : [`recipePageShowTopics()`], // פונקציות שצריכות לפעול
        content : {
            salads : { // תת נושא
                "סלט-מלפפונים-ובצל" : {
                    pic: `cucamberSalad`,
                    description: ``,
                    quantity: `10 מנות`,
                    time: `10 דקות`,
                    ingredients : [
                        `5-6 מלפפונים`,
                        `1 בצל סגול/לבן `,
                        `שליש כפית מלח`,
                        `מעט פלפל`,
                        `כף שמן`,
                        `חצי לימון סחוט`,
                    ],
                    preparation : [
                        `מורידים ראש וזנב, עושים 2-3 פסים למלפפון עם קולפן.`,
                        `חותכים את המלפפונים בצורה אלכסונית.`,
                        `מתבלים ומוסיפים פטרוזיליה או שמיר.`,
                    ],
                },
                "סלט-טחינה" : {
                    pic: `tahinaSalad`,
                    description: ``,
                    quantity: `10-15 מנות`,
                    time: `10 דקות`,
                    ingredients : [
                        `500 מ"ל טחינה גולמית`,
                        `חצי כף מלח`,
                        `מעט פלפל`,
                        `3 שיני שום`,
                        `1/2 לימון טרי`,
                        `צרור פטרוזיליה`,
                        `400 מ"ל מים`,
                        `3 קוביות קרח`,
                    ],
                    preparation : [
                        `מרוקנים את תוכן הקופסא לקערה.`,
                        `מוסיפים 80% מהנפח מים על כמות הטחינה ומערבבים.`,
                        `מוסיפים תבלינים, לימון, שום וממשיכים לערבב.`,
                        `מוסיפים קצת קוביות קרח כדי להשלים נוזל קר לקבלת טחינה בהירה. `,
                        `מעטרים בפטרוזיליה.`,
                    ],
                },
                "סלט-קולסלאו" :  {
                    pic: `kolslowSalad`,
                    description: `כרוב לבן עם גזר`,
                    quantity: `5 מנות`,
                    time: `10 דקות`,
                    ingredients : [
                        `1/2 כרוב לבן`,
                        `1 גזר מגורד`,
                        `צרור פטרוזיליה/שמיר`,
                        `4-5 כפות מיונז`,
                        `1/3 כפית מלח`,
                        `מעט`,
                        `מעט חומץ/מיץ לימון`,
                    ],
                    preparation : [
                        `קוצצים את הכרוב שיפונד דק (שערות דקות) משרים במי מלח למשך 10 דקות.`,
                        `לאחר מכן רצוי לפזר מעט מלח על הכרוב ולתת לו לנוח במסננת להורדת נוזלים.`,
                        `מגרדים גזר, מוסיפים מיונז ומתבלים להשלמת הטעם.`,
                        `לבסוף מעטרים בפטרוזיליה/שמיר.`,
                    ],
                },
                "סלט-ירק" :  {
                    pic: `greenSalad`,
                    description: ``,
                    quantity: `10 מנות`,
                    time: `15 דקות`,
                    ingredients : [
                        `צרור סלרי עלים`,
                        `5 גבעולים סלרי גבעולים`,
                        `חבילה של פטורזיליה`,
                        `צרור כוסברה`,
                        `מעט נענע`,
                        `חופן בוטנים/אגוזי לוז/קשיו קלוי/גרעיני חמנייה/גרעיני דלעת`,
                        `חופן חמוציות`,
                        `כפית חומץ`,
                        `כף סילאן`,
                        `חצי כף שמן זית`,
                        `חצי כף לימון`,
                        `חצי כף מלח`,
                        `מעט פלפל`,
                    ],
                    preparation : [
                        `מנקים את הירקות ומשרים במי מלח כ-10 דק'.`,
                        `קוצצים את כל הירק אחיד ומוסיפים את סוג הפיצוחים עם החמוציות, מתבלים ומגישים.`,
                    ],
                },
                "סלט-גזר-אסיאתי" :  {
                    pic: `carrotSalad`,
                    description: `סלט גזר אסיאתי חמוץ חריף בשום`,
                    quantity: `10 מנות`,
                    time: `15 דקות`,
                    ingredients : [
                        `5 יח' גזר `,
                        `4 שיני שום `,
                        `1 פלפל חריף `,
                        `צרור כוסברה`,
                        `1 ו1/2 לימון`,
                        `כף שמן זית `,
                        `1/2 כף מלח`,
                        `מעט פלפל `,
                    ],
                    preparation : [
                        `חותכים את הגזר לג'וליאן (סיני).`,
                        `קוצצים פלפל חריף, כותשים שום ומוסיפים לגזר.`,
                        `סוחטים לימון ומתבלים בשמן זית, מלח, פלפל, ומעטרים בכוסברה.`,
                    ],
                },
                "סלט-קרפצ'יו-סלק" :  {
                    pic: `beetSalad`,
                    description: ``,
                    quantity: `10 מנות`,
                    time: `15 דקות`,
                    ingredients : [
                        `2-3 יח' סלק אדום `,
                        `2 כפות שמן זית`,
                        `1/2 לימון טרי`,
                        `2 כפות בלסמי`,
                        `מעט מלח גס`,
                        `מעט פלפל גרוס `,
                        `מספר עלים בזיליקום/עירית/רוקט`,
                    ],
                    preparation : [
                        `פורסים פרוסות דקות של סלק עם מנדולינה או ביד דק דק.`,
                        `מסדרים על הצלחת, בוזקים שמן זית, לימון טרי, בלסמי מצומצם.`,
                        `מתבלים במלח גס ופלפל גרוס מעטרים בבזיליקום טרי.`,
                    ],
                },
                "סלט-משוויה" :  {
                    pic: `mashviaSalad`,
                    description: ``,
                    quantity: `10 מנות`,
                    time: `25 דקות`,
                    ingredients : [
                        `4-5 עגבנייה`,
                        `1 בצל`,
                        `1 פלפל חריף`,
                        `5 שיני שום`,
                        `צרור פטרוזיליה `,
                        `חצי כפית מלח`,
                        `מעט פלפל`,
                        `2 כפות שמן זית`,
                        `2 כפות לימון`,
                    ],
                    preparation : [
                        `שורפים את העגבנייה, הבצל והפלפל החריף על האש.`,
                        `קולפים וקוצצים חיתוך גס.`,
                        `קוצצים שום, מתבלים בשמן זית, מלח ופלפל גרוס.`,
                        `מוסיפים מעט לימון מעטרים בפטרוזיליה ומגישים.`,
                    ],
                },
                "סלט-חציל-קלוי" :  {
                    pic: `eggPlantSalad`,
                    description: `סלט חציל קלוי על האש`,
                    quantity: `10 מנות`,
                    time: `25 דקות`,
                    ingredients : [
                        `2 חציל`,
                        `5 שיני שום`,
                        `1/2 לימון`,
                        `צרור פטרוזיליה`,
                        `כפית מלח`,
                        `מעט פלפל`,
                        `4 כפות שמן זית`,
                    ],
                    preparation : [
                        `שורפים חציל על אש גלויה- פותחים את החציל, מוציאים את התוכן מהקליפה וקוצצים אותו.`,
                        `מוסיפים שום קצוץ, לימון, מלח, פלפל, שמן זית.`,
                        `לעטר בפטרוזיליה ולבזוק מעל שמן זית.`,
                        `לצורת ההגשה אפשר להחזיר את החציל לקליפה השרופה`,
                    ],
                },
                "סלט-בטטה-בצ'ילי-מתוק" :  {
                    pic: `sweetPotatoSalad`,
                    description: ``,
                    quantity: `10 מנות`,
                    time: `25 דקות`,
                    ingredients : [
                        `3-4 יח' בטטה`,
                        `כף שום כתוש`,
                        `חופן בוטנים`,
                        `50 מ"ל צ'ילי מתוק/סילאן + סויה`,
                        `חצי כפית מלח`,
                        `מעט פלפל`,
                    ],
                    preparation : [
                        `חותכים בטטה לצורת צ'יפס דק ומטגנים אות עד לצבע זהוב.`,
                        `מתבלים בצ'ילי, שום, מלח ופלפל.`,
                        `אפשרות שניה להחליף את הצ'ילי המתוק לסילאן וסויה.`,
                        `מוסיפים בוטנים, אפשר לעטר גם בשומשום קלוי.`,
                    ],
                },
                "סלט-מטבוחה" :  {
                    pic: `matbochaSalad`,
                    description: ``,
                    quantity: `10 מנות`,
                    time: `2.5-3 שעות`,
                    ingredients : [
                        `1 ק"ג עגבניות אדומות בשלות`,
                        `2 יח' פלפל חריף`,
                        `ראש שום`,
                        `2 כפות פפריקה`,
                        `כף סוכר`,
                        `80 מ"ל שמן `,
                        `צרור כוסברה `,
                        `1/2 כף מלח `,
                    ],
                    preparation : [
                        `מבשלים את העגבניות בישול במים (טומט קונקסה) כ-10 דק' ומורידים את הקליפה.`,
                        `קוצצים את העגבניות לסיר, מוסיפים שיני שום.`,
                        `מבשלים על אש נמוכה כ2-4 שעות עם מכסה.`,
                        `מטגנים פלפל חריף, מקלפים וקוצצים לסיר.`,
                        `מערבבים שמן עם פפריקה ומוסיפים לסיר.`,
                        `משלימים מלח וסוכר, מוסיפים בגמר הבישול כוסברה קצוצה.`,
                    ],
                },
                "סלט-חמוצים" :  {
                    pic: `kimchiSalad`,
                    description: ``,
                    quantity: `10 מנות`,
                    time: `20 דקות`,
                    ingredients : [
                        `5 יח' גזר`,
                        `1 יח' גמבה אדומה/כתומה`,
                        `1 יח' פלפל ירוק`,
                        `1/4 כרוב לבן`,
                        `1 יח' פלפל חריף`,
                        `4 שיני שום`,
                        `2 יח' לימון`,
                        `כף מלח`,
                        `מעט פלפל`,
                        `כף שמן`,
                    ],
                    preparation : [
                        `חותכים את הירקות לצורה הרצויה ג'וליאן או 2 ס"מ.`,
                        `סוחטים לימון לפי הצורך – 90% , חומץ 10%.`,
                        `מוסיפים שום, מלח, פלפל ושמן.`,
                    ],
                },
                "סלט-חומוס" :  {
                    pic: `homusSalad`,
                    description: ``,
                    quantity: `20 מנות`,
                    time: `2 שעות`,
                    ingredients : [
                        `1 ק"ג גרגירי חומוס`,
                        `טחינה גולמית (על כל כוס חומוס 1/3 כוס טחינה)`,
                        `מים (מי בישו לחומוס לפי צורך, בערך 200 מ"ל)`,
                        `כף מלח`,
                        `כפית כמון`,
                        `1/3 לימון`,
                        `כף סודה לשתייה`,
                    ],
                    preparation : [
                        `משרים את גרגירי החומוס בקערה עם מים למשך 12 שעות לפחות. מחליפים מים ומשרים לעוד שעה.`,
                        `מבשלים את הגרגירים בסיר עם מים וכף סודה לשתייה.`,
                        `מביאים לרתיחה, מסירים קצף בישול וממשיכים לבשל עד ריכוך מלא.`,
                        `מסננים את הגרגירים ממי הבישול.`,
                        `שמים את הגרגירים במעבד מזון, מוסיפים רבע כמות נוזל בישול וטוחנים היטב עד מרקם חלק.`,
                        `מוסיפים טחינה גולמית, מלח, מעט כמון, לימון סחוט וממשיכים לטחון עד למרקם חלק במיוחד.`,
                        `משטחים בצלחת ומעטרים בגרגירי חומוס, שמן זית, פטרוזיליה ומגוון תוספות שאוהבים.`,
                    ],
                },
            }, 
            starters : { // תת נושא
                "מרק-אפונה" :  {
                    pic: `pees`,
                    description: ``,
                    quantity: `5 מנות`,
                    time: `2.5 שעות`,
                    ingredients : [
                        `1 גזר חתוך ברונאז'`,
                        `1 בצל בינוני חתוך ברונאז'`,
                        `3 יח' גבעולי סלרי חתוכים ברונאז'`,
                        `כף שמן`,
                        `500 גר' אפונה יבשה `,
                        `כפית מלח`,
                        `כפית כמון`,
                        `מעט כורכום`,
                        `מעט פלפל שחור`,
                        `שום`,
                        `ליטר מים`,
                    ],
                    preparation : [
                        `מאדים את הירקות בסיר ביחד עם השמן, מוסיפים 2 כוסות אפונה יבשה, מוסיפים מים עד לכיסוי התכולה.`,
                        `מבשלים כ-90 דקות על אש גבוהה ומוסיפים מים במידת הצורך.`,
                        ` כאשר האפונה רכה, טוחנים במוט בלנדר ולאחר מכן, מטבלים במלח, פלפל, כמון, כורכום ושום.`,
                        `להשלמת המנה יש לקצוץ פטרוזיליה ולהשלים לפני ההגשה.`,
                    ],
                },
                "אנטיפסטי" :  {
                    pic: `antiPasti`,
                    description: ``,
                    quantity: `15 מנות`,
                    time: `30 דקות`,
                    ingredients : [
                        `2 יח' פלפל אדום`,
                        `כוס שמן זית`,
                        `2 יח' פלפל ירוק`,
                        `רבע כוס חומץ בלסמי`,
                        `2 יח' פלפל צהוב`,
                        `1 בצל`,
                        `4 יח' עגבניות`,
                        `כף מלח גס`,
                        `כפית פלפל גרוס`,
                        `כפית סוכר`,
                        `2 יח' בטטות`,
                        `2 ראשי שום`,
                        `1 יח' חציל`,
                        `1/3 כוס רוזמרין`,
                    ],
                    preparation : [
                        `חותכים את הירקות לצורה הרצויה (פרוסות/ירח/חצאים)`,
                        `בוזקים שמן זית ובלסמי.`,
                        `מגרדים שיני שום.`,
                        `מתבלים בפיזור מלח גס/שולחן, פלפל שחור גרוס ורוזמרין.`,
                        `אופים בתנור חם על 220 מעלות כ-15-20 דק'.`,
                    ],
                },
                "מרק-תירס" :  {
                    pic: `corn`,
                    description: `מרק תירס אמריקאי עם שבבי קורנפלקס`,
                    quantity: `10 מנות`,
                    time: `45 דקות`,
                    ingredients : [
                        `50 גרם מחמאה`,
                        `פלפל אדום חתוך לקוביות קטנות`,
                        `כוס בצל קצוץ`,
                        `תירס`,
                        `2 ליטר נוזל עוף`,
                        `שמיר קצוץ`,
                        `כפית שום כתוש`,
                        `מלח`,
                        `פלפל`,
                        `חלב קוקוס`,
                    ],
                    preparation : [
                        `ממיסים את השומן ומאדים את הבצל, מוסיפים את השום ומערבבים.`,
                        `מוסיפים את הנוזל והתירס ומביאים לרתיחה.`,
                        `מבשלים כ- 15-20 דק' עד לריכוך התירס.`,
                        `מסננים וטוחנים במעבד מזון.`,
                        `מחזירים את הנוזל עד לקבלת סמיכות רצויה. משלימים טעם.`,
                        `מוסיפים את חלב הקוקוס.`,
                        `מקשטים את המרק (שמיר, פלפל אדום וקורנפלקס) ומגישים.`,
                    ],
                },
                "מרק-בצל" :  {
                    pic: `onion`,
                    description: ``,
                    quantity: `4 מנות`,
                    time: `2 שעות`,
                    ingredients : [
                        `2-3 בצלים גדולים`,
                        `2 כפות קמח`,
                        `80 מ"ל יין אדום`,
                        `50 גרם מחמאה`,
                        `כפית מלח`,
                        `מעט פלפל שחור`,
                        `ליטר מים`,
                    ],
                    preparation : [
                        `משחימים את הבצל, חותכים ומטגנים את הבצל עד לקבלת צבע זהוב. `,
                        `מוסיפים את הקמח והפלפל השחור. `,
                        `מורידים משקע בעזרת היין, מוסיפים נוזל וחומרי טעם.`,
                        `מבשלים עוד כ-שעה וחצי על אש נמוכה`,
                        `ניתן להגיש עם קרוטונים.`,
                    ],
                },
                "מרק-שעועית-איטלקי" :  {
                    pic: `beans`,
                    description: ``,
                    quantity: `8 מנות`,
                    time: `2 שעות`,
                    ingredients : [
                        `1 יח' גזר חתוך ברונאז' `,
                        `1 יח' בצל בינוני חתוך ברונאז' `,
                        `4 יח' גבעולי סלרי חתוכים ברונאז'`,
                        `2 כפות שמן`,
                        `500 גר' שעועית לבנה מבושלת`,
                        `כוס עגבניות טומט קונקסה חתוכות ברונאז'`,
                        `5 שיני שום`,
                        `100 גרם פסטה מבושלת אל דנטה`,
                        `כף מלח`,
                        `כפית כמון`,
                        `מעט פלפל שחור`,
                        `2 ליטר מים`,
                    ],
                    preparation : [
                        `מחממים שמן בסיר ומשחימים את הירקות (גזר, בצל וסלרי).`,
                        `מוסיפים מים ולאחר מכן מוסיפים את השעועית, מכסים את הסיר ולאחר 90 דק' מתבלים את המרק.`,
                        `בזמן ההגשה מוסיפים פסטה אל המרק.`,
                        `להשלמת המנה יש לקצוץ פטרוזיליה ועלי סלרי בגמר הבישול.`,
                    ],
                },
                "מרק-עדשים-איטלקי" :  {
                    pic: `latel`,
                    description: ``,
                    quantity: `8 מנות`,
                    time: `1.5 שעות`,
                    ingredients : [
                        `500 גר' עדשים ירוקות `,
                        `1 יח' גזר חתוך ברונאז'`,
                        `1 יח' בצל בינוני חתוך ברונאז' `,
                        `3-4 יח' גבעולי סלרי חתוכים ברונאז' `,
                        `2 כפות שמן`,
                        `4 שיני שום`,
                        `כף מלח`,
                        `מעט פלפל שחור`,
                        `כפית כמון`,
                        `1/2 כפית כורכום`,
                        `2 ליטר מים`,
                        `1/3 יח' לימון`,
                        `כף קורנפלור/קמח`,
                        `חצי כוס פטרוזיליה/כוסברה קצוצה`,
                    ],
                    preparation : [
                        `מחממים שמן בסיר, מטגנים את הבצל, גזר וסלרי.`,
                        `מוסיפים מים ושום.`,
                        `לאחר מכן, מוסיפים את העדשים ומבשלים עד לריכוך.`,
                        `מטבלים ומסמיכים אם יש צורך בקורנפלור או קמח.`,
                        `להשלמת המנה יש לקצוץ פטרוזיליה ולסחוט מעט לימון.`,
                    ],
                },
                "מרק-ירקות" :  {
                    pic: `vegtabels`,
                    description: ``,
                    quantity: `8 מנות`,
                    time: `1.5 שעות`,
                    ingredients : [
                        `2 יח' גזר שלם`,
                        `1 יח'בצל בינוני חתוך ברונאז'`,
                        `4 יח' גבעולי סלרי חתוכים ברונאז'`,
                        `2 יח' קישוא שלם`,
                        `2 יח' תפו"א שלם`,
                        `צרור כוסברה/פטרוזיליה`,
                        `2 כפות שמן`,
                        `1/2 כף מלח`,
                        `מעט פלפל שחור`,
                        `חצי כפית כורכום`,
                        `2 ליטר מים`,
                    ],
                    preparation : [
                        `מטגנים את הבצל והסלרי במעט שמן, ממלאים את הסיר במים ומוסיפים את התפו"א, גזר וקישוא, מבשלים עד לריכוך מלא.`,
                        ` מוציאים את הירקות מהנוזל, מועכים אותם ומחזירים אותם לנוזל.`,
                        `מרתיחים, מטבלים ומשלימים בכוסברה/פטרוזיליה קצוצה.`,
                    ],
                },
                "מרק-סולת" :  {
                    pic: `solet`,
                    description: `מרק סולת בשום שמיר`,
                    quantity: `8 מנות`,
                    time: `30-40 דקות`,
                    ingredients : [
                        `5 שיני שום כתושים`,
                        `צרור שמיר קצוץ`,
                        `כף שמן`,
                        `כוס סולת`,
                        `1/2 כף מלח`,
                        `מעט פלפל שחור`,
                        `2 ליטר מים`,
                    ],
                    preparation : [
                        `מחממים מים בסיר, מוסיפים את השום ולאחר מכן מוסיפים את השמיר הקצוץ, מביאים לרתיחה.`,
                        `מוסיפים את הסולת בהדרגה תוך כדי ערבוב מתבלים את המרק.`,
                    ],
                },
                "מרק-כתום" :  {
                    pic: `orange`,
                    description: ``,
                    quantity: `8 מנות`,
                    time: `1.5 שעות`,
                    ingredients : [
                        `1/2 יח' דלורית`,
                        `2 בטטות`,
                        `רבע דלעת`,
                        `2 גזר`,
                        `כף מלח`,
                        `מעט פלפל שחור`,
                        `כף מרק עוף`,
                        `2 ליטר מים`,
                    ],
                    preparation : [
                        `מחממים מים בסיר, מוסיפים את הירקות, מביאים לרתיחה, טוחנים את הירקות עד למרקם אחיד ומתבלים את המרק.`,
                        `להשלמת המנה יש להוסיף מעט קרם קוקוס לקישוט ועידון הטעמים.`,
                    ],
                },
                "מרק-חרירה-מרוקאי" :  {
                    pic: `hrira`,
                    description: ``,
                    quantity: `8 מנות`,
                    time: `2 שעות`,
                    ingredients : [
                        `2 יח' בצל`,
                        `5 יח' סלרי`,
                        `250 גר' גרגירי חומוס`,
                        `180 גר' עדשים ירוקות`,
                        `חופן אטריות`,
                        `1 יח' עגבנייה`,
                        `צרור כוסברה`,
                        `כף מלח`,
                        `מעט פלפל `,
                        `כף קמח`,
                        `2 ליטר מים`,
                        `1/2 כפית כורכום`,
                    ],
                    preparation : [
                        `קוצצים את הסלרי והבצל, מטגנים בסיר עם מעט שמן (אפשרי להוסיף בשר).`,
                        `מוסיפים עגבנייה קצוצה ללא קליפה וממשיכים לאדות.`,
                        `מוסיפים מים לפי הצורך של הכמות הרצויה ומרתיחים את המים.`,
                        `מוסיפים את גרגירי החומוס ונותנים להם להתבשל עד ריכוך.`,
                        `כחצי שעה לפני מוסיפים את העדשים ירוקות, מבשלים אותן ובסוף מוסיפים תיבול ומעט אטריות.`,
                        `מסמיכים את המרק עם שתי כפות קמח ע"פ הצורך.`,
                    ],
                },
                "פלפל-ממולא" :  {
                    pic: `stafedPeper`,
                    description: `פלפל ממולא אורז ברוטב עגבניות`,
                    quantity: `8 מנות`,
                    time: `1.5 שעות`,
                    ingredients : [
                        `1 ק"ג אורז מבושל`,
                        `2 יח' בצל בינוני חתוך ברונאז'`,
                        `8 יח' גמבה אדומה`,
                        `צרור פטרוזיליה `,
                        `4 יח' עגבניות מרוסקות `,
                        `3 כפות שמן`,
                        `5 שיני שום`,
                        `200 גר' רסק עגבניות`,
                        `כף מלח`,
                        `כף כמון`,
                        `1/2 כפית פלפל שחור`,
                        `ליטר מים`,
                    ],
                    preparation : [
                        `מחממים סיר שטוח ורחב עם השמן ומוסיפים את הבצל עד להזהבה.`,
                        `מוסיפים את רסק העגבניות והעגבניות המרוסקות ומערבבים.`,
                        `מוסיפים את התבלינים ומערבבים.`,
                        `לאחר מכן מוסיפים את המים הרותחים.`,
                        `שוטפים את הפלפלים ומורידים את הראש ממלאים את הפלפלים באורז.`,
                        `מסדרים בתוך הסיר בצפיפות וממשיכים בישול על אש נמוכה כ-45 דקות.`,
                    ],
                },
                "ארנצ'יני" :  {
                    pic: `arenchini`,
                    description: `ריזוטו אורז ופטריות מטוגן בפירורי מאפה`,
                    quantity: `20 מנות`,
                    time: `2 שעות`,
                    ingredients : [
                        `1 ק"ג אורז ריזוטו`,
                        `3 כפות שמן זית`,
                        `2 יח' בצל`,
                        `סלסלה פטריות`,
                        `3-4 שיני שום `,
                        `כוס יין לבן`,
                        `1.5 ליטר ציר ירקות/מים`,
                        `50 גר' מחמאה`,
                        `1 ק"ג פירורי מאפה`,
                        `4 יח' ביצה`,
                        `300 גר' קמח`,
                    ],
                    preparation : [
                        `מאדים את הבצל עם הפטריות והשום במעט שמן, מוסיפים את האורז ומטגנים קלות.`,
                        `מוסיפים שליש מכמות הנוזלים ומצמצים.`,
                        `ממשיכים להוסיף שני שליש מהנוזל בכמויות קטנות תוך כדי ערבוב כאשר האורז מוכן קושרים עם קוביות מחמאה.`,
                        `מקררים ומכדררים, מצפים בקמח, ביצה ופירורי מאפה ומטגנים בשמן עמוק.`,
                    ],
                },
                "טורטייה-במילוי-ירקות-מוקפצים" :  {
                    pic: `stafedTortia`,
                    description: ``,
                    quantity: `8 מנות`,
                    time: `30 דקות`,
                    ingredients : [
                        `8 טורטיות `,
                        `1 יח' בצל סגול`,
                        `1 יח' בצל לבן`,
                        `3-4 שיני שום`,
                        `1 פלפל אדום`,
                        `1 פלפל ירוק`,
                        `1 פלפל צהוב `,
                        `1/4 כרוב לבן`,
                        `2 גזר `,
                        `1/2 סלסלה נבטים`,
                        `2 כפות שמן זית`,
                        `כפית מלח`,
                        `מעט פלפל גרוס`,
                        `טריאקי/צ'ילי מתוק/צ'ילי חריף`,
                    ],
                    preparation : [
                        `שמים בווק/מחבת מעט שמן זית ומחממים.`,
                        `מקפיצים את הירקות לפי דרגת קושי.`,
                        `מתחילים עם הגזר, פלפלים, בצל ובסוף את הירקות הדינים כגון: כרוב, נבטים ועשבי תיבול.`,
                        `ההקפצה צריכה להיות כמה דקות כדי להשאיר את הירקות קריספיים ולא מושי, לא לגמור את הירקות.`,
                        `לתבל בתבלינים ואפשרי להשתמש ברטבים לפי טעם.`,
                        `למלא בטורטייה, לגלגל ולהגיש.`,
                    ],
                },
                'אצבעות-בורקס-תפו"א-/-בטטה' :  {
                    pic: `borecas`,
                    description: ``,
                    quantity: `24 מנות`,
                    time: `30 דקות`,
                    ingredients : [
                        `1 ק"ג בצק עלים`,
                        `5 יח' תפו"א או בטטה`,
                        `כף מרק עוף`,
                        `קורט מלח`,
                        `קורט פלפל שחור`,
                        `1 יח' ביצה`,
                        `מעט שומשום`,
                    ],
                    preparation : [
                        `מרדדים בצק עלים וחותכים לצורה הנדרשת – מלבן\\מרובע.`,
                        `מבשלים את התפו"א\\בטטה למחית ומתבלים.`,
                        `ממלאים, מקפלים לצורה הנדרשת, מורחים ביצה, מפזרים שומשום ואופים על 180 מעלות למשך 20 דקות`,
                    ],
                },
                "מאפה-פילו-עם-תפוחי-אדמה-ופטריות" :  {
                    pic: `potatoMashroomPastry`,
                    description: ``,
                    quantity: `20 מנות`,
                    time: `1 שעות`,
                    ingredients : [
                        `כף שמן זית `,
                        `1 יח' בצל קצוץ`,
                        `סלסלה פטריות פרוסות`,
                        `5 יח' תפוחי אדמה מבושלים במים`,
                        `1 ק"ג עלי בצק פילו`,
                        `כפית מלח`,
                        `מעט פלפל שחור גרוס`,
                        `1 יח' ביצה טרופה / שמן זית`,
                        `(אם רוצים טבעוני אז מורחים בשמן זית)`,
                        `מעט שומשום`,
                    ],
                    preparation : [
                        `מטגנים במחבת את הבצל והפטריות.`,
                        `מועכים את תפוחי האדמה בקערה, מוסיפים את תערובת הבצל והפטריות, ממליחים ומפלפלים.`,
                        `משמנים תבנית אפייה במעט שמן זית, פורשים שניים מעלי הפילו על משטח העבודה זה על זה ומברישים את העלה העליון במעט שמן זית.`,
                        `מניחים מעט מהמילוי לכל אורך העלה העליון ומגלגלים.`,
                        `אחרי שני גלגולים חותכים את הפילו לאורכו וחוזרים על הפעולה עם שאריות הפילו והמילוי.`,
                        `מברישים את הגלילים במעט ביצה טרופה, מפזרים את השומשום ואופים ב-170 מעלות כ-18 דקות עד שהפילו מזהיב יפה.`,
                    ],
                },
                "שקשוקה" :  {
                    pic: `shaksuka`,
                    description: ``,
                    ingredients : [
                        `שום `,
                        `פלפל חריף`,
                        `עגבניות קוביות (טומט קוסקנה)`,
                        `ביצים`,
                        `מלח פלפל שחור`,
                        `פפריקה`,
                        `כמון `,
                        `שמן זית`,
                    ],
                    preparation : [
                        `מחממים סיר רחב שוליים, מוסיפים מעט שמן זית, זורקים את השום והפלפל החריף.`,
                        `מטלטלים מעט לפתיחת הטעמים ולאחר מכן מוסיפים את העגבניות קוביות מבשלים עד לריכוך ופירוק מלא של העגבניות.`,
                        `מוסיפים כוס מים, מרתיחים, מתבלים ומערבבים היטב.`,
                        `לאחר מכן שוברים את כמות הביצים הרצויה.`,
                        `מנמיכים את האש, מכסים, מבשלים כ-10 דק'.`,
                    ],
                },
                "שקשוקה-בלקנית-עם-חצילים-מטוגנים" :  {
                    pic: `balkanicShakshuka`,
                    description: ``,
                    ingredients : [
                        `ביצים`,
                        `פלפל חריף`,
                        `שום`,
                        `חצילים`,
                        `שמן`,
                        `עגבניות קוביות (טומט קונקסה)`,
                        `מלח ופלפל שחור`,
                        `כמון `,
                        `פפריקה`,
                    ],
                    preparation : [
                        `חותכים את החצילים לקוביות מטגנים ומניחים בצד.`,
                        `מחממים סיר רחב שוליים עם מעט שמן.`,
                        `מוסיפים את הפלפל חריף ושום לפתיחת טעמים.`,
                        `מוסיפים את העגבניות קוביות, מבשלים עד לריכוך ומוסיפים חצי כוס מים.`,
                        `מוסיפים את החצילים המטוגנים, מערבבים ומטבלים.`,
                        `שוברים לתוך הרוטב את הביצים ומורידים לאש נמוכה כ- רבע שעה.`,
                        `מנמיכים את האש, מכסים, מבשלים כ-10 דק'.`,
                    ],
                },
                "חביתת-ירק" :  {
                    pic: `beans`,
                    description: ``,
                    ingredients : [
                        `ביצים`,
                        `צרור פטרוזיליה קצוצה`,
                        `בצל קצוץ`,
                        `פטריות חתוכות `,
                        `שמן זית`,
                        `מלח פלפל שחור`,
                    ],
                    preparation : [
                        `מחממים מחבת עם מעט שמן, שוברים את הביצים לתוך קערה.`,
                        `טורפים את הביצים ומתבלים במלח, פלפל, בצל קצוץ, פטריות חתוכות ופטרוזיליה.`,
                        `שופכים את הבלילה למחבת עד להשחמה והופכים לבישול הצד השני.`,
                    ],
                },
                "פנקייק" :  {
                    pic: `pancake`,
                    description: `פרווה`,
                    ingredients : [
                        ` כוס קמח לבן (140 ג')`,
                        `1 כפית אבקת אפייה (5 ג')`,
                        `1 שקית סוכר וניל (10 ג') אפשר להוסיף במקום תמצית וניל`,
                        `2 כפות סוכר (25 ג')`,
                        `1 ביצה`,
                        `2 כפות שמן `,
                        `1 כוס מים או תפוזים `,
                        `קמצוץ מלח`,
                        `סירופ מייפל/ שוקולד`,
                    ],
                    preparation : [
                        `מערבבים היטב את כל החומרים בקערה עם מטרפה עד לקבלת בלילה חלקה.`,
                        `משמנים מחבת במרגרינה או בשמן.`,
                        `כשהמחבת חמה יוצקים את הבלילה בעזרת מצקת.`,
                        `לאחר כדקה כאשר מופיעות בועות קטנות בחלק העליון של הפנקייק, הופכים צד ומשאירים למש חצי דקה נוספת.`,
                        `מומלץ להגיש עם סירופ לצד הפנקייק.`,
                    ],
                },
                "בלינצ'ס" :  {
                    pic: `blinches`,
                    description: ``,
                    ingredients : [
                        `קילו קמח לבן`,
                        `כף (12.5) סוכר `,
                        `כפית מלח `,
                        `8 כוסות חלב סויה `,
                        `5 ביצים `,
                        `כפית תמצית וניל `,
                        `3/4 כוס שמן`,
                    ],
                    preparation : [
                        `מערבבים את כל החומרים בקערה בעזרת מטרפה,                              לפי הסדר בו רשומים, עד לתערובת חלקה ללא גושים.`,
                        `משמנים מחבת בקוטר של 24-26 ס"מ ומחממים על אש בינונית, כשהמחבת חמה יוצקים כמות של 3/4 מצקת ומטים את המחבת לצדדים בצורה מעגלית כדי שהבלילה תכסה את תחתית המחבת בצורה אחידה (זו צריכה להיות שכבה דקה).`,
                        `מבשלים על אש בינונית.`,
                        `מבשלים על אש בינונית במשך שתי דק'. `,
                        `הופכים בעזרת תרווד צד ומבשלים עוד כדקה.`,
                        `מעבירים לצלחת, משמנים שוב את המחבת וממשיכים הלאה עם יתר הבלילה.`,
                    ],
                },
                "מילוי-לבלינצ'ס-גבינה-פרווה" :  {
                    pic: `cheeseFilling`,
                    description: ``,
                    ingredients : [
                        `מלית גבינה פרווה טבעונית של תנובה 500 גרם `,
                        `קופסא של אינסטנט פודינג 80 גרם`,
                        `100 גרם צימוקים `,
                    ],
                    preparation : [
                        `טורפים הכל ביחד`,
                        `מעבירים לשקית זילוף, מזלפים בבלינצ'ס ומגלגלים.`,
                    ],
                },
                "מילוי-לבלינצ'ס-תפוחים" :  {
                    pic: `appleFilling`,
                    description: ``,
                    ingredients : [
                        `6 תפוחי עץ גרני סמית חתוכים לקוביות`,
                        `כפית קינמון `,
                        `כוס סוכר`,
                        `פתי בר לבן טחון לפירורים `,
                        `חצי כוס צימוקים (לא חובה)`,
                    ],
                    preparation : [
                        `את הקוביות של התפוחי עץ שולקים במים חמים.`,
                        `מסננים ומקררים במשך שעה שירדו כל המים.`,
                        `מוסיפים שאר תוספות.`,
                        `מורחים בבלינצ'ס מחמאה מומסת.`,
                        `אופים בתנור 10 דק' בחום של 160.`,
                    ],
                },
                "מילוי-לבלינצ'ס-בקלוואה" :  {
                    pic: `blinches`,
                    description: ``,
                    ingredients : [
                        `כוס בקלוואה קצוצים `,
                        `כוס פיסטוקים קצוצים `,
                        `כוס שקדים קצוצים `,
                        `שתי כפות שומשום לבן `,
                        `כף סוכר`,
                        `כף קינמון`,
                        `100 גרם חמאה מומסת `,
                    ],
                    preparation : [
                        `מערבבים את כל החומרים יחד, מסדרים על הבלינצ'ס ומגלגלים.`,
                        `מברישים בחמאה מומסת ואופים בתנור על 160 מעלות במשך 10 דק'.`,
                    ],
                },
                "בצק-לפיצה" :  {
                    pic: `pizza`,
                    description: ``,
                    ingredients : [
                        `1 ק"ג קמח לבן `,
                        `50 גרם שמרים יבשים `,
                        `650 מ"ל מים פושרים `,
                        `2 כפות סוכר לבן `,
                        `כף מלח `,
                        `1/3 כוס שמן זית `,
                    ],
                    preparation : [
                        `לשים את כל החומרים במיקסר עם וו לישה המהירות בינונית למשך 10 דק' ומניחים בצד לתפיחה עד להכפלת הנפח.`,
                        `מחלקים את הבצק ל-4 כדורים שווים.`,
                        `חשוב לא להתעסק יותר מידי עם הכדורים, כדי לא להוציא את האוויר מהבצק.`,
                        `משמנים את הכדורים במעט שמן זית למניעת התייבשות,`,
                        `מניחים על השטח מקומח היטב לתפיחה של 20 דק' ומרדדים את הבצק לצורה הרצויה.`,
                        `אופים בתנור שחומם מראש לחום של 240 מעלות במשך 8 דק'.`,
                    ],
                },
                "פוקאצ'ה" :  {
                    pic: `fukatcha`,
                    description: ``,
                    ingredients : [
                        `קילו גרם קמח`,
                        `שתי כפות שמרים יבשים `,
                        `כפית סוכר`,
                        `כפית מלח `,
                        `60 מ"ל שמן זית (רבע כוס)`,
                        `180 מ"ל מים חמים`,
                    ],
                    preparation : [
                        `לשים במיקסר את הקמח והשמרים, לערבב ולהוסיף את הסוכר, מלח, שמן ומים. `,
                        `לעבד עד שהבצק רך וחלק. `,
                        `לשים בקערה משומנת, לכסות ולהתפיח כ- 45 דק'.`,
                        `לחלק את הבצק ל-3 חלקים, ליצור כדורים ולהתפיח עוד כ-20  דק'.`,
                        `למתוח כל כדור עם האצבעות לאורך 30 ס"מ ולהניח בתבנית על נייר האפייה, להמתין 10 דק' ולעשות בורות עם האצבע.`,
                        `לחמם תנור ל225 מעלות `,
                        `להזליף שמן זית על הפוקאצ'ות ולפזר מלח גס, לאפות כ-20 דק' עד שמזהיב.`,
                    ],
                },
                "בצק-שמרים" :  {
                    pic: `dough`,
                    description: ``,
                    ingredients : [
                        `1 ק"ג קמח`,
                        `50 גרם מרגרינה`,
                        `2 י"ח ביצים`,
                        `מים פושרים`,
                        `מלח`,
                        `קליפת לימון מגורדת`,
                        `תמצית וניל לפי הטעם`,
                    ],
                    preparation : [
                        `מכינים בלילה שתשמש ראש- עיסה:`,
                        `מערבבים את כל כמות השמרים עם רבע מכמות הנוזלים, מעט קמח וכפית אחת סוכר.`,
                        `בוחשים עד שהתמיסה תהיה חלקה.`,
                        `מנפים את שאר הקמח ושמים אותו בסיר המערבל או על השולחן.`,
                        `יוצרים גומה במרכז הקמח ומניחים לראש העיסה לתסוס ולתפוח.`,
                        `מוסיפים לגומה לשאר הנוזלים, המרגרינה (כשהיא מותכת), הביצים, תמצית  הווניל וקליפת הלימון.`,
                        `מערבבים הכל יחד ולשים היטב לבצק חלק.`,
                        `שמים את הבצק כשהוא מכוסה- במקום חמים ומניחים לו לתפוח עד שיכפיל את מידותיו.`,
                        `לשים שנית, ומניחים להתפחה נוספת, לשים את הבצק בשלישית ומעבדים אותו לפי הצורך.`,
                        `לאחר העיבוד הבצק לעוגות, יש למרוח אותן בביצה טרופה.`,
                        `שמים את העוגות על התבניות ומניחים להתפחה אחרונה לפני האפייה.`,
                        `אופים בתנור בחום מעל בינוני במשך 30 דק', זמן האפייה תלוי בגודל העוגות.`,
                    ],
                },
                "חלות/-לחמניות" :  {
                    pic: `buns`,
                    description: ``,
                    ingredients : [
                        `קילו קמח רגיל `,
                        `2 כפות גדושות של שמרים יבשים `,
                        `8 כפות גדושות סוכר `,
                        `חצי כוס שמן `,
                        `50 גרם מרגרינה`,
                        `500 מ"ל מים פושרים`,
                        `כפית מלח `,
                    ],
                    preparation : [
                        `מערבבים את השמרים עם הקמח והסוכר ומוסיפים את השמן, את המרגרינה המומסת, כוס מים פושרים ומערבבים עד שהתערובת מתחילה להתגבש.`,
                        `לשים עד שנהיה בצק, אם הבצק קצת דביק אפשר להוסיף מעט קמח. אם הוא יבש אז להוסיף קצת מים.`,
                        `מפזרים מעל הבצק כפית מלח באופן אחיד וממשיכים ללוש במשך 4-5 דק' נוספות עד לקבלת בצק אחיד.`,
                        `מכסים את הקערה במגבת ומניחים בצד להתפחה של שעה עד שעה וחצי עד להכפלת הנפח.`,
                        `מקמחים קלות משטח עבודה ומחלקים את הבצק ל-4 חלקים שווים ומגלגלים כל חלק לרצועה ארוכה וקולעים לצמות.`,
                    ],
                },
            }, 
            sides : { // תת נושא
                "אורז" :  {
                    pic: `rice`,
                    description: ``,
                    quantity: `10 מנות`,
                    time: `30 דקות`,
                    ingredients : [
                        `2 כוסות אורז`,
                        `4 כוסות מים רותחים`,
                        `כף מלח`,
                        `מעט פלפל לבן`,
                        `2 כפות שמן`,
                    ],
                    preparation : [
                        `מרתיחים מים, מאדים את האורז בשמן, מוסיפים תבלינים, מבשלים על אש נמוכה כ-18 דקות (סיר מכוסה).`,
                        `משאירים את הסיר מכוסה כ-5 דקות.`,
                    ],
                },
                "מג'דרה" :  {
                    pic: `magadra`,
                    description: ``,
                    quantity: `10 מנות`,
                    time: `35 דקות`,
                    ingredients : [
                        `1 כוס אורז`,
                        `1 כוס עדשים ירוקות`,
                        `2 יח' בצל`,
                        `כף מלח`,
                        `חצי כפית פלפל `,
                        `כפית כמון`,
                    ],
                    preparation : [
                        `מטגנים את הבצל בשמן ומוסיפים את האורז, ממשיכים טיגון ומתבלים.`,
                        `מוסיפים את העדשים המבושלות, מים פי 2 מכמות האורז ומנמיכים את האש ל-18 דקות.`,
                    ],
                },
                "בורגול" :  {
                    pic: `burgul`,
                    description: ``,
                    quantity: `10 מנות`,
                    time: `20 דקות`,
                    ingredients : [
                        `1 יח' בצל`,
                        `2 יח' גזר`,
                        `גבעול סלרי`,
                        `1 יח' בטטה`,
                        `כוס אפונה סנפרוסט`,
                        `2 כוס בורגול`,
                        `2 כפות שמן`,
                        `כף מלח`,
                        `מעט כורכום`,
                        `3 כוס מים רותחים`,
                    ],
                    preparation : [
                        `מטגנים את הירקות במעט שמן.`,
                        `מוסיפים את הבורגול ומטלטלים את הירקות מעט.`,
                        `מתבלים, מוסיפים מים רותחים פי 1.5 מכמות הבורגול, מבשלים כ-8 דקות על אש נמוכה ומכבים.`,
                    ],
                },
                "פריקי" :  {
                    pic: `priki`,
                    description: ``,
                    quantity: `10 מנות`,
                    time: `40 דקות`,
                    ingredients : [
                        `2 כוס חיטה`,
                        `2 יח' בצל לבן וסגול`,
                        `30 מ"ל סילאן`,
                        `כף שטוחה מלח`,
                        `חצי כפית פלפל`,
                        `2 כפות שמן זית`,
                        `5 כוס מים רותחים`,
                    ],
                    preparation : [
                        `מטגנים את הבצל במעט שמן זית, מוסיפים את החיטה לטלטול/חימום, מתבלים ומוסיפים כמות מים רותחים פי 2 מכמות החיטה.`,
                        `מבשלים על אש נמוכה כ-16-20 דקות, בסוף הבישול מוסיפים פטרוזיליה לקישוט/טעם.`,
                    ],
                },
                "פסטה-איטלקית" :  {
                    pic: `pasta`,
                    description: ``,
                    quantity: `10 מנות`,
                    time: `35 דקות`,
                    ingredients : [
                        `1 ק"ג פסטה פנה`,
                        `5 יח' עגבניות `,
                        `3 כפות שמן זית `,
                        `6 שיני שום`,
                        `2 כפות פפריקה מתוקה`,
                        `כף מלח `,
                        `חצי כפית פלפל`,
                        `אפשר להוסיף 200 גר' רסק עגבניות לסמיכות, מרקם וטעם`,
                    ],
                    preparation : [
                        `מרתיחים סיר מים לבישול הפסטה ביחס 1/10 עם שמן וכף מלח. `,
                        `לבשל את הפסטה לסנן ולשטוף, (לפי הוראות הבישול של היצרן).`,
                        `לשים בסיר שמן זית לטלטל מעט את השום להוצאת טעם של אש נמוכה. להוסיף את העגבניות המגורדות ולבשל.`,
                        `לתבל בפפריקה, מלח ופלפל. להסמיך למרקם קטיפתי עם שמנת מתוקה. שופכים את הפסטה לרוטב להמשיך בישול ומגישים.`,
                    ],
                },
                "ספגטי-ברוטב-ארביאטה" :  {
                    pic: `spagty`,
                    description: `פסטה חריפה ברוטב עגבניות`,
                    quantity: `10 מנות`,
                    time: `35 דקות`,
                    ingredients : [
                        `1 ק"ג פסטה ספגטי `,
                        `5 יח' עגבניות מגורדות `,
                        `3 כפות שמן זית`,
                        `6 שיני שום `,
                        `עלי בזיליקום `,
                        `מעט צ'ילי גרוס `,
                        `כף שטוחה מלח`,
                        `חצי כפית פלפל שחור גרוס`,
                        `כף פפריקה מתוקה`,
                        `אפשר להוסיף 200 גר' רסק עגבניות לסמיכות, מרקם וטעם`,
                    ],
                    preparation : [
                        `מבשלים את הפסטה לפי הוראות היצרן, עם שמן וכף מלח.`,
                        `שמים בסיר שמן זית ומטלטלים את השום.`,
                        `טיגון קל על אש נמוכה להוצאת הטעמים.`,
                        `מוסיפים את הבזיליקום גם כן לטיגון קל ומוסיפים את העגבניות המגורדות.`,
                        `מבשלים כ- 10 דקות ומוסיפים את הצ'ילי גרוס, מלח, פלפל שחור גרוס ופפריקה מתוקה.`,
                        `מוסיפים מים לפי צורך לרוטב (אפשרי ממי הבישול)`,
                        `שופכים את הפסטה לרוטב להמשך בישול ומגישים.`,
                    ],
                },
                "פסטה-נפוליטנה" :  {
                    pic: `napolitana`,
                    description: ``,
                    quantity: `10 מנות`,
                    time: `35 דקות`,
                    ingredients : [
                        `1 ק"ג פסטה טריאטלה / פנה`,
                        `3 כפות שמן זית`,
                        `5-6 יח' עגבניות מגורדות `,
                        `1 יח' בצל`,
                        `שום `,
                        `200 גר' זיתי קלמטה`,
                        `כף פפריקה`,
                        `כף מלח`,
                        `מעט פלפל`,
                        `עלי בזיליקום/אורגנו/טימין`,
                    ],
                    preparation : [
                        `מרתיחים סיר עם מים לבישול הפסטה ביחד 1/10, עם שמן וכף מלח. `,
                        `מבשלים את הפסטה, מסננים ושוטפים.`,
                        `שמים במחבת שמן זית ומטלטלים את הבצל, טיגון קל על אש נמוכה.`,
                        `מוסיפים את העגבניות לבישול של 10 דקות ומוסיפים את הזיתים, התבלינים ועשבי התיבול.`,
                        `שופכים את הפסטה המבושלת לרוטב להמשך בישול ומגישים.`,
                    ],
                },
                "תפוח-אדמה-ירח" :  {
                    pic: `potatoSlices`,
                    description: `אפוי בקליפתו`,
                    quantity: `10 מנות`,
                    time: `40 דקות`,
                    ingredients : [
                        `15 יח' תפוח אדמה בינוני לבן`,
                        `2 כפות שמן זית`,
                        `כף שטוחה מלח`,
                        `כפית פלפל שחור גרוס`,
                        `עלי טימין/רוזמרין`,
                    ],
                    preparation : [
                        `שוטפים את התפוח אדמה עם סקוץ', חותכים את התפוח אדמה לצורת "ירח" עם הקליפה.`,
                        `מתבלים בשמן זית, מלח, פלפל גרוס ורוזמרין.`,
                        `אופים בתנור שחומם מראש ל-200 מעלות למשך 30-40 דקות.`,
                        `אם זה תנור ביתי אז 30 דקות עם נייר כסף ועוד 10 דקות ללא הנייר לקבלת השחמה.`,
                    ],
                },
                "תפוח-אדמה-מניפה" :  {
                    pic: `potatofan`,
                    description: `אפוי בקליפתו`,
                    quantity: `10 מנות`,
                    time: `15 דקות`,
                    ingredients : [
                        `20 יח' תפוח אדמה קטן`,
                        `4 כפות שמן זית`,
                        `כף מלח`,
                        `כפית פלפל גרוס`,
                        `2 כפיות שום כתוש`,
                    ],
                    preparation : [
                        `שוטפים את התפוח אדמה, פורסים אותו לצורת מניפה, פרוסות כאשר התפו"א בשלמותו ולא חתוך עד הסוף.`,
                        `מסדרים בתבנית, בוזקים שמן זית, מפזרים מלח, פלפל גרוס ושום כתוש.`,
                        `מכסים בנייר כסף ואופים בתנור על 200 מעלות למשך 30 דקות.`,
                        `מורידים את הנייר כסף ואופים לעוד 10 דקות כדי לקבל השחמה.`,
                    ],
                },
                'תפו"א-מדורה' :  {
                    pic: `campFirePotato`,
                    description: ``,
                    quantity: `10 מנות`,
                    time: `45 דקות`,
                    ingredients : [
                        `15 יח' תפו"א לבן`,
                        `כף שטוחה מלח גס`,
                        `3 כפות שמן זית`,
                        `כפית פלפל גרוס`,
                        `2 כוסות מלח גס למצע`
                    ],
                    preparation : [
                        `מרפדים תבנית אפייה במלח גס ומניחים את התפו"א על המלח. `,
                        `אופים בחום גבוה כ-220 מעלות.`,
                        `בגמר אפייה מוציאים, מועכים ומשלימים תיבול – מלח גס, פלפל גרוס ושמן זית.`,
                        `*יש אפשרות לקצר את התהליך ולבשל במים את התפו"א בקליפה, לקרר ולמעוך על תבנית ולהשחים בתנור.`,
                    ],
                },
                'תפו"א-ובטטה-"פוטטו"' :  {
                    pic: `potatoAndSweetPotato`,
                    description: ``,
                    quantity: `10 מנות`,
                    time: `45 דקות`,
                    ingredients : [
                        `10 יח' תפוח אדמה`,
                        `6 יח' בטטה`,
                        `1 ליטר שמן לטיגון`,
                        `50 גר' תיבול "קייג'ין"`,
                        `כף מלח`,
                    ],
                    preparation : [
                        `שוטפים את תפוח האדמה והבטטה ופורסים אותם לצורת ירח או פרוסות.`,
                        `מבשלים בישול במים (בלונשיר) ומקררים.`,
                        `מטגנים בשמן עמוק.`,
                        `מוציאים מהשמן ומתבלים בתבלין "קייג'ין" ומלח.`,
                    ],
                },
                "פירה" :  {
                    pic: `mashedPotato`,
                    description: ``,
                    quantity: `10 מנות`,
                    time: `30 דקות`,
                    ingredients : [
                        `20 יח' תפוח אדמה לבן (התפוח אדמה המושלם לפירה מזן ראטה) `,
                        `כף מלח`,
                        `150 גר' מחמאה (פרווה)`,
                    ],
                    preparation : [
                        `שוטפים את התפוח אדמה ומבשלים אותם בקליפתם במים קרים עם כף מלח.`,
                        `בישול איטי על מנת שכל התפוח אדמה יתרכך.`,
                        `כאשר התפוח אדמה רך, מסננים אותו ומייבשים אותו.`,
                        `מקלפים את הקליפה ומועכים אותו היטב.`,
                        `משלימים טעם ושמים מחמאה.`,
                        `מגישים. אפשר להוסיף עשבי תיבול.`,
                    ],
                },
            }, 
            vegan : { // תת נושא
                'ירקות-מוקפצים' :  {
                    pic: `chiniseVeg`,
                    description: `ירקות מוקפצים עם חטיפי סויה בסגנון סיני`,
                    quantity: `10 מנות`,
                    time: `35 דקות`,
                    ingredients : [
                        `350 גר' חטיפי סויה`,
                        `2 יח' גזר`,
                        `2 יח' בצל`,
                        `1 יח' פלפל אדום`,
                        `1 יח' פלפל צהוב`,
                        `1 יח' פלפל ירוק`,
                        `כוס נבטים`,
                        `רבע כרוב`,
                        `כוס תירס/תירס גמדי`,
                        `כף מלח`,
                        `חצי כפית פלפל`,
                        `כף שום כתוש`,
                        `80 מ"ל רוטב טריאקי`,
                        `מעט ג'ינג'ר `,
                        `3-4 כפות שמן זית`,
                        `הגשה: בוטנים קצוצים / שומשום`,
                    ],
                    preparation : [
                        `מבשלים את חטיפי הסויה במים ומסננים.`,
                        `מקפיצים בווק את הירקות לפי דרגת קושי מהקשה לרך/עדין.`,
                        `מוסיפים את חטיפי הסויה.`,
                        `מתבלים ומגישים.`,
                        `מעטרים בבוטנים קלויים.`,
                    ],
                },
                'בטטה-צלויה-בקרם-קוקוס' :  {
                    pic: `sweetPotato`,
                    description: ``,
                    ingredients : [
                        `בטטה`,
                        `חלב קוקוס`,
                        `מלח`,
                        `פלפל`,
                        `צ'ילי טרי`,
                    ],
                    preparation : [
                        `פורסים את הבטטה לפרוסות ומסדרים בתבנית.`,
                        `יוצקים חלב קוקוס.`,
                        `מתבלים מלח, פלפל עם צ'ילי ואופים כ-20 דקות על 180 מעלות.`,
                    ],
                },
                'המבורגר-עדשים-וסויה-טחון' :  {
                    pic: `lentelBurger`,
                    description: ``,
                    ingredients : [
                        `עדשים שחורות/ירוקות`,
                        `בצל מטוגן`,
                        `סויה טחון`,
                        `מלח`,
                        `פלפל שחור גרוס`,
                        `פירורי מאפה`,
                    ],
                    preparation : [
                        `מבשלים את העדשים השחורות כ- 20-25 דקות.`,
                        `מבשלים את הסויה הטחון כ-3 דקות.`,
                        `קוצצים בצל ומטגנים אותו בשמן זית ומוסיפים לעדשים ולסויה.`,
                        `מתבלים ומוסיפים קצת פירורי מאפה.`,
                        `מעבדים לכתיתות המבורגר וצולים על מחבת/פלאנצ'ה.`,
                        `מגישים עם טבעות בצל מושחמות.`,
                        `אפשר להוסיף פטריות קצוצות מטוגנות בשמן זית.`,
                    ],
                },
                'קרם-חציל-עם-גרגירי-חומוס' :  {
                    pic: `eggPlantHumus`,
                    description: ``,
                    ingredients : [
                        `חציל`,
                        `שום`,
                        `גרגירי חומוס`,
                        `לימון טרי`,
                        `שמן זית`,
                        `סילאן`,
                        `מלח`,
                        `פלפל`,
                        `טחינה גולמית`,
                        `פטרוזיליה`,
                    ],
                    preparation : [
                        `מבשלים את גרגירי החומוס בסיר עם מים כשעה עד ריכוך.`,
                        `מסננים ומניחים בצד.`,
                        `שורפים חציל על אש גלויה.`,
                        `מסננים מנוזלם, מקלפים את הקליפה וטוחנים במעבד מזון.`,
                        `מוסיפים שום כתוש, לימון, סילאן, מלח, פלפל ושמן זית.`,
                        `מצלחתים, סוחטים מעט לימון, שמן זית ומלח.`,
                        `יוצקים את גרגירי החומוס ומזלפים טחינה גולמית.`,
                        `מעטרים בפטרוזיליה ומגישים.`,
                    ],
                },
                'סיגר-פלאפל' :  {
                    pic: `plapelCigar`,
                    description: `סיגר ממולא פלאפל מטוגן`,
                    ingredients : [
                        `גרגירי חומוס`,
                        `כוסברה`,
                        `פטרוזיליה `,
                        `בצל`,
                        `שום`,
                        `פלפל חריף`,
                        `כמון`,
                        `עלי סיגר`,
                        `מלח ופלפל`,
                        `קמח`,
                    ],
                    preparation : [
                        `מבשלים את החומוס עד שמתרכך.`,
                        `טוחנים במעבד מזון את החומוס, כוסברה ופטרוזיליה.`,
                        `מוסיפים את הבצל, הפלפל והשום, טוחנים את הכל יחד עד שמגיעים למרקם מחיתי.`,
                        `מתבלים במלח, פלפל וכמון.`,
                        `מוציאים את התערובת ושמים בשק זילוף.`,
                        `סוגרים עם קמח וקצת מים (דבק).`,
                        `מטגנים עד שמשחים.`,
                    ],
                },
                'טורטייה-טבעונית' :  {
                    pic: `tortilaSoy`,
                    description: `טורטייה טבעונית במילוי צ'ילי קונקרה בסויה טחון`,
                    ingredients : [
                        `טורטייה `,
                        `סויה טחון`,
                        `שעועית לבנה`,
                        `פלפל צ'ילי אדום/ צ'ילי גרוס- שאטה`,
                        `בצל `,
                        `עגבנייה `,
                        `כוסברה`,
                        `שמן זית`,
                    ],
                    preparation : [
                        `מבשלים את הסויה טחון בישול במים כ-3 דקות.`,
                        `מטגנים בצל במעט שמן זית, מוסיפים צ'ילי חריף, קוביות קצוצות של עגבנייה מקולפת ללא גרעינים.`,
                        `מוסיפים שעועית לבנה שבושלה מראש, מלח פלפל וכוסברה.`,
                        `ממלאים את הטורטייה ומגלגלים.`,
                    ],
                },
                'רוסטביף-דלעת,-דלורית-ובטטה' :  {
                    pic: `skwashSweetPotato`,
                    description: ``,
                    ingredients : [
                        `דלעת`,
                        `דלורית`,
                        `חרדל דיז'ון`,
                        `חרדל חלק`,
                        `סויה`,
                        `סילאן `,
                        `צ'ילי גרוס`,
                        `חומץ בלסמי`,
                        `שמן זית `,
                        `מלח גס`,
                        `פלפל שחור גרוס`,
                        `טימין יבש`,
                    ],
                    preparation : [
                        `קולפים את הדלעת, דלורית ובטטה.`,
                        `חוצים לשניים ומוציאים את הגרעינים והשערות.`,
                        `מכניסים את כל הנוזלים והתבלינים למג'ימיקס.`,
                        `מורחים את הירקות בתערובת.`,
                        `מחממים תנור ל- 200 מעלות וצולים את הרוסביף למשך- 30 40 דקות.`,
                        `מוציאים ופורסים על בוצר בזמן הארוחה- קארווינג.`,
                    ],
                },
            }, 
            mainCourse : { // תת נושא
                'חזה-עוף-ממולא' :  {
                    pic: `stafedChickenBreast`,
                    description: `חזה עוף במילוי דוקסל פטריות צרוב על מחבת פסים והשלמה בתנור`,
                    quantity: `4 מנות`,
                    time: `35 דקות`,
                    ingredients : [
                        `4 יחידות חזה עוף ללא עצם`,
                        `1/2 ליטר נוזל חום מושל בטעם`,
                        `2 כפות שמן`,
                        `1/2 בצל - מילוי `,
                        `4 יחידות פטריות - מילוי `,
                        `צרור פטרוזיליה - מילוי `,
                        `מלח - מילוי `,
                        `פלפל - מילוי `,
                        `2 כפות שמן - מילוי `,
                    ],
                    preparation : [
                        `חותכים את הירקות לדוקסל.`,
                        `מקפיצים את הבצל עם הפטריות עד לקבלת צבע זהוב ומוסיפים את הפטרוזיליה, מלח ופלפל.`,
                        `מאדים קלות ויוצרים חור בחזה עוף.`,
                        `את העוף ממלאים בחומרי המילוי.`,
                        `צורבים את העוף בפלנצ'ה לקבלת פסים.`,
                        `מניחים את העוף בתבנית, מכסים עד גובה חצי בנוזל החום ומכסים את התבנית בנייר כסף.`,
                        `מחממים תנור ל-180 מעלות ומכניסים את העוף ל-10 דקות.`,
                        `מנוזל העוף יוצרים את הרוטב הרצוי.`,
                    ],
                },
                'קציצות-קבב' :  {
                    pic: `kabab`,
                    description: `קציצות קבב על הפלאנצ'ה על מצע חציל שרוף`,
                    quantity: `10 מנות`,
                    time: `30 דקות`,
                    ingredients : [
                        `500 גרם בשר טחון`,
                        `בצל קצוץ ברונאז'`,
                        `צרור פטרוזיליה קצוץ`,
                        `כף פלפל שחור גרוס`,
                        `חצי כף מלח`,
                        `כפית בהרט`,
                        `2 כפות שמן זית`,
                        `טחינה`,
                        `חציל`,
                    ],
                    preparation : [
                        `מערבבים את הבשר טחון עם הבצל, פטרוזיליה, תבלינים ומעבדים היטב.`,
                        `נותנים לו "מנוחה" של שעה במקרר ומעבדים אותו שוב.`,
                        `מכדררים לקציצות – משטיחים אותן.`,
                        `שורפים את החציל, מקלפים ומתבלים אותו.`,
                        `מכינים טחינה גולמית לבנה או ירוקה.`,
                        `צורבים את הקבב על הפלאנצ'ה.`,
                        `מצלחתם על החציל ומזלפים טחינה על המנה.`,
                    ],
                },
                'קדירת-עוף-עם-ירקות-ושומר' :  {
                    pic: `chickenStue`,
                    description: ``,
                    quantity: `4 מנות`,
                    time: `1.25 שעות`,
                    ingredients : [
                        `4 יחידות כרעיים עוף`,
                        `1/2 כוס קמח`,
                        `כפית פפריקה`,
                        `1/4 כוס שמן`,
                        `1/4 בצל `,
                        `1 גזר`,
                        `2 גבעולי סלרי`,
                        `1 שומר`,
                        `שן שום קצוצה`,
                        `מלח`,
                        `פלפל`,
                        `קארי`,
                        `ליטר נוזל עוף`,
                    ],
                    preparation : [
                        `חותכים את העוף לשוקיים וירכיים.`,
                        `מקמחים את העוף ומתבלים בפפריקה, מלח, פלפל וסוגרים אותו בשמן.`,
                        `את הירקות חותכים קרה ומאדים אותם לפי קשיות, מחזירים את העוף לסיר עם הירקות, מורידים משקע עם הנזול של העוף עד לגובה 3/4 מהעוף, מכסים את הסיר ומבשלים כ-50 דקות בחום נמוך, מוסיפים תבלינים ומשלימים טעם.`,
                    ],
                },
                'שניצל-וינאי' :  {
                    pic: `snitzel`,
                    description: ``,
                    quantity: `10 מנות`,
                    time: `35 דקות`,
                    ingredients : [
                        `1 ק"ג בשר הודו/עוף`,
                        `500 גר' פירורי לחם`,
                        `2 יח' ביצים`,
                        `1 ליטר שמן לטיגון`,
                        `100 גר' קמח`,
                        `כף שטוחה מלח`,
                        `מעט פלפל`,
                        `*יש אפשרות לתבל את הביצה עם חרדל/מיונז/רוטב סויה*`,
                    ],
                    preparation : [
                        `מצפים את השניצל בציפוי וינאי (3 שלבים):`,
                        ` 1.קמח + תבלינים`,
                        `2. ביצה + חרדל/מיונז/רוטב סויה`,
                        `3. פירורי מאפה + שומשום `,
                        `אזי מצפים קודם בקמח ולאחר מכן בביצה ולבסוף בפירורי מאפה.`,
                        `מטגנים בשמן עמוק חם.`,
                    ],
                },
                'בשר-ברוטב-צלי' :  {
                    pic: `beefSlices`,
                    description: `פרוסות בשר בקר ברוטב צלי`,
                    quantity: `10 מנות`,
                    time: `4 שעות`,
                    ingredients : [
                        `2 קילו נתח בשר מספר 5`,
                        `כוס יין אדום`,
                        `3 יח' בצל`,
                        `5 עלי דפנה`,
                        `2 יח' גזר`,
                        `מעט פלפל אנגלי`,
                        `2 גבעולי סלרי`,
                        `כף מלח`,
                        `שורש כרישה`,
                        `מעט כורכום`,
                        `ראש שום`,
                        `כפית כמון`,
                        `צרור כוסברה`,
                        `2 ליטר מים`,
                        `30 מ"ל שמן זית`,
                    ],
                    preparation : [
                        `צולים בסיר עמוק ורחב את נתח הבשר מכל צדדיו (סגירה).`,
                        `מוציאים אותו מהסיר ומכניסים לאותו הסיר את כל הירקות חתוכים גס.`,
                        `מטלטלים בשמן את הירקות טיגון קל.`,
                        `מוסיפים כף רסק עגבניות ומערבבים.`,
                        `מוסיפים יין להרמת משקעים וממלאים את הסיר במים עד גובה הבשר.`,
                        `מחזירים את הבשר לסיר.`,
                        `מוסיפים עלי דפנה, פלפל אנגלי ומבשלים כ- 3 שעות עד ריכוך מלא.`,
                        `מוציאים את הבשר, מקררים ופורסים אותו לפרוסות הרצויות.`,
                        `משחימים בצל בסיר שטוח, מסדרים את פרוסות הבקר.`,
                        ` (אפשר להוסיף גם פטריות או ירק מסוים).`,
                        `מוסיפים את הנוזל המסונן שהבקר התבשל בו, מתבלים ומרתיחים להשלמת בישול וספיגת טעמים. `,
                    ],
                },
                'בשר-צלי-אסאדו' :  {
                    pic: `beefstue`,
                    description: `בשר צלי בקר צלוי פרוס קארווינג בסגנון אסאדו בליווי מתבלים`,
                    quantity: `20 מנות`,
                    time: `5-6 שעות`,
                    ingredients : [
                        `נתח בשר מספר 4`,
                        `עלי רוזמרין `,
                        `שיני שום שלמים קלופים`,
                        `פלפל שחור גרוס`,
                        `מלח גס`,
                        `שמן זית כתית`,
                    ],
                    preparation : [
                        `מפשירים את הבשר בקר, עושים בו חריצים לאורך מורחים בשמן זית, מלח גס, פלפל שחור גרוס, רוזמרין ואת שיני השום.`,
                        `לוקחים נייר כסף ונייר אפייה, עוטפים קודם עם נייר אפייה ולאחר מכן עם נייר הכסף.`,
                        `מכניסים לתנור ל-180 מעלות ל-5 שעות בישול.`,
                        `מוציאים, פורסים ומגישים לצד רוטב פלפלת.`,
                    ],
                },
                'סטייק-פרגית-ברוטב-טריאקי' :  {
                    pic: `pargitTariaki`,
                    description: ``,
                    quantity: `10 מנות`,
                    time: `20 דקות`,
                    ingredients : [
                        `1/4 כוס סויה`,
                        `2 כפות דבש`,
                        `1/4 כוס יין מתוק אדום`,
                        `2 כפות סוכר חום`,
                        `1/4 כוס מיץ תפוזים`,
                        `1.3 ק"ג פרגית`,
                    ],
                    preparation : [
                        `מחממים מחבת ללא שמן ומטגנים את הפרגיות.`,
                        `במקביל מערבבים את כל החומרים, מרתיחים, מרכזים ומוסיפים פלפל שטה יבש לא קצוץ.`,
                        `מסדרים את הפרגית במרכז הצלחת.`,
                        `מגישים עם מעט רוטב טריאקי.`,
                        `תוספת למנה דואט תפו"א (פירה).`,
                    ],
                },
                'סטייק-פרגית-בשום-וסילאן' :  {
                    pic: `pargitGarlic`,
                    description: `סטייק פרגית עוף צלויה בשום וסילאן`,
                    quantity: `10 מנות`,
                    time: `20 דקות`,
                    ingredients : [
                        `1.3 ק"ג פרגית עוף`,
                        `6-7 שיני שום `,
                        `עלי פטרוזיליה קצוצה`,
                        `2 כפות סילאן`,
                        `כף שטוחה מלח`,
                        `כפית פלפל גרוס`,
                        `30 מ"ל שמן זית`,
                        `כף שמן קנולה`,
                    ],
                    preparation : [
                        `מפרקים פרגית מירך עוף.`,
                        `מנקים אותה מעצמות, גידים ושאריות שומן.`,
                        `משטחים אותה לסטייק פרגית.`,
                        `מתבלים בשום קצוץ, פטרוזיליה, סילאן, שמן זית ושאר התבלינים.`,
                        `צולים על מחבת פסים או פלאנצ'ה משני הצדדים היטב על מחבת חמה.`,
                    ],
                },
                'עראיס' :  {
                    pic: `arais`,
                    description: `רבעי פיתות במילוי בשר צלוי על מחבת פסים או מנגל`,
                    quantity: `10 מנות`,
                    time: `30 דקות`,
                    ingredients : [
                        `1 ק"ג בשר טחון`,
                        `3 בצל בינוני`,
                        `צרור פטרוזיליה קצוצה`,
                        `כף מלח`,
                        `פלפל גרוס`,
                        `כפית בהרט`,
                        `פיתות (רבעים)`,
                        `שמן זית`,
                    ],
                    preparation : [
                        `קוצצים את הבצל והפטרוזיליה לתוך קערה עם הבשר טחון, מתבלים ומעבדים היטב את הבשר.`,
                        `ממלאים את רבעיי הפיתות בבשר טחון, מורחים שמן זית או מתיזים ספריי שמן וצולים על מחבת פסים או על מנגל.`,
                        `צולים מכל הכיוונים עד שמתקבלת צריבה של פסים, מסדרים על תבנית עם נייר אפייה ומכניסים ל-5-7 דקות השלמה בתנור. `,
                    ],
                },
                'המבורגר' :  {
                    pic: `humburger`,
                    description: ``,
                    quantity: `5 מנות`,
                    time: `30 דקות`,
                    ingredients : [
                        `1 ק"ג בשר טחון עם 25% - 30% שומן.`,
                        `1 בצל גדול קצוץ מטוגן`,
                        `מלח`,
                        `פלפל גרוס`,
                        `שמן זית`,
                    ],
                    preparation : [
                        `קוצצים בצל ומטגנים אותו במחבת עם מעט שמן זית.`,
                        `מוסיפים לבשר, מתבלים ומעבדים במשך 10 דקות.`,
                        `מכינים את ההמבורגרים בצור עגולה (לפי הגודל הרצוי).`,
                        `צולים על הפלאנצ'ה.`,
                        `מגישים בתוך לחמנית המבורגר עם תוספות של מבחר ירקות ורטבים.`,
                    ],
                },
                'פילה-אמנון-בסגנון-מזרחי' :  {
                    pic: `amnonFish`,
                    description: ``,
                    quantity: `10 מנות`,
                    time: `45 דקות`,
                    ingredients : [
                        `10 יח' דג פילה אמנון`,
                        `צרור כוסברה`,
                        `1 יח' לימון`,
                        `ראש שום`,
                        `5 יח' פלפל חריף`,
                        `2 יח' גמבה `,
                        `2 כפות פפריקה`,
                        `120 מ"ל שמן`,
                        `כף שטוחה מלח`,
                        `כפית מרק עוף`,
                    ],
                    preparation : [
                        `משרים את הדג בלימון ומלח כ-10 דקות ושוטפים אותו היטב להסרת ריחות וטעם לוואי.`,
                        `מגרדים חצי עגבנייה ושוזרים גבעולים ועלים של כוסברה בסיר רחב ושטוח (סוטאז').`,
                        `מוסיפים שיני שום ופלפלים חריפים.`,
                        `מאדים את הירקות למשך 5 דקות עם סיר מכוסה.`,
                        `מסדרים את חתיכות הדג על הירקות.`,
                        `מערבבים בקערה שמן עם פפריקה מתוקה, חצ כף מרק עוף, מלח ויוצקים על הדג.`,
                        `מוסיפים חצי כוס מים ומרתיחים כ-30 עד 40 דקות.`,
                        `מעטרים בכוסברה קצוצה לעוד 5 דקות בישול.`,
                    ],
                },
                'דג-פילה-לברק/אמנון' :  {
                    pic: `lavrekFish`,
                    description: `דג פילה לברק/אמנון בקראסט פיסטוקים`,
                    quantity: `10 מנות`,
                    time: `30 דקות`,
                    ingredients : [
                        `10 יח' דג פילה לברק/אמנון`,
                        `צרור פטרוזיליה`,
                        `6 יח' שום קצוץ`,
                        `1 יח' לימון`,
                        `30 מ"ל סילאן/דבש`,
                        `180 מ"ל שמן זית `,
                        `זעפרן /מעט כורכום`,
                        `כף מלח`,
                        `חצי כפית פלפל שחור טחון`,
                        `300 גר' פיסטוקים`,
                    ],
                    preparation : [
                        `קוצצים את הפיסטוקים עם שום קצוץ ופטרוזיליה.`,
                        `מערבבים בקערה שמן זית, לימון סחוט, סילאן, שום כתוש, מלח, פלפל וכורכום.`,
                        `מושכים את הדג, מפזרים על הדג את התערובת, מכניסים לאפייה בתנור שחומם מראש ל-180 מעלות כ-15 דקות.`,
                    ],
                },
            }, 
            baking : { // תת נושא
                'בצק-עלים' :  {
                    pic: `phillo`,
                    description: ``,
                    ingredients : [
                        `500 גר' קמח`,
                        `300 גר' מרגרינה`,
                        `10 גר' מלח`,
                        `1 כף חומץ`,
                        `חצי ביצה `,
                        `200-250 סמ"ק מים פושרים`,
                    ],
                    preparation : [
                        `מערבבים 30 גר' קמח עם המרגרינה ויוצרים קובייה ומערבבים למקרר.`,
                        `מערבבים 30 גר' מרגרינה עם הקמח ושאר החומרים.`,
                        `מעבדים לבצק חלק (בצורת כדור) עושים חתכים בבצק (בצורת+) ונותנים לבצק לנוח כאשר הוא מכוסה.`,
                        `פותחים את הבצק לריבוע כאשר באמצע הוא עבה.`,
                        `מניחים את המרגרינה במרכז הבצק ומקפלים בצורת מעטפה.`,
                        `מרדדים את הבצק לפי קיפולים  3-4.`,
                        `יש לתת לבצק לנוח בין הקיפולים ובסיום למנוחה במקרר.`,
                    ],
                },
                'בצק-פריך' :  {
                    pic: `parich`,
                    description: ``,
                    ingredients : [
                        `600 גר' מרגרינה`,
                        `300 גר' אבקת סוכר`,
                        `50 גר' חלמון`,
                        `100 גר' ביצים `,
                        `900 גר' קמח `,
                        `מעט וניל `,
                        `גרידת תפוז `,
                        `גרידת לימון `,
                        `קורט מלח `,
                    ],
                    preparation : [
                        `לערבב את המרגרינה ואבקת הסוכר.`,
                        `להוסיף בהדרגה חלמון וביצים.`,
                        `להוסיף את שאר המרכיבים ולערבב עד לקבלת בצק אחיד.`,
                    ],
                },
                'בראוניז-שוקולד' :  {
                    pic: `brownize`,
                    description: ``,
                    ingredients : [
                        `420 גר' ביצים`,
                        `500 גר' סוכר `,
                        `400 גר' חמאה `,
                        `20 גר' נס קפה`,
                        `400 גר' שוקולד `,
                        `250 גר' קמח`,
                        `5 גר' אבקת אפייה`,
                    ],
                    preparation : [
                        `מקציפים את הביצים והסוכר.`,
                        `מרתיחים את החמאה והנס קפה.`,
                        `מקפלים לשוקולד את תערובת החמאה ואת שאר המרכיבים.`,
                        `את השוקולד והחמאה מקפלים לביצים המוקצפות.`,
                        `אפיה 180 מעלות 20 דק'.`,
                    ],
                },
                "ספינג'" :  {
                    pic: `spinge`,
                    description: ``,
                    ingredients : [
                        `1 ק"ג קמח `,
                        `1 ביצה `,
                        `2 כפות סוכר `,
                        `1/2 כוס שמן`,
                        `2 כפות שמרים`,
                        `מעט מלח `,
                    ],
                    preparation : [
                        `שמים בקערת מיקסר את כל החומרים למעט מלח.`,
                        `מערבבים ומוסיפים מים קרים לפי הצורך עד שיהיה בצק רך וקצת דביק.`,
                        `להתפיח, להוריד ולעשות עיגולים על נייר אפייה ולהתפיח שוב.`,
                        `לעשות חור עם האצבעות, לפתוח ולהניח בשמן.`,
                        `לטגן בשמן על אש בינונית.`,
                        `להוציא ולטבול בסוכר או בסיפור דבש.`,
                    ],
                },
                'קראמבל' :  {
                    pic: `crambele`,
                    description: ``,
                    ingredients : [
                        `200 גר' סוכר `,
                        `200 גר' מרגרינה`,
                        `400 גר' קמח `,
                        `100 גר' אבקת שקדים `,
                    ],
                    preparation : [
                        `מערבלים הכל ביחד על מהירות איטית עד שמתקבלת תערובת פירורים.`,
                        `שומרים במקרר ומשתמשים במידת הצורך.`,
                    ],
                },
                'פאי-לימון' :  {
                    pic: `lrmonPie`,
                    description: ``,
                    ingredients : [
                        `ליטר מיץ לימון`,
                        `קילו סוכר`,
                        `ליטר מים גרידה מ-4 לימונים `,
                        `300 גרם חמאה`,
                        `20 ביצים שלמות `,
                        `500 גר' חלמונים `,
                        `בצק פריך`,
                    ],
                    preparation : [
                        `בסיר בישול שמים מיץ לימון, סוכר, מים, גרידת לימונים וחמאה.`,
                        `בקערה טורפים את הביצים והחלמונים.`,
                        `שהקערה של הבישול רותחת עושים השוואת טמפ' עם החלמונים ושופכים את הביצים במהירות אל הנוזל שבסיר, מנמיכים את הלהבה וטורפים כ-5 דק' עד שהמסה מסמיכה.`,
                        `יוצקים על גבי התחתיות פאי שאפינו באפיה עיוורת ומכניסים.`,
                    ],
                },
                'מרנג' :  {
                    pic: `marenge`,
                    description: `מתאים לקרמבו/ פאי לימון/ נשיקות/ פבלובה וכו'`,
                    ingredients : [
                        `חצי ליטר חלבון `,
                        `1 ק"ג סוכר`,
                    ],
                    preparation : [
                        `מחממים בשיטת בן מרי עד שהסוכר נמס בתערובת חמה.`,
                        `מעבירים למיקסר במהירות גבוהה עד שמתקבל מרנג יציב.`,
                    ],
                },
                'עוגת-תפוזים' :  {
                    pic: `orangeCake`,
                    description: ``,
                    ingredients : [
                        `2 ביצים`,
                        `שליש כוס (66 ג') סוכר`,
                        `שליש כוס (80 מ"ל) שמן`,
                        `חצי כוס (120 מ"ל) מיץ תפוזים סחוט טרי `,
                        `כוס קמח לבן (140 גרם)`,
                        `כפית אבקת אפייה (6 גר')`,
                        `לזיגוג: 2 כפות אבקת סוכר וכף מיץ תפוזים.`,
                    ],
                    preparation : [
                        `מחממים תנור מראש ל- 180 מעלות ומשמנים תבנית אינגליש קייק.`,
                        `מערבבים בעזרת מיקסר את הביצים עם הסוכר במשך כחצי דקה.`,
                        `מוסיפים שמן, מיץ וגרידת תפוז ומערבבים.`,
                        `בקערית נפרדת מערבבים קלות עד לאיחוד חומרים (שימו לב- ערבוב יתר פוגע באווריריות העוגה)`,
                        `מעבירים את התערובת לתבנית משומנת ומכניסים לתנור החם במשך 25-30 דק', עד שהקיסם יוצא יבש.`,
                        `כשהעוגה מוכנה, מזלפים מעליה בעזרת כפית את הזיגוג ועוטפים בניילון נצמד.`,
                    ],
                },
                'עוגת-שיש' :  {
                    pic: `marbelCake`,
                    description: ``,
                    ingredients : [
                        `כוס מיץ תפוזים/ מים/ חלב סויה `,
                        `5 ביצים טרופות היטב `,
                        `לתערובת השוקולד- תוספת של 3 כפות קקאו `,
                        `2 שקיות סוכר וניל `,
                        `6 כוסות סוכר`,
                        `קילו קמח תופח מנופה`,
                        `2 כוס שמן`,
                    ],
                    preparation : [
                        `מחממים את התנור לחום של 180 מעלות.`,
                        `מוסיפים לקערה את הקמח המנופה, הסוכר, הסוכר וניל ומערבבים.`,
                        `יוצרים גומה במרכז הקערה, ושופכים לתוכה את הביצים הטרופות, השמן והחלב.`,
                        `מערבבים מעט עם כף, ולאחר מכן מערבלים במיקסר לתערובת אחידה.`,
                        `יוצקים קצת יותר מחצי התערבות לתבנית אינגליש קייק משומנת.`,
                        `לשאר התערובת הנותרת שלא יצקנו לתבנית, מוסיפים את הקקאו ומערבבים היטב לתערובת אחידה וללא גושי קקאו.`,
                        `את תערובת השוקולד שנוצרה יוצקים בעדינות מעל התערובת הבהירה ומערבבים מעט מאוד עם קיסם.`,
                        `מכניסים לתנור שחומם ואופים בין 45-60 דק'.`,
                    ],
                },
                'עוגת-שוקולד' :  {
                    pic: `choclateCake`,
                    description: ``,
                    ingredients : [
                        `2 כוסות שמן`,
                        `קילו קמח`,
                        `6 ביצים`,
                        `אבקת אפייה`,
                        `מעט סודה לשתייה בצד`,
                        `600 גרם שוקולד מריר`,
                        `2 כוסות קקאו `,
                        `כוס סוכר`,
                        `6 כוסות מים `,
                        `1 מרגרינה`,
                    ],
                    preparation : [
                        `לחמם על הגז, לקרר ולהוסיף 2 חלמונים.`,
                        `מהתערובת הזו להפריש כוס בצד.`,
                        `להקציף חלבונים עם סוכר, להוסיף את שאר החלמונים לשוקולד.`,
                        `להוסיף לקציף שמן, אבקת אפייה, סודה וקמח.`,
                        `כשהעוגה מוכנה לשפוך את השוקולד חם על העוגה (הכוס שהשארנו בצד).`,
                    ],
                },
                'עוגת-שמרים' :  {
                    pic: `yeastCake`,
                    description: ``,
                    ingredients : [
                        `1 קג קמח`,
                        `50 גרם שנרים`,
                        `150 גרם סוכר`,
                        `4 ביצים`,
                        `כף תמצית וניל`,
                        `1 גרידת לימון`,
                        `200 גרם שמן/ מרגרינה מומסת`,
                        `10 גרם מלח.`,
                        `300 גרם מים קרים.`,
                    ],
                    preparation : [
                        `בקערת מיקסר עם וו לישה שמים`,
                        `קמח, שמרים ,סוכר ומערבלים`,
                        `מוסיפים מחצית מכמות המים, הביצים ,וניל , גרידת חלימון והשמן ומערבלים.`,
                        `מוסיפים מים עד לקבלת בצק לח אך לא דביק.`,
                        `לבסוף מוסיפים את המלח.`,
                        `מערבלים כ-10 דק במהירות בנונית עד לקבלת בצק חלק ואחיד.`,
                        `מכסים בניילון נצמד ונותנים מנוחה כשעתיים.`,
                        `כאשר הבצק נח ותפח מחלקים ל-6 כדורי בצק, בעזרת מערוך מרדדים לעלה ומורחים במלית האהובה.`,
                        `יוצרים צורה מהבצק המרודד(מגלגלים לרולדה) .`,
                        `מניחים בתבנית אפיה משומנת( אינגלישקייק) ומתפיחים לשעה לפני האפיה.`,
                        `מברישים בביצה טרופה.`,
                        `מחממים תנור לחום 180 מעלות ואופים כ-25-30 דק.`,
                        `לאחר האפיה מברישים במי סוכר.`,
                    ],
                },
                'פילו-במילוי-תפוחים' :  {
                    pic: `applePastry`,
                    description: ``,
                    ingredients : [
                        `1 חבילת דפי פילו `,
                        `200 גר' חמאה`,
                        `12 יחידות תפוחים מזן סמית' (ירוקים) קלופים וחתוכים לקוביות `,
                        `כוס סוכר`,
                        `כף קינמון`,
                        `100 גר' צימוקים בהירים`,
                        `חצי חבילת ביסקוויט בהיר טחון`,
                    ],
                    preparation : [
                        `מחממים סיר בישול עם מים.`,
                        `כשהמים רותחים מכניסים את קוביות התפוחים ומבשלים כ-5 דק'.`,
                        `מוציאים, שוטפים במים קרים ומסננים היטב.`,
                        `מפוררים את הביסקוויטים.`,
                        `מוסיפים את הסוכר, קינמון וצימוקים.`,
                        `מוסיפים את התפוחים ומערבבים היטב.`,
                        `ממיסים את החמאה.`,
                        `פותחים את הפילו, לוקחים עלה ומורחים בחמאה מניחים עלה נוסף.`,
                        `חוצים את הפילו ל-6 חלקים שווים.`,
                        `מניחים קומץ מהמלית במרכז הריבוע.`,
                        `סוגרים את הריבוע למרכז ויוצרים שקיקים.`,
                        `מסדרים על מגש אפייה עם נייר.`,
                        `מקפיאים לחצי שעה.`,
                        `מחממים תנור ל-180 מעלות ואופים כ-15 דק'.`,
                        `מפזרים אבקת סוכר ומגישים.`,
                    ],
                },
                'סופלה' :  {
                    pic: `sufle`,
                    description: ``,
                    ingredients : [
                        `1 ק"ג שוקולד`,
                        `1 ק"ג מרגרינה`,
                        `600 ג' סוכר`,
                        `20 ביצים `,
                        `600 ג' קמח `,
                        `10 ג' אבקת אפייה`,
                    ],
                    preparation : [
                        `להקציף את הביצים ולהוסיף את הסוכר בהדרגה להמיס את המרגרינה ולהוסיף את השוקולד (בין מרי) מוסיפים את השוקולד והמרגרינה לביצים ולערבב בצורת קיפול. `,
                        `להוסיף בהדרגה את הקמח ואבקת אפייה וגם לערבב בצורת קיפול ליצוק לקוקוטים ולהכניס לתנור 180 מעלות כ-6 דק'.`,
                    ],
                },
                'באונטי-קוקוס' :  {
                    pic: `coconutBounty`,
                    description: ``,
                    ingredients : [
                        `250 גרם קרם קוקוס`,
                        `200 גרם סוכר`,
                        `200 גרם מרגרינה`,
                        `500 גרם קוקוס טחון `,
                        `ציפוי - שוקולד מריר 200 גרם, קרם קוקוס 100 גרם.`,
                    ],
                    preparation : [
                        `מרתיחים חלב קוקוס סוכר, תמצית וניל ומרגרינה.`,
                        `מוסיפים קוקוס טחון ומערבבים באמצעות כף עץ עד לספיגת כל הנוזל, משטחים על תבנית אפייה מרופדת בנייר אפייה, מהדקים היטב את התערובת ומעבירים למקפיא להתייצבות. `,
                        `מחממים קרם קוקוס ומוסיפים שוקולד מריר עד להמסה, מורחים מעל בסיס הקוקוס שהוקפא מפזרים קוקוס לבן או חום, מקררים ומגישים.`,
                    ],
                },
                // 'דוגמא' :  {
                //     pic: `tahinaSalad`,
                //     description: ``,
                //     ingredients : [
                //         ``,
                //     ],
                //     preparation : [
                //         ``,
                //     ],
                // },
            }, 
        }
    },
    // עמוד גלריה
    galleryPage : {
        topNavBar : {
            backgroundColor : `#0D635F`,
            img_button_menu : `3lines_white.svg`, // אודות / איקס / תפריט
            img_SearchIcon : `search_white.svg`, 
            div_topNavLine : ``,
            img_topNavTextIcon : `white_gallery.svg`,
            div_topNavText_gallery : `תמונות`,
            img_bhdLogo : `בהד 6.png`,
            img_tillLogo : `till_logo_white.svg`,
        },
        functions : [`galleryPageShowTopics()`], // פונקציות שצריכות לפעול
        content : {
            "סלט-מלפפונים-ובצל" : [`cucamberSalad`, "salads"],
            "סלט-טחינה" : [`tahinaSalad`, "salads"],
            "סלט-קולסלאו" : [`kolslowSalad`, "salads"],
            "סלט-ירק" : [`greenSalad`, "salads"],
            "סלט-גזר-אסיאתי" : [`carrotSalad`, "salads"],
            "סלט-קרפצ'יו-סלק" : [`beetSalad`, "salads"],
            "סלט-משוויה" : [`mashviaSalad`, "salads"],
            "סלט-חציל-קלוי" : [`eggPlantSalad`, "salads"],
            "סלט-בטטה-בצ'ילי-מתוק" : [`sweetPotatoSalad`, "salads"],
            "סלט-מטבוחה" : [`matbochaSalad`, "salads"],
            "סלט-חמוצים" : [`kimchiSalad`, "salads"],
            "סלט-חומוס" : [`homusSalad`, "salads"],
            "מרק-אפונה" : [`pees`, "starters"],
            "אנטיפסטי" : [`antiPasti`, "starters"],
            "מרק-תירס" : [`corn`, "starters"],
            "מרק-בצל" : [`onion`, "starters"],
            "מרק-שעועית-איטלקי" : [`beans`, "starters"],
            "מרק-עדשים-איטלקי" : [`latel`, "starters"],
            "מרק-ירקות" : [`vegtabels`, "starters"],
            "מרק-סולת" : [`solet`, "starters"],
            "מרק-כתום" : [`orange`, "starters"],
            "מרק-חרירה-מרוקאי" : [`hrira`, "starters"],
            "פלפל-ממולא" : [`stafedPeper`, "starters"],
            "ארנצ'יני" : [`arenchini`, "starters"],
            "טורטייה-במילוי-ירקות-מוקפצים" : [`stafedTortia`, "starters"],
            'אצבעות-בורקס-תפו"א-/-בטטה' : [`borecas`, "starters"],
            "מאפה-פילו-עם-תפוחי-אדמה-ופטריות" : [`potatoMashroomPastry`, "starters"],
            "שקשוקה" : [`shaksuka`, "starters"],
            "שקשוקה-בלקנית-עם-חצילים-מטוגנים" : [`balkanicShakshuka`, "starters"],
            "חביתת-ירק" : [`beans`, "starters"],
            "פנקייק" : [`pancake`, "starters"],
            "בלינצ'ס" : [`blinches`, "starters"],
            "מילוי-לבלינצ'ס-גבינה-פרווה" : [`cheeseFilling`, "starters"],
            "מילוי-לבלינצ'ס-תפוחים" : [`appleFilling`, "starters"],
            "מילוי-לבלינצ'ס-בקלוואה" : [`blinches`, "starters"],
            "בצק-לפיצה" : [`pizza`, "starters"],
            "פוקאצ'ה" : [`fukatcha`, "starters"],
            "בצק-שמרים" : [`dough`, "starters"],
            "חלות/-לחמניות" : [`buns`, "starters"],
            "אורז" : [`rice`, "sides"],
            "מג'דרה" : [`magadra`, "sides"],
            "בורגול" : [`burgul`, "sides"],
            "פריקי" : [`priki`, "sides"],
            "פסטה-איטלקית" : [`pasta`, "sides"],
            "ספגטי-ברוטב-ארביאטה" : [`spagty`, "sides"],
            "פסטה-נפוליטנה" : [`napolitana`, "sides"],
            "תפוח-אדמה-ירח" : [`potatoSlices`, "sides"],
            "תפוח-אדמה-מניפה" : [`potatofan`, "sides"],
            'תפו"א-מדורה' : [`campFirePotato`, "sides"],
            'תפו"א-ובטטה-"פוטטו"' : [`potatoAndSweetPotato`, "sides"],
            "פירה" : [`mashedPotato`, "sides"],
            'ירקות-מוקפצים' : [`chiniseVeg`, "vegan"],
            'בטטה-צלויה-בקרם-קוקוס' : [`sweetPotato`, "vegan"],
            'המבורגר-עדשים-וסויה-טחון' : [`lentelBurger`, "vegan"],
            'קרם-חציל-עם-גרגירי-חומוס' : [`eggPlantHumus`, "vegan"],
            'סיגר-פלאפל' :[ `plapelCigar`, "vegan"],
            'טורטייה-טבעונית' : [`tortilaSoy`, "vegan"],
            'רוסטביף-דלעת,-דלורית-ובטטה' : [`skwashSweetPotato`, "vegan"],
            'חזה-עוף-ממולא' : [`stafedChickenBreast`, "mainCourse"],
            'קציצות-קבב' : [`kabab`, "mainCourse"],
            'קדירת-עוף-עם-ירקות-ושומר' : [`chickenStue`, "mainCourse"],
            'שניצל-וינאי' : [`snitzel`, "mainCourse"],
            'בשר-ברוטב-צלי' : [`beefSlices`, "mainCourse"],
            'בשר-צלי-אסאדו' : [`beefstue`, "mainCourse"],
            'סטייק-פרגית-ברוטב-טריאקי' : [`pargitTariaki`, "mainCourse"],
            'סטייק-פרגית-בשום-וסילאן' : [`pargitGarlic`, "mainCourse"],
            'עראיס' : [`arais`, "mainCourse"],
            'המבורגר' : [`humburger`, "mainCourse"],
            'פילה-אמנון-בסגנון-מזרחי' :[ `amnonFish`, "mainCourse"],
            'דג-פילה-לברק/אמנון' : [`lavrekFish`, "mainCourse"],
            'בצק-עלים' : [`phillo`, "baking"],
            'בצק-פריך' : [`parich`, "baking"],
            'בראוניז-שוקולד' : [`brownize`, "baking"],
            "ספינג'" : [`spinge`, "baking"],
            'קראמבל' : [`crambele`, "baking"],
            'פאי-לימון' : [`lrmonPie`, "baking"],
            'מרנג' : [`marenge`, "baking"],
            'עוגת-תפוזים' : [`orangeCake`, "baking"],
            'עוגת-שיש' : [`marbelCake`, "baking"],
            'עוגת-שוקולד' : [`choclateCake`, "baking"],
            'עוגת-שמרים' : [`yeastCake`, "baking"],
            'פילו-במילוי-תפוחים' : [`applePastry`, "baking"],
            'סופלה' : [`sufle`, "baking"],
            'באונטי-קוקוס' : [`coconutBounty`, "baking"],
        }
    },
    // עמוד וידיאו
    videosPage : {
        topNavBar : {
            backgroundColor : `#0D635F`,
            img_button_menu : `3lines_white.svg`, // אודות / איקס / תפריט
            img_SearchIcon : `search_white.svg`, 
            div_topNavLine : ``,
            img_topNavTextIcon : `white_videos.svg`,
            div_topNavText_videos : `סרטוני הדרכה`,
            img_bhdLogo : `בהד 6.png`,
            img_tillLogo : `till_logo_white.svg`,
        },
        functions : [``], // פונקציות שצריכות לפעול
        listeners : {
            backToMain : "showPage",
        }
    },
    // עמוד חומרי לימוד
    learningPage : {
        topNavBar : {
            backgroundColor : `#0D635F`,
            img_button_menu : `3lines_white.svg`, // אודות / איקס / תפריט
            img_SearchIcon : `search_white.svg`, 
            div_topNavLine : ``,
            img_topNavTextIcon : `white_materials.svg`,
            div_topNavText_learning : `חומרי לימוד`,
            img_bhdLogo : `בהד 6.png`,
            img_tillLogo : `till_logo_white.svg`,
        },
        functions : [``], // פונקציות שצריכות לפעול
        listeners : {
            backToMain : "showPage",
        }
    },
}

// varubles
let strCurrentPage = "mainPage";
let strFormerPage = "mainPage";
let strCurrentRecipeTopic = "salads";
let nCurrentRecipeTopicNumber = 0;
let currentPicNum;
let currentPicName;

// consts
const NUMBER_OF_RECIPE_TOPICS = 5;
const NUMBER_OF_PICTUERS = 83;


/* loading function
--------------------------------------------------------------
Description: */
window.addEventListener(`load`, () => {
    document.querySelector(`.loader`).classList.add(`fade`);
    let arrMainPageButtons = document.querySelectorAll('.mainPageButton');
    for (let i = 0; i < arrMainPageButtons.length; i++) {
        arrMainPageButtons[i].addEventListener('click', showPage);
    };
    showNavBar();
    document.querySelector(`.recipesScrollContainer`).addEventListener('swiped', recipePageShowTopics);
});

/* showPage
--------------------------------------------------------------
Description:  */
const showPage = (event) => {
    // מעלים דיב קודם שומר דיב נוכחי ומראה אותו
    document.querySelector(`.${strCurrentPage}`).classList.add("hidden");
    if (event.currentTarget.classList[1] !== "x") {   // מטפל במקרה של תפריט
        if (strCurrentPage === "menuPage") {
            document.querySelector(`.${strCurrentPage}`).classList.add("hidden");
            strCurrentPage = `${event.currentTarget.classList[2]}Page`;
        } else {
            strFormerPage = strCurrentPage;
            strCurrentPage = event.currentTarget.classList[1] + "Page";
        }
    } else {
        strCurrentPage = strFormerPage;
    }
    document.querySelector(`.${strCurrentPage}`).classList.remove("hidden");
    // מראה תפריט עליון
    showNavBar();
    // שומר קטגוריה נוכחית
    if (event.currentTarget.classList[0] === "menuDropDownItemContainer") {
        switch (strCurrentPage) {
            case "recipePage":
            {
                strCurrentRecipeTopic = event.currentTarget.classList[1];
                break;
            }
            default:
            { 
                break;
            } 
        }
    }
    // מראה בר תחתון
    if (PAGES[strCurrentPage].bottomNavBar) {
        let nNumberTheSymbols = 0; 
        document.querySelector(`.${strCurrentPage} .bottomNavBar`).innerHTML = "";
        for (let key of Object.keys(PAGES[strCurrentPage].bottomNavBar)) {
            let bottomNavBarTopic = El("div", 
            {attributes: {class: `bottomNavBarTopic ${key} ${nNumberTheSymbols}`}, 
            listeners : {click : eval(`${strCurrentPage}ShowTopics`)}},
            El ("img", {attributes: {class : "bottomNavBarPic" , src: `../assets/images/grapics/recipe/${PAGES[strCurrentPage].bottomNavBar[key][1]}.svg`}}),
            El ("div", {cls: "bottomNavBarText"}, PAGES[strCurrentPage].bottomNavBar[key][0])
            );
            document.querySelector(`.${strCurrentPage} .bottomNavBar`).append(bottomNavBarTopic);
            nNumberTheSymbols++;
        }
        document.querySelector(`.${strCurrentRecipeTopic}`).classList.add("bold");
        document.querySelector(`.bottomNavBar`).scrollLeft = PAGES[strCurrentPage].bottomNavBar[strCurrentRecipeTopic][2];
    }
    // קורא לפונקציות אם צריך
    if (PAGES[strCurrentPage].functions) {
        for (let i = 0; i < PAGES[strCurrentPage].functions.length; i++) {
            eval(PAGES[strCurrentPage].functions[i]);
        }
    }
    // שם מאזינים אם צריך
    if (PAGES[strCurrentPage].listeners) {
        for (key of Object.keys(PAGES[strCurrentPage].listeners)) {
            document.querySelector(`.${strCurrentPage} .${key}`).addEventListener('click', eval(PAGES[strCurrentPage].listeners[key]));
        }
    }
    if(document.querySelector(`.recipeContent`)) {
        let recipeContent = document.querySelector(`.recipeContent`);
        document.querySelector(`.recipePage`).removeChild(recipeContent);
    }
}

/* showRecipe
--------------------------------------------------------------
Description:  */
const showRecipe = (event) => {
    // שומר מתכון וקטגוריה נוכחיים
    let strCurrentRecipe = event.currentTarget.classList[1];
    if(event.currentTarget.classList[2]) {
        strCurrentRecipeTopic = event.currentTarget.classList[2];
    }
    // אם באים מחיפוש
    if (document.querySelector('.searchScreen').classList[2] === undefined || strCurrentPage === "galleryPage") {
        document.querySelector('.searchScreen').classList.add("hidden");
        // מעלים דיב קודם שומר דיב נוכחי ומראה אותו
        document.querySelector(`.${strCurrentPage}`).classList.add("hidden");
        strCurrentPage = "recipePage";
        document.querySelector(`.${strCurrentPage}`).classList.remove("hidden");
        // מראה תפריט עליון
        showNavBar();
    }
    // מרוקן דיבים
    document.querySelector(`.recipesScrollContainer`).innerHTML = "";
    document.querySelector(`.bottomNavBar`).innerHTML = "";
    if(document.querySelector(`.recipeContent`)) {
        let recipeContent = document.querySelector(`.recipeContent`);
        document.querySelector(`.recipePage`).removeChild(recipeContent);
    }
    // יוצר מתכון ומכניס לדף
    let recipeContent = El("div", {cls : "recipeContent"},
        El("img", 
        {attributes: {class: `recipeContentPic`, 
        src : `../assets/images/foodImages/${strCurrentRecipeTopic}/${PAGES[strCurrentPage].content[strCurrentRecipeTopic][strCurrentRecipe].pic}.jpeg`}}),
        El("div", {cls : "recipeContentHeadline"}, addSpace(strCurrentRecipe)),
        El("div", {cls : "recipeContentDescription"}, PAGES[strCurrentPage].content[strCurrentRecipeTopic][strCurrentRecipe].description),
        El("div", {cls: "recipeInfoConteiner"}, // מידע על המנה
            // El("div", {classes: ["headers", "difficulty"]},
            //     El("div", {cls: "headerContainer"},
            //         El("img",{attributes: {class: `recipeInfoPics`, 
            //         src : `../assets/images/grapics/recipe/hardness_level.svg`}}),
            //         "רמת קושי:",
            //     ),
            //     El("div", {cls: "recipeInfoText"},  PAGES[strCurrentPage].content[strCurrentRecipeTopic][strCurrentRecipe].difficulty)
            // ),
            El("div", {classes: ["headers", "quantity"]},
                El("div", {cls: "headerContainer"},
                    El("img",{attributes: {class: `recipeInfoPics`, 
                    src : `../assets/images/grapics/recipe/serving_size_icon.svg`}}),
                    "כמות:",
                ),
                El("div", {cls: "recipeInfoText"},  PAGES[strCurrentPage].content[strCurrentRecipeTopic][strCurrentRecipe].quantity)
            ),
            El("div", {cls: "headers"},
                El("div", {cls: "headerContainer"},
                    El("img",{attributes: {class: `recipeInfoPics`, 
                    src : `../assets/images/grapics/recipe/timer.svg`}}),
                    "זמן הכנה:",
                ),
                El("div", {cls: "recipeInfoText"},  PAGES[strCurrentPage].content[strCurrentRecipeTopic][strCurrentRecipe].time)
            ),
        ),
        El("div", {cls : "ingredientsContainer"},
            El("div", {cls : "recipeContentIngredientHead"}, "מצרכים"),
        ),
        El("div", {cls : "preparationsContainer"},
            El("div", {cls : "recipeContentIngredientHead"}, "אופן הכנה"),
        ),
    );
    document.querySelector(`.recipePage`).append(recipeContent);
    // מכניס מצרכים
    for (let i = 0; i < PAGES[strCurrentPage].content[strCurrentRecipeTopic][strCurrentRecipe].ingredients.length; i++ ) {
        let ingredient = El("div", {cls : "ingredientContainer"},
        El("img",{attributes: {class: `ingredientCheckPic ingredientCheckPic${i}`, 
        src : `../assets/images/grapics/recipe/checkbox_blank.svg`},
        listeners : {click: onClickCheckBox}}),
        PAGES[strCurrentPage].content[strCurrentRecipeTopic][strCurrentRecipe].ingredients[i]
        );
        document.querySelector(`.ingredientsContainer`).append(ingredient);
    }
    // מכניס אופן הכנה
    for (let i = 0; i < PAGES[strCurrentPage].content[strCurrentRecipeTopic][strCurrentRecipe].preparation.length; i++ ) {
        let preparation = El("div", {cls : "preparationContainer"},
        El("img",{attributes: {class: `preparationCheckPic preparationCheckPic${i} gray`, 
        src : `../assets/images/grapics/recipe/round_checkbox.svg`},
        listeners : {click: onClickCheckBox}}),
        PAGES[strCurrentPage].content[strCurrentRecipeTopic][strCurrentRecipe].preparation[i]
        );
        document.querySelector(`.preparationsContainer`).append(preparation);
    }
    
    // כפתור חזור
    document.querySelector(`.button_menu`).setAttribute("src", "../assets/images/grapics/general/right_arrow.svg");
    document.querySelector(`.button_menu`).classList.remove("menu");
    if (event.currentTarget.classList[0] === "galleryToRecipe") {
        document.querySelector(`.button_menu`).classList.add("gallery");
    } else {
        document.querySelector(`.button_menu`).classList.add("recipe");
    }
}

/* showrecipePageTopics
--------------------------------------------------------------
Description: change hyphen to space */
const recipePageShowTopics = (event) => {
    // שם מאזינים להחלקה ושומר את הקטגוריות במערך
    let arrTopic = [];
    for (let topics of Object.keys(PAGES[strCurrentPage].content)) {
        arrTopic.push(topics);
    }

    // מוריד בולד לקטגוריה הקודמת, שומר קטגוריה נוכחית ושם עליה בולד
    document.querySelector(`.recipePage .${strCurrentRecipeTopic}`).classList.remove("bold");
    document.querySelector(`.recipePage .${strCurrentRecipeTopic} .bottomNavBarPic`).style.height = "5vh";
    if(event) { // בודק אם נעשתה לחיצה או החלקה
        if (event.currentTarget.classList[0] === "bottomNavBarTopic") { 
            document.querySelector(`.recipesScrollContainer`).scrollTop = 0;
            // בלחיצה שומר קטגוריה נוכחית ואת מספרה
            strCurrentRecipeTopic = event.currentTarget.classList[1];
            nCurrentRecipeTopicNumber = Number(event.currentTarget.classList[2]);
        } else {
            // בהחלקה בודק לאיזה כיוון ההחלקה ומשנה קטגוריה בהתאם
            if(event.detail.dir === "left" && nCurrentRecipeTopicNumber > 0) {
                document.querySelector(`.recipesScrollContainer`).scrollTop = 0;
                nCurrentRecipeTopicNumber--;
            } else if (event.detail.dir === "right" && nCurrentRecipeTopicNumber < NUMBER_OF_RECIPE_TOPICS) {
                document.querySelector(`.recipesScrollContainer`).scrollTop = 0;
                nCurrentRecipeTopicNumber++;
            }
            strCurrentRecipeTopic = arrTopic[nCurrentRecipeTopicNumber];
        }
    } else { // שומר את מספר הקטגוריה אם באים מהתפריט או מההתחלה
        nCurrentRecipeTopicNumber = Number(document.querySelector(`.recipePage .${strCurrentRecipeTopic}`).classList[2]);
    }

    document.querySelector(`.bottomNavBar`).scrollLeft = PAGES[strCurrentPage].bottomNavBar[strCurrentRecipeTopic][2];

    document.querySelector(`.recipePage .${strCurrentRecipeTopic}`).classList.add("bold");
    document.querySelector(`.recipePage .${strCurrentRecipeTopic} .bottomNavBarPic`).style.height = "6vh";
    // מוחק מידע קודם ומכניס תמונות וטקסט בהתאם לקטגוריה
    document.querySelector(`.recipesScrollContainer`).innerHTML = "";

    for(let key of Object.keys(PAGES[strCurrentPage].content[strCurrentRecipeTopic])) {
        let recipeDisplay = El("div",
        {attributes: {class: `recipeDisplay ${key}`}, 
        listeners : {click : showRecipe}},
        El("img",
        {attributes: {class: `recipeDisplayPic`, 
        src : `../assets/images/foodImages/${strCurrentRecipeTopic}/${PAGES[strCurrentPage].content[strCurrentRecipeTopic][key].pic}.jpeg`},}),
        El("div", {cls: `recipeDisplayText`}, addSpace(key))
        )
        document.querySelector(`.recipesScrollContainer`).append(recipeDisplay)
    }

}

/* galleryPageShowTopics
--------------------------------------------------------------
Description: change hyphen to space */
const galleryPageShowTopics = () => {
    let currentPic = 0;
    // מוחק מידע קודם ומכניס תמונות וטקסט בהתאם לקטגוריה
    document.querySelector(`.galleryScrollContainer`).innerHTML = "";
    for(let key of Object.keys(PAGES[strCurrentPage].content)) {
        let recipeDisplay = El("div",
        {attributes: {class: `galleryScrollDisplay ${key} ${currentPic}`}, 
        listeners : {click : showPicDisplay}},
            // El("img",
            // {attributes: {class: `galleryScrollDisplayPic`, 
            // src : `../assets/images/foodImages/gallery/${PAGES[strCurrentPage].content[key]}.jpeg`},}),
        )
        recipeDisplay.style.backgroundImage = `url(../assets/images/foodImages/gallery/${PAGES[strCurrentPage].content[key][0]}.jpeg)`
        document.querySelector(`.galleryScrollContainer`).append(recipeDisplay);
        currentPic++;
    }
}

/* showPicDisplay
--------------------------------------------------------------
Description:  */
const showPicDisplay = (event) => {
    // שם מאזין לרקע להעלמת התצוגה
    document.querySelector(`.galleryPage .darkScreen`).addEventListener("click", () => {
        document.querySelector(`.galleryPicDisplay`).classList.add("hidden");
        document.querySelector(`.galleryPage .darkScreen`).classList.add("hidden");
    });

    // בודק מה נלחץ ומשנה תמונה נוכחית בהתאם
    if(event.currentTarget.classList[0] === "rightArrow") {
        currentPicNum--;
        if (Number(currentPicNum) === -1) {
            currentPicNum = NUMBER_OF_PICTUERS;
        }
    } else if(event.currentTarget.classList[0] === "leftArrow") {
        currentPicNum++;
        if (Number(currentPicNum) === NUMBER_OF_PICTUERS + 1) {
            currentPicNum = 0;
        }
    } else if(event.currentTarget.classList[0] === "galleryScrollDisplay") {
        currentPicNum = event.currentTarget.classList[2];
    }
    // שומר שם של תמונה נוכחית
    currentPicName = Object.keys(PAGES[strCurrentPage].content)[currentPicNum];
    // מראה את תצוגת התמונה ומרוקן אותה
    document.querySelector(`.galleryPage .darkScreen`).classList.remove("hidden");
    document.querySelector(`.galleryPicDisplay`).classList.remove("hidden");
    document.querySelector(`.galleryPicDisplay`).innerHTML = "";
    // יוצר את התצוגה ומכניס לדיב
    let picDisplay = El("div", {cls : `picDisplayContiner`},
        El("img", 
        {attributes: {class: `galleryDisplayPic`, 
        src : `../assets/images/foodImages/gallery/${PAGES[strCurrentPage].content[currentPicName][0]}.jpeg`},}),
        El("div", {cls: `galleryDisplayText`}, addSpace(currentPicName)),
        El("img", {attributes: {class: `galleryToRecipe ${currentPicName} ${PAGES[strCurrentPage].content[currentPicName][1]}`, 
        src : `../assets/images/grapics/general/lamatkon_button.svg`},
        listeners : {click : showRecipe}}),
        El ("div", {cls: `galleryDisplayArrows`},
            El("img", 
            {attributes: {class: `rightArrow arrow`, 
            src : `../assets/images/grapics/general/right_arrow.svg`},
            listeners : {click : showPicDisplay}}),
            El("img", 
            {attributes: {class: `leftArrow arrow`, 
            src : `../assets/images/grapics/general/left_arrow.svg`},
            listeners : {click : showPicDisplay}}),
        )
    );
    document.querySelector(`.galleryPicDisplay`).append(picDisplay);
}

/* onClickCheckBox
--------------------------------------------------------------
Description:  */
const onClickCheckBox = (event) => {
    if (event.currentTarget.classList[0] === "preparationCheckPic") {
        if(event.currentTarget.classList[2] === "gray") {
            document.querySelector(`.${event.currentTarget.classList[1]}`).classList.remove("gray");
        } else {
            document.querySelector(`.${event.currentTarget.classList[1]}`).classList.add("gray");
        }
    } else {
        if (document.querySelector(`.${event.currentTarget.classList[1]}`).getAttribute("src") === `../assets/images/grapics/recipe/checkbox_v.svg`) {
            document.querySelector(`.${event.currentTarget.classList[1]}`).setAttribute("src", `../assets/images/grapics/recipe/checkbox_blank.svg`);
        } else {
            document.querySelector(`.${event.currentTarget.classList[1]}`).setAttribute("src", `../assets/images/grapics/recipe/checkbox_v.svg`);
        }
    }

}

/* showMenu
--------------------------------------------------------------
Description:  */
const showMenu = () => {
    // מוחק מידע קודם ומכניס תמונות וטקסט בהתאם לקטגוריה
    document.querySelector(`.menuPage`).innerHTML = "";
    for(let key of Object.keys(PAGES.menuPage.content)) {
        let menuDisplay = El("div",{classes: [`menuContainer`, key]},
            El("div",
            {attributes: {class: `menuItem`}}, 
                El("div", {classes: [`menuItemContainer`,"container", key],
                listeners : {click : showPage}}, 
                    El("img",
                    {attributes: {class: `menuItemicon`, 
                    src : `../assets/images/grapics/menu/${PAGES.menuPage.content[key][1]}.svg`},}),
                    PAGES.menuPage.content[key][0],
                ),
                El("img",
                    {attributes: {class: `menuItemArrow ${key}`, 
                    src : `../assets/images/grapics/menu/dropdown_sideArrow.svg`},
                    listeners : {click : menuDropDown}}),
                )
        )
        document.querySelector(`.menuPage`).append(menuDisplay)
    }

}

/* menuDropDown
--------------------------------------------------------------
Description:  */
const menuDropDown = (event) => {
    let currentPage = event.currentTarget.classList[1];
    let objCurrentDropDown = PAGES.menuPage.content[event.currentTarget.classList[1]][2];
    // מראה דרופ דאון
    if (document.querySelector(`.menuPage > .${currentPage} > .menuItem`).lastChild.getAttribute("src") === "../assets/images/grapics/menu/dropdown_sideArrow.svg") {
        document.querySelector(`.menuPage > .${currentPage} > .menuItem`).lastChild.setAttribute("src", "../assets/images/grapics/menu/opened_dropdown.svg");
        for(let key of Object.keys(objCurrentDropDown)) {
            let menuDropDown = 
                El("div", {classes: [`menuDropDownItemContainer`, key, currentPage],
                listeners : {click : showPage}}, 
                    El("img",
                    {attributes: {class: `menuDropDownItemicon`, 
                    src : `../assets/images/grapics/menu/${objCurrentDropDown[key][1]}.svg`},}),
                    objCurrentDropDown[key][0],
                );
            document.querySelector(`.menuPage > .${currentPage}`).append(menuDropDown)
        }
    } else { // מעלים דרופ דאון
        document.querySelector(`.menuPage > .${currentPage} > .menuItem`).lastChild.setAttribute("src", "../assets/images/grapics/menu/dropdown_sideArrow.svg");
        let arrDropDownItems = document.querySelectorAll(`.menuPage > .${currentPage} .menuDropDownItemContainer`);
        for (let i = 0; i < arrDropDownItems.length; i++) {
            document.querySelector(`.menuPage > .${currentPage}`).removeChild(arrDropDownItems[i]);
        };
    }



}

/* onClickSearch
--------------------------------------------------------------
Description:  */
const onClickSearch = () => {
    document.querySelector('.searchScreen').classList.remove("hidden");
    document.querySelector(`.closeSearch`).addEventListener('click', () => {
        document.querySelector('.searchScreen').classList.add("hidden");
    });
    document.querySelector(`.searchBox`).addEventListener("input", onSearch);
}

/* onSearch
--------------------------------------------------------------
Description: cheack for search match and creat dropdown accordingly */
const onSearch = () => {
    document.querySelector('.dropDown').innerHTML = "";
    // עובר על כול הקטגוריות של המתכונים
    for (let keys of Object.keys(PAGES.recipePage.content)){
        // בכול קטגוריה, עובר על כול המתכונים ומחפש התאמה לחיפוש
        for (let key of Object.keys(PAGES.recipePage.content[keys])) {
            let strUserInput = document.querySelector(`.searchBox`).value;
            if(key.includes(strUserInput) && strUserInput !== ""){
                let dropDownItem = El("div", {classes : ["dropDownItem", key, keys], listeners : {click : showRecipe}}, addSpace(key))
                document.querySelector('.dropDown').append(dropDownItem);
            }
        }
    
    }
}

/* showNavBar
--------------------------------------------------------------
Description: change hyphen to space */
const showNavBar = () => {
    // מוחק מידע קודם ומכניס תפריט ניווט עליון לפי העמוד הנוכחי 
    document.querySelector(`.topNavBar`).innerHTML = "";
    for (key of Object.keys(PAGES[strCurrentPage].topNavBar)) {
        let navBarItem
        if (key.slice(0,3) === "img") {
            if (key.includes("button")) { // כפתור עליון שמאלי
                navBarItem = El(key.slice(0,3), 
                { attributes: { src: `../assets/images/grapics/topNavBar/${PAGES[strCurrentPage].topNavBar[key]}`, class: `${key.slice(4)} ${key.slice(11)}`},
                listeners: {click : showPage}});
                document.querySelector(`.topNavBar`).append(navBarItem);
            } else if (key === "img_SearchIcon") { // חיפוש
                navBarItem = El(key.slice(0,3), 
                { attributes: { src: `../assets/images/grapics/topNavBar/${PAGES[strCurrentPage].topNavBar[key]}`, class: key.slice(4)},
                listeners: {click : onClickSearch}});
                document.querySelector(`.topNavBar`).append(navBarItem);
            }else if (key === "img_home"){
                navBarItem = El(key.slice(0,3), 
                { attributes: { src: `../assets/images/grapics/topNavBar/${PAGES[strCurrentPage].topNavBar[key]}`, class: `${key.slice(4)} backToHome main`},
                listeners: {click : showPage}});
                document.querySelector(`.topNavBar`).append(navBarItem);
            }else { // סמלים
                navBarItem = El(key.slice(0,3), 
                { attributes: { src: `../assets/images/grapics/topNavBar/${PAGES[strCurrentPage].topNavBar[key]}`, class: key.slice(4)}});
                document.querySelector(`.topNavBar`).append(navBarItem);
            }
        } else if (key.slice(0,3) === "div"){ // כותרת
            if(key.slice(4,14) === "topNavText") {
                navBarItem = El(key.slice(0,3), { classes: [key.slice(4,14), key.slice(15)], listeners : {click: showPage}}, PAGES[strCurrentPage].topNavBar[key]);
                document.querySelector(`.topNavBar`).append(navBarItem);
            } else {
                navBarItem = El(key.slice(0,3), { cls: key.slice(4)}, PAGES[strCurrentPage].topNavBar[key]);
                document.querySelector(`.topNavBar`).append(navBarItem);
            }
        } else { // צבע רקע
            document.querySelector(`.topNavBar`).style[key] = PAGES[strCurrentPage].topNavBar[key];
        }
    }
}

/* addSpace
--------------------------------------------------------------
Description: change hyphen to space */
const addSpace = (phrase) => {
    return phrase.replace(/-/g, ' ');
}


//   @template T
//   @param {keyof HTMLElementTagNameMap} tagName 
//   @param {{classes?: string[], cls?: string, id?: string, attributes: {[index: string]: string | { toString(): string }}, listeners: Listeners}} options 
//   @param  {...string | Node} children 
function El(tagName, options = {}, ...children) {
    let el = Object.assign(document.createElement(tagName), options.fields || {});
    if (options.classes && options.classes.length) el.classList.add(...options.classes);
    else if (options.cls) el.classList.add(options.cls);
    if (options.id) el.id = options.id;
    el.append(...children.filter(el => el));
    for (let listenerName of Object.keys(options.listeners || {}))
        if (options.listeners[listenerName]) el.addEventListener(listenerName, options.listeners[listenerName], false);
    for (let attributeName of Object.keys(options.attributes || {})) {
        if (options.attributes[attributeName] !== undefined) el.setAttribute(attributeName, options.attributes[attributeName]);
    }
    return el;
}