let PAGES = {
    // עמוד ראשי
    mainPage : {
        topNavBar : {
            backgroundColor : `#0D635F`,
            img_button_about : `about_icon.svg`, // אודות / איקס / תפריט
            div_topNavText_main : `מתכונט - מתכונים בשלוף`,
            img_bhdLogo : `בהד 6.png`,
            img_tillLogo : `till_logo_white.svg`,
        },
    },
    // עמוד אודות
    aboutPage : {
        topNavBar : {
            backgroundColor : `#0D635F`,
            img_button_menu : `3lines_white.svg`, // אודות / איקס / תפריט
            img_SearchIcon : `search_white.svg`, 
            div_topNavLine : ``,
            div_topNavText_about : `אודות`,
            img_tillLogo : `about_icon.svg`,
        },
        listeners : {
            backToMain : "showPage",
        }
    },
    // עמוד תפריט
    menuPage : {
        topNavBar : {
            backgroundColor : `#E8E8E8`,
            img_button_x : `x_nobackground.svg`, // אודות / איקס / תפריט
            img_SearchIcon : `green_search.svg`, 
            div_topNavLineGray : ``,
            img_home : `home_no_circle.svg`, 
            img_bhdLogo : `בהד 6.png`,
            img_tillLogo : `till_logo_black.svg`,
        },
        functions : [`showMenu()`], // פונקציות שצריכות לפעול
        content : {
            recipe : ["ספר מתכונים","black_cookbook", { // תפריט נפתח
                salads : ["סלטים", "black_salads"],
                starters : ["מנות ראשונות", "black_starters"],
                sides : ["מנות ביניים", "black_sidedishes"],
                vegan : ["מנות טבעוניות", "black_vegan"],
                mainCourse : ["מנות עיקריות", "black_maincourse"],
                baking : ["קונדיטוריה", "black_baking"],
            }],
            learning : ["סוגים 1-5","black_materials", { // תפריט נפתח
                subject1 : ["מטבח", "kitchen-black"],
                subject2 : ["חומרים", "materials-black"],
                subject3 : ["בשר", "meats-black"],
                subject4 : ["דגים", "fish-black"],
            }],
            gallery : ["תמונות","black_gallery", { // תפריט נפתח
                recipes : ["מתכונים", "black_cookbook"],
                events : ["אירועים", "black_events"],
            }],
            videos : ["סרטוני הדרכה","black_videos", { // תפריט נפתח
                recipes : ["מתכונים", "black_cookbook"],
                safety : ["בטיחות", "black_protection"],
                publicHealth : [`בוה"צ`, "black_health"],
            }],
        }
    },
    // ספר מתכונים
    recipePage : { 
        topNavBar : {
            backgroundColor : `#0D635F`,
            img_button_menu : `3lines_white.svg`, // אודות / איקס / תפריט
            img_SearchIcon : `search_white.svg`, 
            div_topNavLine : ``,
            img_topNavTextIcon : `white_cookbook.svg`,
            div_topNavText_recipe : `ספר מתכונים`,
            img_bhdLogo : `בהד 6.png`,
            img_tillLogo : `till_logo_white.svg`,
        },
        bottomNavBar : { // סמלים של הקטגוריות של המתכונים
            salads : ["סלטים", "green_salads", 0],
            starters : ["מנות ראשונות", "green_starters", 0],
            sides : ["מנות ביניים", "green_sidedishes", -100],
            vegan : ["מנות טבעוניות", "green_vegan", -245],
            mainCourse : ["מנות עיקריות", "green_maincourse", -450],
            baking : ["קונדיטוריה", "green_baking", -450],
        },  
        functions : [`showTopics()`], // פונקציות שצריכות לפעול
        content : {
            salads : { // תת נושא
                "סלט-מלפפונים-ובצל" : {
                    pic: `cucamberSalad`,
                    description: ``,
                    quantity: `10 מנות`,
                    time: `10 דקות`,
                    ingredients : [
                        `5-6 מלפפונים`,
                        `1 בצל סגול/לבן `,
                        `שליש כפית מלח`,
                        `מעט פלפל`,
                        `כף שמן`,
                        `חצי לימון סחוט`,
                    ],
                    preparation : [
                        `מורידים ראש וזנב, עושים 2-3 פסים למלפפון עם קולפן.`,
                        `חותכים את המלפפונים בצורה אלכסונית.`,
                        `מתבלים ומוסיפים פטרוזיליה או שמיר.`,
                    ],
                },
                "סלט-טחינה" : {
                    pic: `tahinaSalad`,
                    description: ``,
                    quantity: `10-15 מנות`,
                    time: `10 דקות`,
                    ingredients : [
                        `500 מ"ל טחינה גולמית`,
                        `חצי כף מלח`,
                        `מעט פלפל`,
                        `3 שיני שום`,
                        `1/2 לימון טרי`,
                        `צרור פטרוזיליה`,
                        `400 מ"ל מים`,
                        `3 קוביות קרח`,
                    ],
                    preparation : [
                        `מרוקנים את תוכן הקופסא לקערה.`,
                        `מוסיפים 80% מהנפח מים על כמות הטחינה ומערבבים.`,
                        `מוסיפים תבלינים, לימון, שום וממשיכים לערבב.`,
                        `מוסיפים קצת קוביות קרח כדי להשלים נוזל קר לקבלת טחינה בהירה. `,
                        `מעטרים בפטרוזיליה.`,
                    ],
                },
                "סלט-קולסלאו" :  {
                    pic: `kolslowSalad`,
                    description: `כרוב לבן עם גזר`,
                    quantity: `5 מנות`,
                    time: `10 דקות`,
                    ingredients : [
                        `1/2 כרוב לבן`,
                        `1 גזר מגורד`,
                        `צרור פטרוזיליה/שמיר`,
                        `4-5 כפות מיונז`,
                        `1/3 כפית מלח`,
                        `מעט`,
                        `מעט חומץ/מיץ לימון`,
                    ],
                    preparation : [
                        `קוצצים את הכרוב שיפונד דק (שערות דקות) משרים במי מלח למשך 10 דקות.`,
                        `לאחר מכן רצוי לפזר מעט מלח על הכרוב ולתת לו לנוח במסננת להורדת נוזלים.`,
                        `מגרדים גזר, מוסיפים מיונז ומתבלים להשלמת הטעם.`,
                        `לבסוף מעטרים בפטרוזיליה/שמיר.`,
                    ],
                },
                "סלט-ירק" :  {
                    pic: `greenSalad`,
                    description: ``,
                    quantity: `10 מנות`,
                    time: `15 דקות`,
                    ingredients : [
                        `צרור סלרי עלים`,
                        `5 גבעולים סלרי גבעולים`,
                        `חבילה של פטורזיליה`,
                        `צרור כוסברה`,
                        `מעט נענע`,
                        `חופן בוטנים/אגוזי לוז/קשיו קלוי/גרעיני חמנייה/גרעיני דלעת`,
                        `חופן חמוציות`,
                        `כפית חומץ`,
                        `כף סילאן`,
                        `חצי כף שמן זית`,
                        `חצי כף לימון`,
                        `חצי כף מלח`,
                        `מעט פלפל`,
                    ],
                    preparation : [
                        `מנקים את הירקות ומשרים במי מלח כ-10 דק'.`,
                        `קוצצים את כל הירק אחיד ומוסיפים את סוג הפיצוחים עם החמוציות, מתבלים ומגישים.`,
                    ],
                },
                "סלט-גזר-אסיאתי" :  {
                    pic: `carrotSalad`,
                    description: `סלט גזר אסיאתי חמוץ חריף בשום`,
                    quantity: `10 מנות`,
                    time: `15 דקות`,
                    ingredients : [
                        `5 יח' גזר `,
                        `4 שיני שום `,
                        `1 פלפל חריף `,
                        `צרור כוסברה`,
                        `1 ו1/2 לימון`,
                        `כף שמן זית `,
                        `1/2 כף מלח`,
                        `מעט פלפל `,
                    ],
                    preparation : [
                        `חותכים את הגזר לג'וליאן (סיני).`,
                        `קוצצים פלפל חריף, כותשים שום ומוסיפים לגזר.`,
                        `סוחטים לימון ומתבלים בשמן זית, מלח, פלפל, ומעטרים בכוסברה.`,
                    ],
                },
                "סלט-קרפצ'יו-סלק" :  {
                    pic: `beetSalad`,
                    description: ``,
                    quantity: `10 מנות`,
                    time: `15 דקות`,
                    ingredients : [
                        `2-3 יח' סלק אדום `,
                        `2 כפות שמן זית`,
                        `1/2 לימון טרי`,
                        `2 כפות בלסמי`,
                        `מעט מלח גס`,
                        `מעט פלפל גרוס `,
                        `מספר עלים בזיליקום/עירית/רוקט`,
                    ],
                    preparation : [
                        `פורסים פרוסות דקות של סלק עם מנדולינה או ביד דק דק.`,
                        `מסדרים על הצלחת, בוזקים שמן זית, לימון טרי, בלסמי מצומצם.`,
                        `מתבלים במלח גס ופלפל גרוס מעטרים בבזיליקום טרי.`,
                    ],
                },
                "סלט-משוויה" :  {
                    pic: `mashviaSalad`,
                    description: ``,
                    quantity: `10 מנות`,
                    time: `25 דקות`,
                    ingredients : [
                        `4-5 עגבנייה`,
                        `1 בצל`,
                        `1 פלפל חריף`,
                        `5 שיני שום`,
                        `צרור פטרוזיליה `,
                        `חצי כפית מלח`,
                        `מעט פלפל`,
                        `2 כפות שמן זית`,
                        `2 כפות לימון`,
                    ],
                    preparation : [
                        `שורפים את העגבנייה, הבצל והפלפל החריף על האש.`,
                        `קולפים וקוצצים חיתוך גס.`,
                        `קוצצים שום, מתבלים בשמן זית, מלח ופלפל גרוס.`,
                        `מוסיפים מעט לימון מעטרים בפטרוזיליה ומגישים.`,
                    ],
                },
                "סלט-חציל-קלוי" :  {
                    pic: `eggPlantSalad`,
                    description: `סלט חציל קלוי על האש`,
                    quantity: `10 מנות`,
                    time: `25 דקות`,
                    ingredients : [
                        `2 חציל`,
                        `5 שיני שום`,
                        `1/2 לימון`,
                        `צרור פטרוזיליה`,
                        `כפית מלח`,
                        `מעט פלפל`,
                        `4 כפות שמן זית`,
                    ],
                    preparation : [
                        `שורפים חציל על אש גלויה- פותחים את החציל, מוציאים את התוכן מהקליפה וקוצצים אותו.`,
                        `מוסיפים שום קצוץ, לימון, מלח, פלפל, שמן זית.`,
                        `לעטר בפטרוזיליה ולבזוק מעל שמן זית.`,
                        `לצורת ההגשה אפשר להחזיר את החציל לקליפה השרופה`,
                    ],
                },
                "סלט-בטטה-בצ'ילי-מתוק" :  {
                    pic: `sweetPotatoSalad`,
                    description: ``,
                    quantity: `10 מנות`,
                    time: `25 דקות`,
                    ingredients : [
                        `3-4 יח' בטטה`,
                        `כף שום כתוש`,
                        `חופן בוטנים`,
                        `50 מ"ל צ'ילי מתוק/סילאן + סויה`,
                        `חצי כפית מלח`,
                        `מעט פלפל`,
                    ],
                    preparation : [
                        `חותכים בטטה לצורת צ'יפס דק ומטגנים אות עד לצבע זהוב.`,
                        `מתבלים בצ'ילי, שום, מלח ופלפל.`,
                        `אפשרות שניה להחליף את הצ'ילי המתוק לסילאן וסויה.`,
                        `מוסיפים בוטנים, אפשר לעטר גם בשומשום קלוי.`,
                    ],
                },
                "סלט-מטבוחה" :  {
                    pic: `matbochaSalad`,
                    description: ``,
                    quantity: `10 מנות`,
                    time: `2.5-3 שעות`,
                    ingredients : [
                        `1 ק"ג עגבניות אדומות בשלות`,
                        `2 יח' פלפל חריף`,
                        `ראש שום`,
                        `2 כפות פפריקה`,
                        `כף סוכר`,
                        `80 מ"ל שמן `,
                        `צרור כוסברה `,
                        `1/2 כף מלח `,
                    ],
                    preparation : [
                        `מבשלים את העגבניות בישול במים (טומט קונקסה) כ-10 דק' ומורידים את הקליפה.`,
                        `קוצצים את העגבניות לסיר, מוסיפים שיני שום.`,
                        `מבשלים על אש נמוכה כ2-4 שעות עם מכסה.`,
                        `מטגנים פלפל חריף, מקלפים וקוצצים לסיר.`,
                        `מערבבים שמן עם פפריקה ומוסיפים לסיר.`,
                        `משלימים מלח וסוכר, מוסיפים בגמר הבישול כוסברה קצוצה.`,
                    ],
                },
                "סלט-חמוצים" :  {
                    pic: `kimchiSalad`,
                    description: ``,
                    quantity: `10 מנות`,
                    time: `20 דקות`,
                    ingredients : [
                        `5 יח' גזר`,
                        `1 יח' גמבה אדומה/כתומה`,
                        `1 יח' פלפל ירוק`,
                        `1/4 כרוב לבן`,
                        `1 יח' פלפל חריף`,
                        `4 שיני שום`,
                        `2 יח' לימון`,
                        `כף מלח`,
                        `מעט פלפל`,
                        `כף שמן`,
                    ],
                    preparation : [
                        `חותכים את הירקות לצורה הרצויה ג'וליאן או 2 ס"מ.`,
                        `סוחטים לימון לפי הצורך – 90% , חומץ 10%.`,
                        `מוסיפים שום, מלח, פלפל ושמן.`,
                    ],
                },
                "סלט-חומוס" :  {
                    pic: `homusSalad`,
                    description: ``,
                    quantity: `20 מנות`,
                    time: `2 שעות`,
                    ingredients : [
                        `1 ק"ג גרגירי חומוס`,
                        `טחינה גולמית (על כל כוס חומוס 1/3 כוס טחינה)`,
                        `מים (מי בישו לחומוס לפי צורך, בערך 200 מ"ל)`,
                        `כף מלח`,
                        `כפית כמון`,
                        `1/3 לימון`,
                        `כף סודה לשתייה`,
                    ],
                    preparation : [
                        `משרים את גרגירי החומוס בקערה עם מים למשך 12 שעות לפחות. מחליפים מים ומשרים לעוד שעה.`,
                        `מבשלים את הגרגירים בסיר עם מים וכף סודה לשתייה.`,
                        `מביאים לרתיחה, מסירים קצף בישול וממשיכים לבשל עד ריכוך מלא.`,
                        `מסננים את הגרגירים ממי הבישול.`,
                        `שמים את הגרגירים במעבד מזון, מוסיפים רבע כמות נוזל בישול וטוחנים היטב עד מרקם חלק.`,
                        `מוסיפים טחינה גולמית, מלח, מעט כמון, לימון סחוט וממשיכים לטחון עד למרקם חלק במיוחד.`,
                        `משטחים בצלחת ומעטרים בגרגירי חומוס, שמן זית, פטרוזיליה ומגוון תוספות שאוהבים.`,
                    ],
                },
                'טאבולה' :  {
                    pic: `tabula`,
                    description: ``,
                    quantity: `20 מנות`,
                    time: `50 דקות`,
                    ingredients : [
                        `1 ק"ג בורגול עבה`,
                        `צרור פטרוזיליה`,
                        `5-6 גבעולי עלי נענע`,
                        `4-5 עגבניות`,
                        `כף מלח`,
                        `חצי כפית פלפל שחור`,
                        `1 לימון סחוט`,
                        `6-8 כפות שמן זית`,
                        `מים`,
                    ],
                    preparation : [
                        `משרים את הבורגול במים חמים למשך חצי שעה. (יחס מים ובורגול 1 על 1)`,
                        ` מכסים ולאחר שהמים נספגו, פותחים את הבורגול, בעזרת ערבוב עם מזלג. `,
                        `קוצצים את הירק והעגבניה ומוסיפים לבורגול. `,
                        `מטבלים בשמן זית, לימון, מלח, ופלפל בתאבון.`,
                    ],
                },    
                'סלט-תירס-מקסיקני' :  {
                    pic: `mexicanCorn`,
                    description: ``,
                    quantity: `15 מנות`,
                    time: `15 דקות`,
                    ingredients : [
                        `חצי בצל סגול`,
                        `2 קופסאות גרעיני תירס`,
                        `1 יחידה פלפל אדום`,
                        `1 קופסא פטריות חתוכות משומרות`,
                        `3 עלים מגבעולי שמיר`,
                        `כף שמן`,
                        `חצי לימון סחוט`,
                    ],
                    preparation : [
                        `מסננים גרעיני תירס משומר לקערה.`,
                        ` קוצצים את הפטריות עם שאר הירקות ומוסיפים לקערה.`,
                        ` מטבלים, מערבבים ומגישים. בתאבון!`,
                    ],
                },
                'כרוב-לבן-בסגנון-אסייתי' :  {
                    pic: `cabbge`,
                    description: ``,
                    quantity: `20 מנות`,
                    time: `20 דקות`,
                    ingredients : [
                        `ראש כרוב לבן `,
                        `כפית שמן שומשום`,
                        `כף סילאן`,
                        `חצי לימון סחוט`,
                        `כף שומשום קלוי`,
                        `חצי כף שטוחה מלח `,
                        `חצי כפית פלפל שחור גרוס`,
                        `כף סויה`,
                    ],
                    preparation : [
                        `חותכים את הכרוב לרצועות "שיפונד" משרים במי מלח ושוטפים או לחילופין משתמשים בכרוב חתוך "מהדרין".`,
                        ` משרה - כפית שמן שומשום כף סילאן, חצי לימון סחוט, כף סויה. `,
                        `מערבבים ויוצקים על הכרוב, מתבלים, במלח, פלפל, ומערבבים שוב. מוסיפים שומשום קלוי לקישוט.`,
                    ],
                },
                'קרפצו-חציל' :  {
                    pic: `tahinaSalad`,
                    description: ``,
                    quantity: `10 מנות`,
                    time: `2.5-3 שעות`,
                    ingredients : [
                        ``,
                    ],
                    preparation : [
                        ``,
                    ],
                },
                // 'דוגמא' :  {
                //     pic: `tahinaSalad`,
                //     description: ``,
                //     quantity: `10 מנות`,
                //     time: `2.5-3 שעות`,
                //     ingredients : [
                //         ``,
                //     ],
                //     preparation : [
                //         ``,
                //     ],
                // },
            }, 
            starters : { // תת נושא
                "מרק-אפונה-מחיתי" :  {
                    pic: `pees`,
                    description: ``,
                    quantity: `5 מנות`,
                    time: `2.5 שעות`,
                    ingredients : [
                        `1 גזר חתוך ברונאז'`,
                        `1 בצל בינוני חתוך ברונאז'`,
                        `3 יח' גבעולי סלרי חתוכים ברונאז'`,
                        `כף שמן`,
                        `500 גר' אפונה יבשה `,
                        `כפית מלח`,
                        `כפית כמון`,
                        `מעט כורכום`,
                        `מעט פלפל שחור`,
                        `שום`,
                        `ליטר מים`,
                    ],
                    preparation : [
                        `מאדים את הירקות בסיר ביחד עם השמן, מוסיפים 2 כוסות אפונה יבשה, מוסיפים מים עד לכיסוי התכולה.`,
                        `מבשלים כ-90 דקות על אש גבוהה ומוסיפים מים במידת הצורך.`,
                        ` כאשר האפונה רכה, טוחנים במוט בלנדר ולאחר מכן, מטבלים במלח, פלפל, כמון, כורכום ושום.`,
                        `להשלמת המנה יש לקצוץ פטרוזיליה ולהשלים לפני ההגשה.`,
                    ],
                },
                "אנטיפסטי" :  {
                    pic: `antiPasti`,
                    description: ``,
                    quantity: `15 מנות`,
                    time: `30 דקות`,
                    ingredients : [
                        `2 יח' פלפל אדום`,
                        `כוס שמן זית`,
                        `2 יח' פלפל ירוק`,
                        `רבע כוס חומץ בלסמי`,
                        `2 יח' פלפל צהוב`,
                        `1 בצל`,
                        `4 יח' עגבניות`,
                        `כף מלח גס`,
                        `כפית פלפל גרוס`,
                        `כפית סוכר`,
                        `2 יח' בטטות`,
                        `2 ראשי שום`,
                        `1 יח' חציל`,
                        `1/3 כוס רוזמרין`,
                    ],
                    preparation : [
                        `חותכים את הירקות לצורה הרצויה (פרוסות/ירח/חצאים)`,
                        `בוזקים שמן זית ובלסמי.`,
                        `מגרדים שיני שום.`,
                        `מתבלים בפיזור מלח גס/שולחן, פלפל שחור גרוס ורוזמרין.`,
                        `אופים בתנור חם על 220 מעלות כ-15-20 דק'.`,
                    ],
                },
                "מרק-תירס" :  {
                    pic: `corn`,
                    description: `מרק תירס אמריקאי עם שבבי קורנפלקס`,
                    quantity: `10 מנות`,
                    time: `45 דקות`,
                    ingredients : [
                        `50 גרם מחמאה`,
                        `פלפל אדום חתוך לקוביות קטנות`,
                        `כוס בצל קצוץ`,
                        `תירס`,
                        `2 ליטר נוזל עוף`,
                        `שמיר קצוץ`,
                        `כפית שום כתוש`,
                        `מלח`,
                        `פלפל`,
                        `חלב קוקוס`,
                    ],
                    preparation : [
                        `ממיסים את השומן ומאדים את הבצל, מוסיפים את השום ומערבבים.`,
                        `מוסיפים את הנוזל והתירס ומביאים לרתיחה.`,
                        `מבשלים כ- 15-20 דק' עד לריכוך התירס.`,
                        `מסננים וטוחנים במעבד מזון.`,
                        `מחזירים את הנוזל עד לקבלת סמיכות רצויה. משלימים טעם.`,
                        `מוסיפים את חלב הקוקוס.`,
                        `מקשטים את המרק (שמיר, פלפל אדום וקורנפלקס) ומגישים.`,
                    ],
                },
                "מרק-בצל" :  {
                    pic: `onion`,
                    description: ``,
                    quantity: `4 מנות`,
                    time: `2 שעות`,
                    ingredients : [
                        `2-3 בצלים גדולים`,
                        `2 כפות קמח`,
                        `80 מ"ל יין אדום`,
                        `50 גרם מחמאה`,
                        `כפית מלח`,
                        `מעט פלפל שחור`,
                        `ליטר מים`,
                    ],
                    preparation : [
                        `משחימים את הבצל, חותכים ומטגנים את הבצל עד לקבלת צבע זהוב. `,
                        `מוסיפים את הקמח והפלפל השחור. `,
                        `מורידים משקע בעזרת היין, מוסיפים נוזל וחומרי טעם.`,
                        `מבשלים עוד כ-שעה וחצי על אש נמוכה`,
                        `ניתן להגיש עם קרוטונים.`,
                    ],
                },
                "מרק-שעועית-איטלקי" :  {
                    pic: `beans`,
                    description: ``,
                    quantity: `8 מנות`,
                    time: `2 שעות`,
                    ingredients : [
                        `1 יח' גזר חתוך ברונאז' `,
                        `1 יח' בצל בינוני חתוך ברונאז' `,
                        `4 יח' גבעולי סלרי חתוכים ברונאז'`,
                        `2 כפות שמן`,
                        `500 גר' שעועית לבנה מבושלת`,
                        `כוס עגבניות טומט קונקסה חתוכות ברונאז'`,
                        `5 שיני שום`,
                        `100 גרם פסטה מבושלת אל דנטה`,
                        `כף מלח`,
                        `כפית כמון`,
                        `מעט פלפל שחור`,
                        `2 ליטר מים`,
                    ],
                    preparation : [
                        `מחממים שמן בסיר ומשחימים את הירקות (גזר, בצל וסלרי).`,
                        `מוסיפים מים ולאחר מכן מוסיפים את השעועית, מכסים את הסיר ולאחר 90 דק' מתבלים את המרק.`,
                        `בזמן ההגשה מוסיפים פסטה אל המרק.`,
                        `להשלמת המנה יש לקצוץ פטרוזיליה ועלי סלרי בגמר הבישול.`,
                    ],
                },
                "מרק-עדשים-קטיפתי" :  {
                    pic: `latel`,
                    description: ``,
                    quantity: `8 מנות`,
                    time: `1.5 שעות`,
                    ingredients : [
                        `500 גר' עדשים ירוקות `,
                        `1 יח' גזר חתוך ברונאז'`,
                        `1 יח' בצל בינוני חתוך ברונאז' `,
                        `3-4 יח' גבעולי סלרי חתוכים ברונאז' `,
                        `2 כפות שמן`,
                        `4 שיני שום`,
                        `כף מלח`,
                        `מעט פלפל שחור`,
                        `כפית כמון`,
                        `1/2 כפית כורכום`,
                        `2 ליטר מים`,
                        `1/3 יח' לימון`,
                        `כף קורנפלור/קמח`,
                        `חצי כוס פטרוזיליה/כוסברה קצוצה`,
                    ],
                    preparation : [
                        `מחממים שמן בסיר, מטגנים את הבצל, גזר וסלרי.`,
                        `מוסיפים מים ושום.`,
                        `לאחר מכן, מוסיפים את העדשים ומבשלים עד לריכוך.`,
                        `מטבלים ומסמיכים אם יש צורך בקורנפלור או קמח.`,
                        `להשלמת המנה יש לקצוץ פטרוזיליה ולסחוט מעט לימון.`,
                    ],
                },
                "מרק-ירקות-עשיר" :  {
                    pic: `vegtabels`,
                    description: ``,
                    quantity: `8 מנות`,
                    time: `1.5 שעות`,
                    ingredients : [
                        `2 יח' גזר שלם`,
                        `1 יח'בצל בינוני חתוך ברונאז'`,
                        `4 יח' גבעולי סלרי חתוכים ברונאז'`,
                        `2 יח' קישוא שלם`,
                        `2 יח' תפו"א שלם`,
                        `צרור כוסברה/פטרוזיליה`,
                        `2 כפות שמן`,
                        `1/2 כף מלח`,
                        `מעט פלפל שחור`,
                        `חצי כפית כורכום`,
                        `2 ליטר מים`,
                    ],
                    preparation : [
                        `מטגנים את הבצל והסלרי במעט שמן, ממלאים את הסיר במים ומוסיפים את התפו"א, גזר וקישוא, מבשלים עד לריכוך מלא.`,
                        ` מוציאים את הירקות מהנוזל, מועכים אותם ומחזירים אותם לנוזל.`,
                        `מרתיחים, מטבלים ומשלימים בכוסברה/פטרוזיליה קצוצה.`,
                    ],
                },
                "מרק-סולת" :  {
                    pic: `solet`,
                    description: `מרק סולת בשום שמיר`,
                    quantity: `8 מנות`,
                    time: `30-40 דקות`,
                    ingredients : [
                        `5 שיני שום כתושים`,
                        `צרור שמיר קצוץ`,
                        `כף שמן`,
                        `כוס סולת`,
                        `1/2 כף מלח`,
                        `מעט פלפל שחור`,
                        `2 ליטר מים`,
                    ],
                    preparation : [
                        `מחממים מים בסיר, מוסיפים את השום ולאחר מכן מוסיפים את השמיר הקצוץ, מביאים לרתיחה.`,
                        `מוסיפים את הסולת בהדרגה תוך כדי ערבוב מתבלים את המרק.`,
                    ],
                },
                "מרק-כתום-מחיתי" :  {
                    pic: `orange`,
                    description: ``,
                    quantity: `8 מנות`,
                    time: `1.5 שעות`,
                    ingredients : [
                        `1/2 יח' דלורית`,
                        `2 בטטות`,
                        `רבע דלעת`,
                        `2 גזר`,
                        `כף מלח`,
                        `מעט פלפל שחור`,
                        `כף מרק עוף`,
                        `2 ליטר מים`,
                    ],
                    preparation : [
                        `מחממים מים בסיר, מוסיפים את הירקות, מביאים לרתיחה, טוחנים את הירקות עד למרקם אחיד ומתבלים את המרק.`,
                        `להשלמת המנה יש להוסיף מעט קרם קוקוס לקישוט ועידון הטעמים.`,
                    ],
                },
                "מרק-חרירה-מרוקאי" :  {
                    pic: `hrira`,
                    description: ``,
                    quantity: `8 מנות`,
                    time: `2 שעות`,
                    ingredients : [
                        `2 יח' בצל`,
                        `5 יח' סלרי`,
                        `250 גר' גרגירי חומוס`,
                        `180 גר' עדשים ירוקות`,
                        `חופן אטריות`,
                        `1 יח' עגבנייה`,
                        `צרור כוסברה`,
                        `כף מלח`,
                        `מעט פלפל `,
                        `כף קמח`,
                        `2 ליטר מים`,
                        `1/2 כפית כורכום`,
                    ],
                    preparation : [
                        `קוצצים את הסלרי והבצל, מטגנים בסיר עם מעט שמן (אפשרי להוסיף בשר).`,
                        `מוסיפים עגבנייה קצוצה ללא קליפה וממשיכים לאדות.`,
                        `מוסיפים מים לפי הצורך של הכמות הרצויה ומרתיחים את המים.`,
                        `מוסיפים את גרגירי החומוס ונותנים להם להתבשל עד ריכוך.`,
                        `כחצי שעה לפני מוסיפים את העדשים ירוקות, מבשלים אותן ובסוף מוסיפים תיבול ומעט אטריות.`,
                        `מסמיכים את המרק עם שתי כפות קמח ע"פ הצורך.`,
                    ],
                },
                "פלפל-ממולא" :  {
                    pic: `stafedPeper`,
                    description: `פלפל ממולא אורז ברוטב עגבניות`,
                    quantity: `8 מנות`,
                    time: `1.5 שעות`,
                    ingredients : [
                        `1 ק"ג אורז מבושל`,
                        `2 יח' בצל בינוני חתוך ברונאז'`,
                        `8 יח' גמבה אדומה`,
                        `צרור פטרוזיליה `,
                        `4 יח' עגבניות מרוסקות `,
                        `3 כפות שמן`,
                        `5 שיני שום`,
                        `200 גר' רסק עגבניות`,
                        `כף מלח`,
                        `כף כמון`,
                        `1/2 כפית פלפל שחור`,
                        `ליטר מים`,
                    ],
                    preparation : [
                        `מחממים סיר שטוח ורחב עם השמן ומוסיפים את הבצל עד להזהבה.`,
                        `מוסיפים את רסק העגבניות והעגבניות המרוסקות ומערבבים.`,
                        `מוסיפים את התבלינים ומערבבים.`,
                        `לאחר מכן מוסיפים את המים הרותחים.`,
                        `שוטפים את הפלפלים ומורידים את הראש ממלאים את הפלפלים באורז.`,
                        `מסדרים בתוך הסיר בצפיפות וממשיכים בישול על אש נמוכה כ-45 דקות.`,
                    ],
                },
                "ארנצ'יני" :  {
                    pic: `arenchini`,
                    description: `כדורי ריזוטו אורז ופטריות מטוגן בפירורי מאפה`,
                    quantity: `20 מנות`,
                    time: `2 שעות`,
                    ingredients : [
                        `1 ק"ג אורז ריזוטו`,
                        `3 כפות שמן זית`,
                        `2 יח' בצל`,
                        `סלסלה פטריות`,
                        `3-4 שיני שום `,
                        `כוס יין לבן`,
                        `1.5 ליטר ציר ירקות/מים`,
                        `50 גר' מחמאה`,
                        `1 ק"ג פירורי מאפה`,
                        `4 יח' ביצה`,
                        `300 גר' קמח`,
                    ],
                    preparation : [
                        `מאדים את הבצל עם הפטריות והשום במעט שמן, מוסיפים את האורז ומטגנים קלות.`,
                        `מוסיפים שליש מכמות הנוזלים ומצמצים.`,
                        `ממשיכים להוסיף שני שליש מהנוזל בכמויות קטנות תוך כדי ערבוב כאשר האורז מוכן קושרים עם קוביות מחמאה.`,
                        `מקררים ומכדררים, מצפים בקמח, ביצה ופירורי מאפה ומטגנים בשמן עמוק.`,
                    ],
                },
                "טורטייה-במילוי-ירקות-מוקפצים" :  {
                    pic: `stafedTortia`,
                    description: ``,
                    quantity: `8 מנות`,
                    time: `30 דקות`,
                    ingredients : [
                        `8 טורטיות `,
                        `1 יח' בצל סגול`,
                        `1 יח' בצל לבן`,
                        `3-4 שיני שום`,
                        `1 פלפל אדום`,
                        `1 פלפל ירוק`,
                        `1 פלפל צהוב `,
                        `1/4 כרוב לבן`,
                        `2 גזר `,
                        `1/2 סלסלה נבטים`,
                        `2 כפות שמן זית`,
                        `כפית מלח`,
                        `מעט פלפל גרוס`,
                        `טריאקי/צ'ילי מתוק/צ'ילי חריף`,
                    ],
                    preparation : [
                        `שמים בווק/מחבת מעט שמן זית ומחממים.`,
                        `מקפיצים את הירקות לפי דרגת קושי.`,
                        `מתחילים עם הגזר, פלפלים, בצל ובסוף את הירקות הדינים כגון: כרוב, נבטים ועשבי תיבול.`,
                        `ההקפצה צריכה להיות כמה דקות כדי להשאיר את הירקות קריספיים ולא מושי, לא לגמור את הירקות.`,
                        `לתבל בתבלינים ואפשרי להשתמש ברטבים לפי טעם.`,
                        `למלא בטורטייה, לגלגל ולהגיש.`,
                    ],
                },
                'אצבעות-בורקס-תפו"א-/-בטטה' :  {
                    pic: `borecas`,
                    description: ``,
                    quantity: `24 מנות`,
                    time: `30 דקות`,
                    ingredients : [
                        `1 ק"ג בצק עלים`,
                        `5 יח' תפו"א או בטטה`,
                        `כף מרק עוף`,
                        `קורט מלח`,
                        `קורט פלפל שחור`,
                        `1 יח' ביצה`,
                        `מעט שומשום`,
                    ],
                    preparation : [
                        `מרדדים בצק עלים וחותכים לצורה הנדרשת – מלבן\\מרובע.`,
                        `מבשלים את התפו"א\\בטטה למחית ומתבלים.`,
                        `ממלאים, מקפלים לצורה הנדרשת, מורחים ביצה, מפזרים שומשום ואופים על 180 מעלות למשך 20 דקות`,
                    ],
                },
                "מאפה-פילו-עם-תפוחי-אדמה-ופטריות" :  {
                    pic: `potatoMashroomPastry`,
                    description: ``,
                    quantity: `20 מנות`,
                    time: `1 שעות`,
                    ingredients : [
                        `כף שמן זית `,
                        `1 יח' בצל קצוץ`,
                        `סלסלה פטריות פרוסות`,
                        `5 יח' תפוחי אדמה מבושלים במים`,
                        `1 ק"ג עלי בצק פילו`,
                        `כפית מלח`,
                        `מעט פלפל שחור גרוס`,
                        `1 יח' ביצה טרופה / שמן זית`,
                        `(אם רוצים טבעוני אז מורחים בשמן זית)`,
                        `מעט שומשום`,
                    ],
                    preparation : [
                        `מטגנים במחבת את הבצל והפטריות.`,
                        `מועכים את תפוחי האדמה בקערה, מוסיפים את תערובת הבצל והפטריות, ממליחים ומפלפלים.`,
                        `משמנים תבנית אפייה במעט שמן זית, פורשים שניים מעלי הפילו על משטח העבודה זה על זה ומברישים את העלה העליון במעט שמן זית.`,
                        `מניחים מעט מהמילוי לכל אורך העלה העליון ומגלגלים.`,
                        `אחרי שני גלגולים חותכים את הפילו לאורכו וחוזרים על הפעולה עם שאריות הפילו והמילוי.`,
                        `מברישים את הגלילים במעט ביצה טרופה, מפזרים את השומשום ואופים ב-170 מעלות כ-18 דקות עד שהפילו מזהיב יפה.`,
                    ],
                },
                "שקשוקה" :  {
                    pic: `shaksuka`,
                    description: ``,
                    quantity: `10 מנות`,
                    time: `30 דקות`,
                    ingredients : [
                        `10 שיני שום `,
                        `2 יח' פלפל חריף`,
                        `20 יח' עגבניות קוביות (טומט קוסקנה)`,
                        `20 ביצים`,
                        `כף מלח`,
                        `חצי כפית פלפל שחור`,
                        `3 כפות פפריקה`,
                        `כפית כמון `,
                        `1/3 כוס שמן זית`,
                        `2 כפות רסק עגבניות `,
                    ],
                    preparation : [
                        `מחממים סיר רחב שוליים, מוסיפים מעט שמן זית, זורקים את השום והפלפל החריף.`,
                        `מטלטלים מעט לפתיחת הטעמים ולאחר מכן מוסיפים את העגבניות קוביות מבשלים עד לריכוך ופירוק מלא של העגבניות.`,
                        `מוסיפים כוס מים ורסק עגבניות, מרתיחים, מתבלים ומערבבים היטב.`,
                        `לאחר מכן שוברים את כמות הביצים הרצויה.`,
                        `מנמיכים את האש, מכסים, מבשלים כ-10 דק'.`,
                    ],
                },
                "שקשוקה-בלקנית-עם-חצילים-מטוגנים" :  {
                    pic: `balkanicShakshuka`,
                    description: ``,
                    quantity: `10 מנות`,
                    time: `30 דקות`,
                    ingredients : [
                        `20 ביצים`,
                        `2 יח' פלפל חריף`,
                        `10 שיני שום`,
                        `2 יח' חצילים`,
                        `1/3 כוס שמן`,
                        `15-20 יח' עגבניות קוביות (טומט קונקסה)`,
                        `כף מלח`,
                        `כפית פלפל שחור`,
                        `כפית כמון `,
                        `3 כפות פפריקה`,
                        `2 כפות רסק עגבניות`,
                    ],
                    preparation : [
                        `חותכים את החצילים לקוביות מטגנים ומניחים בצד.`,
                        `מחממים סיר רחב שוליים עם מעט שמן.`,
                        `מוסיפים את הפלפל חריף ושום לפתיחת טעמים.`,
                        `מוסיפים את העגבניות קוביות, מבשלים עד לריכוך ומוסיפים חצי כוס מים ואת הרסק עגבניות.`,
                        `מוסיפים את החצילים המטוגנים, מערבבים ומטבלים.`,
                        `שוברים לתוך הרוטב את הביצים ומורידים לאש נמוכה כ- רבע שעה.`,
                        `מנמיכים את האש, מכסים, מבשלים כ-10 דק'.`,
                    ],
                },
                "חביתת-ירק" :  {
                    pic: `beans`,
                    description: ``,
                    quantity: `10 מנות`,
                    time: `20 דקות`,
                    ingredients : [
                        `20 יח' ביצים`,
                        `צרור פטרוזיליה קצוצה`,
                        `2 יח' בצל קצוץ`,
                        `סלסלה פטריות חתוכות `,
                        `1/2 כוס שמן זית`,
                        `כפית מלח`,
                        `חצי כפית פלפל שחור`,
                    ],
                    preparation : [
                        `מחממים מחבת עם מעט שמן, שוברים את הביצים לתוך קערה.`,
                        `טורפים את הביצים ומתבלים במלח, פלפל, בצל קצוץ, פטריות חתוכות ופטרוזיליה.`,
                        `שופכים את הבלילה למחבת עד להשחמה והופכים לבישול הצד השני.`,
                    ],
                },
                'דג-לברק-אפוי-בנייר-אפייה' :  {
                    pic: `lavrakFish`,
                    description: ``,
                    quantity: `10 מנות`,
                    time: `20 דקות`,
                    ingredients : [
                        `10 יחידות לברג דג`,
                        `צרור כוסברה`,
                        `5 צילי אדום חריף`,
                        `ראש שום`,
                        `4-5 כפות סויה`,
                        `1 יחידה לימון`,
                        `חצי כוס כפות שמן זית`,
                        `כף שטוחה מלח`,
                        `כפית פלפל גרוס`,
                        `נייר אפייה`,
                    ],
                    preparation : [
                        `סוחטים על הדג לימון ומלח לכמה דקות ושוטפים אותו במים קרים. `,
                        `חותכים נייר אפייה לשניים (לאורך).`,
                        ` מזלפים על הנייר מעט שמן זית, מפזרים כוסברה ופרוסות שום ומניחים את הדג במרכז. `,
                        `מערבבים בקערה את שמן הזית, לימון, סויה, תבלינים למשרה, מושכים את הדג, מעטרים בכוסברה, פרוסות שום, וטבעות צילי חריף. `,
                        `מקפלים את הנייר על הדג בצורת מעטפה וסוגרים בצורת סוכרייה מהצדדים. `,
                        `מכניסים לאפייה של כ - 8 דקות.`,
                        ` פותחים ונהנים מטעמים מיוחדים, בתאבון!`,
                    ],
                },
                'מאפה-פילו-במילוי-בשר' :  {
                    pic: `filloStuffedMeat`,
                    description: ``,
                    quantity: `40 מנות`,
                    time: `1.25 שעות`,
                    ingredients : [
                        `שמן זית`,
                        `חבילה של עלה בצק פילו`,
                        `מעט שומשום`,
                        `1 קילו בשר טחון`,
                        `3 בצלים`,
                        `צרור כוסברה`,
                        `100 גרם צנוברים\פיסטוקים`,
                        `כף מלח `,
                        `כפית פלפל שחור`,
                        `כפית בהרט`,
                        `מעט צילי גרוס`,
                        `4-5 כפות שמן זית`,
                    ],
                    preparation : [
                        `מחממים מחבת עם מעט שמן זית. `,
                        `מוסיפים את הבצל קצוץ ומטגנים קלות. `,
                        `שופכים את הבשר טחון ומטלטלים אותו עד שיהיה מבושל. `,
                        `מטבלים בפלפל, מלח, צילי גרוס, בהרט וכוסברה`,
                        `, מוסיפים צנוברים\פיסטוקים קלויים.`,
                    ],
                },
                // 'דוגמא' :  {
                //     pic: `tahinaSalad`,
                //     description: ``,
                //     quantity: `10 מנות`,
                //     time: `2.5-3 שעות`,
                //     ingredients : [
                //         ``,
                //     ],
                //     preparation : [
                //         ``,
                //     ],
                // },
                
            }, 
            sides : { // תת נושא
                "אורז-מאודה" :  {
                    pic: `rice`,
                    description: ``,
                    quantity: `10 מנות`,
                    time: `30 דקות`,
                    ingredients : [
                        `2 כוסות אורז`,
                        `4 כוסות מים רותחים`,
                        `כף מלח`,
                        `מעט פלפל לבן`,
                        `2 כפות שמן`,
                    ],
                    preparation : [
                        `מרתיחים מים, מאדים את האורז בשמן, מוסיפים תבלינים, מבשלים על אש נמוכה כ-18 דקות (סיר מכוסה).`,
                        `משאירים את הסיר מכוסה כ-5 דקות.`,
                    ],
                },
                "מג'דרה" :  {
                    pic: `magadra`,
                    description: `אורז עם עדשים`,
                    quantity: `10 מנות`,
                    time: `35 דקות`,
                    ingredients : [
                        `1 כוס אורז`,
                        `1 כוס עדשים ירוקות`,
                        `2 יח' בצל`,
                        `כף מלח`,
                        `חצי כפית פלפל `,
                        `כפית כמון`,
                    ],
                    preparation : [
                        `מטגנים את הבצל בשמן ומוסיפים את האורז, ממשיכים טיגון ומתבלים.`,
                        `מוסיפים את העדשים המבושלות, מים פי 2 מכמות האורז ומנמיכים את האש ל-18 דקות.`,
                    ],
                },
                "בורגול-עם-ירקות" :  {
                    pic: `burgul`,
                    description: ``,
                    quantity: `10 מנות`,
                    time: `20 דקות`,
                    ingredients : [
                        `1 יח' בצל`,
                        `2 יח' גזר`,
                        `גבעול סלרי`,
                        `1 יח' בטטה`,
                        `כוס אפונה סנפרוסט`,
                        `2 כוס בורגול`,
                        `2 כפות שמן`,
                        `כף מלח`,
                        `מעט כורכום`,
                        `3 כוס מים רותחים`,
                    ],
                    preparation : [
                        `מטגנים את הירקות במעט שמן.`,
                        `מוסיפים את הבורגול ומטלטלים את הירקות מעט.`,
                        `מתבלים, מוסיפים מים רותחים פי 1.5 מכמות הבורגול, מבשלים כ-8 דקות על אש נמוכה ומכבים.`,
                    ],
                },
                "פריקי" :  {
                    pic: `priki`,
                    description: ``,
                    quantity: `10 מנות`,
                    time: `40 דקות`,
                    ingredients : [
                        `2 כוס חיטה`,
                        `2 יח' בצל לבן וסגול`,
                        `30 מ"ל סילאן`,
                        `כף שטוחה מלח`,
                        `חצי כפית פלפל`,
                        `2 כפות שמן זית`,
                        `5 כוס מים רותחים`,
                    ],
                    preparation : [
                        `מטגנים את הבצל במעט שמן זית, מוסיפים את החיטה לטלטול/חימום, מתבלים ומוסיפים כמות מים רותחים פי 2 מכמות החיטה.`,
                        `מבשלים על אש נמוכה כ-16-20 דקות, בסוף הבישול מוסיפים פטרוזיליה לקישוט/טעם.`,
                    ],
                },
                "פסטה-איטלקית-ברוטב-עגבניות" :  {
                    pic: `napolitana`,
                    description: ``,
                    quantity: `10 מנות`,
                    time: `35 דקות`,
                    ingredients : [
                        `1 ק"ג פסטה פנה`,
                        `5 יח' עגבניות `,
                        `3 כפות שמן זית `,
                        `6 שיני שום`,
                        `2 כפות פפריקה מתוקה`,
                        `כף מלח `,
                        `חצי כפית פלפל`,
                        `אפשר להוסיף 200 גר' רסק עגבניות לסמיכות, מרקם וטעם`,
                    ],
                    preparation : [
                        `מרתיחים סיר מים לבישול הפסטה ביחס 1/10 עם שמן וכף מלח. `,
                        `לבשל את הפסטה לסנן ולשטוף, (לפי הוראות הבישול של היצרן).`,
                        `לשים בסיר שמן זית לטלטל מעט את השום להוצאת טעם של אש נמוכה. להוסיף את העגבניות המגורדות ולבשל.`,
                        `לתבל בפפריקה, מלח ופלפל. להסמיך למרקם קטיפתי עם שמנת מתוקה. שופכים את הפסטה לרוטב להמשיך בישול ומגישים.`,
                    ],
                },
                "ספגטי-ברוטב-ארביאטה" :  {
                    pic: `spagty`,
                    description: `פסטה חריפה ברוטב עגבניות`,
                    quantity: `10 מנות`,
                    time: `35 דקות`,
                    ingredients : [
                        `1 ק"ג פסטה ספגטי `,
                        `5 יח' עגבניות מגורדות `,
                        `3 כפות שמן זית`,
                        `6 שיני שום `,
                        `עלי בזיליקום `,
                        `מעט צ'ילי גרוס `,
                        `כף שטוחה מלח`,
                        `חצי כפית פלפל שחור גרוס`,
                        `כף פפריקה מתוקה`,
                        `אפשר להוסיף 200 גר' רסק עגבניות לסמיכות, מרקם וטעם`,
                    ],
                    preparation : [
                        `מבשלים את הפסטה לפי הוראות היצרן, עם שמן וכף מלח.`,
                        `שמים בסיר שמן זית ומטלטלים את השום.`,
                        `טיגון קל על אש נמוכה להוצאת הטעמים.`,
                        `מוסיפים את הבזיליקום גם כן לטיגון קל ומוסיפים את העגבניות המגורדות.`,
                        `מבשלים כ- 10 דקות ומוסיפים את הצ'ילי גרוס, מלח, פלפל שחור גרוס ופפריקה מתוקה.`,
                        `מוסיפים מים לפי צורך לרוטב (אפשרי ממי הבישול)`,
                        `שופכים את הפסטה לרוטב להמשך בישול ומגישים.`,
                    ],
                },
                "פסטה-נפוליטנה" :  {
                    pic: `pasta`,
                    description: ``,
                    quantity: `10 מנות`,
                    time: `35 דקות`,
                    ingredients : [
                        `1 ק"ג פסטה טריאטלה / פנה`,
                        `3 כפות שמן זית`,
                        `5-6 יח' עגבניות מגורדות `,
                        `1 יח' בצל`,
                        `שום `,
                        `200 גר' זיתי קלמטה`,
                        `כף פפריקה`,
                        `כף מלח`,
                        `מעט פלפל`,
                        `עלי בזיליקום/אורגנו/טימין`,
                    ],
                    preparation : [
                        `מרתיחים סיר עם מים לבישול הפסטה ביחד 1/10, עם שמן וכף מלח. `,
                        `מבשלים את הפסטה, מסננים ושוטפים.`,
                        `שמים במחבת שמן זית ומטלטלים את הבצל, טיגון קל על אש נמוכה.`,
                        `מוסיפים את העגבניות לבישול של 10 דקות ומוסיפים את הזיתים, התבלינים ועשבי התיבול.`,
                        `שופכים את הפסטה המבושלת לרוטב להמשך בישול ומגישים.`,
                    ],
                },
                "תפוח-אדמה-ירח-אפוי" :  {
                    pic: `potatoSlices`,
                    description: `אפוי בקליפתו`,
                    quantity: `10 מנות`,
                    time: `40 דקות`,
                    ingredients : [
                        `15 יח' תפוח אדמה בינוני לבן`,
                        `2 כפות שמן זית`,
                        `כף שטוחה מלח`,
                        `כפית פלפל שחור גרוס`,
                        `עלי טימין/רוזמרין`,
                    ],
                    preparation : [
                        `שוטפים את התפוח אדמה עם סקוץ', חותכים את התפוח אדמה לצורת "ירח" עם הקליפה.`,
                        `מתבלים בשמן זית, מלח, פלפל גרוס ורוזמרין.`,
                        `אופים בתנור שחומם מראש ל-200 מעלות למשך 30-40 דקות.`,
                        `אם זה תנור ביתי אז 30 דקות עם נייר כסף ועוד 10 דקות ללא הנייר לקבלת השחמה.`,
                    ],
                },
                "תפוח-אדמה-מניפה-ירח" :  {
                    pic: `potatofan`,
                    description: `אפוי בקליפתו`,
                    quantity: `10 מנות`,
                    time: `15 דקות`,
                    ingredients : [
                        `20 יח' תפוח אדמה קטן`,
                        `4 כפות שמן זית`,
                        `כף מלח`,
                        `כפית פלפל גרוס`,
                        `2 כפיות שום כתוש`,
                    ],
                    preparation : [
                        `שוטפים את התפוח אדמה, פורסים אותו לצורת מניפה, פרוסות כאשר התפו"א בשלמותו ולא חתוך עד הסוף.`,
                        `מסדרים בתבנית, בוזקים שמן זית, מפזרים מלח, פלפל גרוס ושום כתוש.`,
                        `מכסים בנייר כסף ואופים בתנור על 200 מעלות למשך 30 דקות.`,
                        `מורידים את הנייר כסף ואופים לעוד 10 דקות כדי לקבל השחמה.`,
                    ],
                },
                'תפו"א-מדורה-צלוי' :  {
                    pic: `campFirePotato`,
                    description: ``,
                    quantity: `10 מנות`,
                    time: `45 דקות`,
                    ingredients : [
                        `15 יח' תפו"א לבן`,
                        `כף שטוחה מלח גס`,
                        `3 כפות שמן זית`,
                        `כפית פלפל גרוס`,
                        `2 כוסות מלח גס למצע`
                    ],
                    preparation : [
                        `מרפדים תבנית אפייה במלח גס ומניחים את התפו"א על המלח. `,
                        `אופים בחום גבוה כ-220 מעלות.`,
                        `בגמר אפייה מוציאים, מועכים ומשלימים תיבול – מלח גס, פלפל גרוס ושמן זית.`,
                        `*יש אפשרות לקצר את התהליך ולבשל במים את התפו"א בקליפה, לקרר ולמעוך על תבנית ולהשחים בתנור.`,
                    ],
                },
                'תפו"א-ובטטה-"פוטטו"' :  {
                    pic: `potatoAndSweetPotato`,
                    description: ``,
                    quantity: `10 מנות`,
                    time: `45 דקות`,
                    ingredients : [
                        `10 יח' תפוח אדמה`,
                        `6 יח' בטטה`,
                        `1 ליטר שמן לטיגון`,
                        `50 גר' תיבול "קייג'ין"`,
                        `כף מלח`,
                    ],
                    preparation : [
                        `שוטפים את תפוח האדמה והבטטה ופורסים אותם לצורת ירח או פרוסות.`,
                        `מבשלים בישול במים (בלונשיר) ומקררים.`,
                        `מטגנים בשמן עמוק.`,
                        `מוציאים מהשמן ומתבלים בתבלין "קייג'ין" ומלח.`,
                    ],
                },
                "פירה" :  {
                    pic: `mashedPotato`,
                    description: ``,
                    quantity: `10 מנות`,
                    time: `30 דקות`,
                    ingredients : [
                        `20 יח' תפוח אדמה לבן (התפוח אדמה המושלם לפירה מזן ראטה) `,
                        `כף מלח`,
                        `150 גר' מחמאה (פרווה)`,
                    ],
                    preparation : [
                        `שוטפים את התפוח אדמה ומבשלים אותם בקליפתם במים קרים עם כף מלח.`,
                        `בישול איטי על מנת שכל התפוח אדמה יתרכך.`,
                        `כאשר התפוח אדמה רך, מסננים אותו ומייבשים אותו.`,
                        `מקלפים את הקליפה ומועכים אותו היטב.`,
                        `משלימים טעם ושמים מחמאה.`,
                        `מגישים. אפשר להוסיף עשבי תיבול.`,
                    ],
                },
            }, 
            vegan : { // תת נושא
                'ירקות-מוקפצים' :  {
                    pic: `chiniseVeg`,
                    description: `ירקות מוקפצים עם חטיפי סויה בסגנון סיני`,
                    quantity: `10 מנות`,
                    time: `35 דקות`,
                    ingredients : [
                        `350 גר' חטיפי סויה`,
                        `2 יח' גזר`,
                        `2 יח' בצל`,
                        `1 יח' פלפל אדום`,
                        `1 יח' פלפל צהוב`,
                        `1 יח' פלפל ירוק`,
                        `כוס נבטים`,
                        `רבע כרוב`,
                        `כוס תירס/תירס גמדי`,
                        `כף מלח`,
                        `חצי כפית פלפל`,
                        `כף שום כתוש`,
                        `80 מ"ל רוטב טריאקי`,
                        `מעט ג'ינג'ר `,
                        `3-4 כפות שמן זית`,
                        `הגשה: בוטנים קצוצים / שומשום`,
                    ],
                    preparation : [
                        `מבשלים את חטיפי הסויה במים ומסננים.`,
                        `מקפיצים בווק את הירקות לפי דרגת קושי מהקשה לרך/עדין.`,
                        `מוסיפים את חטיפי הסויה.`,
                        `מתבלים ומגישים.`,
                        `מעטרים בבוטנים קלויים.`,
                    ],
                },
                'בטטה-צלויה-בקרם-קוקוס' :  {
                    pic: `sweetPotato`,
                    description: ``,
                    quantity: `10 מנות`,
                    time: `1 שעות`,
                    ingredients : [
                        `7 יח' בטטה`,
                        `פחית חלב קוקוס`,
                        `מעט מלח`,
                        `מעט פלפל`,
                        `מעט צ'ילי טרי`,
                    ],
                    preparation : [
                        `פורסים את הבטטה לפרוסות ומסדרים בתבנית.`,
                        `יוצקים חלב קוקוס.`,
                        `מתבלים מלח, פלפל עם צ'ילי ואופים כ-20 דקות על 180 מעלות.`,
                    ],
                },
                'המבורגר-עדשים-וסויה-טחון' :  {
                    pic: `lentelBurger`,
                    description: ``,
                    quantity: `10 מנות`,
                    time: `50 דקות`,
                    ingredients : [
                        `2 כוס עדשים שחורות/ירוקות`,
                        `2 בצל מטוגן`,
                        `1 כוס סויה טחון`,
                        `סלסלה פטריות שמפניון`,
                        `כף מלח`,
                        `כף פלפל שחור גרוס`,
                        `חצי כוס פירורי מאפה`,
                        `חצי כפית פלפל שחור טחון`,
                    ],
                    preparation : [
                        `מבשלים את העדשים השחורות כ- 20-25 דקות.`,
                        `מבשלים את הסויה הטחון כ-3 דקות.`,
                        `קוצצים בצל ומטגנים אותו בשמן זית ומוסיפים לעדשים ולסויה.`,
                        `מתבלים ומוסיפים קצת פירורי מאפה.`,
                        `מעבדים לכתיתות המבורגר וצולים על מחבת/פלאנצ'ה.`,
                        `מגישים עם טבעות בצל מושחמות.`,
                        `אפשר להוסיף פטריות קצוצות מטוגנות בשמן זית.`,
                    ],
                },
                'קרם-חציל-עם-גרגירי-חומוס' :  {
                    pic: `eggPlantHumus`,
                    description: ``,
                    quantity: `10 מנות`,
                    time: `1 שעות`,
                    ingredients : [
                        `3 חציל`,
                        `5 שיני שום`,
                        `2 כוסות גרגירי חומוס`,
                        `1 לימון טרי`,
                        ` 1/2 כוס שמן זית`,
                        `20 גר' סילאן`,
                        `כף שטוחה מלח`,
                        `חצי כפית פלפל`,
                        `40 גר' טחינה גולמית`,
                        `צרור פטרוזיליה`,
                    ],
                    preparation : [
                        `מבשלים את גרגירי החומוס בסיר עם מים כשעה עד ריכוך.`,
                        `מסננים ומניחים בצד.`,
                        `שורפים חציל על אש גלויה.`,
                        `מסננים מנוזלם, מקלפים את הקליפה וטוחנים במעבד מזון.`,
                        `מוסיפים שום כתוש, לימון, סילאן, מלח, פלפל ושמן זית.`,
                        `מצלחתים, סוחטים מעט לימון, שמן זית ומלח.`,
                        `יוצקים את גרגירי החומוס ומזלפים טחינה גולמית.`,
                        `מעטרים בפטרוזיליה ומגישים.`,
                    ],
                },
                'סיגר-פלאפל' :  {
                    pic: `plapelCigar`,
                    quantity: `10 מנות`,
                    time: `1 שעות`,
                    description: `סיגר ממולא פלאפל מטוגן`,
                    ingredients : [
                        `2 כוס גרגירי חומוס`,
                        `צרור כוסברה`,
                        `צרור פטרוזיליה `,
                        `1 בצל`,
                        `5 שיני שום`,
                        `1 יח' פלפל חריף`,
                        `כפית כמון`,
                        `20 יח' עלי סיגר`,
                        `כף שטוחה מלח`,
                        `חצי כפית פלפל שחור`,
                        `50 גר' קמח`,
                    ],
                    preparation : [
                        `מבשלים את החומוס עד שמתרכך.`,
                        `טוחנים במעבד מזון את החומוס, כוסברה ופטרוזיליה.`,
                        `מוסיפים את הבצל, הפלפל והשום, טוחנים את הכל יחד עד שמגיעים למרקם מחיתי.`,
                        `מתבלים במלח, פלפל וכמון.`,
                        `מוציאים את התערובת ושמים בשק זילוף.`,
                        `סוגרים עם קמח וקצת מים (דבק).`,
                        `מטגנים עד שמשחים.`,
                    ],
                },
                'טורטייה-טבעונית' :  {
                    pic: `tortilaSoy`,
                    description: `טורטייה טבעונית במילוי צ'ילי קונקרה בסויה טחון`,
                    quantity: `10 מנות`,
                    time: `1 שעות`,
                    ingredients : [
                        `10 יח' טורטייה `,
                        `1.5 ק"ג סויה טחון`,
                        `כוס שעועית לבנה`,
                        `2 יח' פלפל צ'ילי אדום/ צ'ילי גרוס- שאטה`,
                        `2 יח' בצל `,
                        `2 יח' עגבנייה `,
                        `צרור כוסברה`,
                        `1/3 כוס שמן זית`,
                    ],
                    preparation : [
                        `מבשלים את הסויה טחון בישול במים כ-3 דקות.`,
                        `מטגנים בצל במעט שמן זית, מוסיפים צ'ילי חריף, קוביות קצוצות של עגבנייה מקולפת ללא גרעינים.`,
                        `מוסיפים שעועית לבנה שבושלה מראש, מלח פלפל וכוסברה.`,
                        `ממלאים את הטורטייה ומגלגלים.`,
                    ],
                },
                'רוסטביף-דלעת,-דלורית-ובטטה' :  {
                    pic: `skwashSweetPotato`,
                    description: ``,
                    quantity: `10 מנות`,
                    time: `1 שעות`,
                    ingredients : [
                        `1 ק"ג דלעת`,
                        `1 ק"ג דלורית`,
                        `כף חרדל דיז'ון`,
                        `כף חרדל חלק`,
                        `90 סמ"ק סויה`,
                        `50 גר' סילאן `,
                        `מעט צ'ילי גרוס`,
                        `20 סמ"ק חומץ בלסמי`,
                        `50 סמ"ק שמן זית `,
                        `כפית מלח גס`,
                        `כפית פלפל שחור גרוס`,
                        `כפית טימין יבש`,
                        `כפית מלח דק`,
                    ],
                    preparation : [
                        `קולפים את הדלעת, דלורית ובטטה.`,
                        `חוצים לשניים ומוציאים את הגרעינים והשערות.`,
                        `מכניסים את כל הנוזלים והתבלינים למג'ימיקס.`,
                        `מורחים את הירקות בתערובת.`,
                        `מחממים תנור ל- 200 מעלות וצולים את הרוסביף למשך- 30 40 דקות.`,
                        `מוציאים ופורסים על בוצר בזמן הארוחה- קארווינג.`,
                    ],
                },
            }, 
            mainCourse : { // תת נושא
                'חזה-עוף-ממולא' :  {
                    pic: `stafedChickenBreast`,
                    description: `חזה עוף במילוי דוקסל פטריות צרוב על מחבת פסים והשלמה בתנור`,
                    quantity: `4 מנות`,
                    time: `35 דקות`,
                    ingredients : [
                        `4 יחידות חזה עוף ללא עצם`,
                        `1/2 ליטר נוזל חום מושל בטעם`,
                        `2 כפות שמן`,
                        `1/2 בצל - מילוי `,
                        `4 יחידות פטריות - מילוי `,
                        `צרור פטרוזיליה - מילוי `,
                        `מלח - מילוי `,
                        `פלפל - מילוי `,
                        `2 כפות שמן - מילוי `,
                    ],
                    preparation : [
                        `חותכים את הירקות לדוקסל.`,
                        `מקפיצים את הבצל עם הפטריות עד לקבלת צבע זהוב ומוסיפים את הפטרוזיליה, מלח ופלפל.`,
                        `מאדים קלות ויוצרים חור בחזה עוף.`,
                        `את העוף ממלאים בחומרי המילוי.`,
                        `צורבים את העוף בפלנצ'ה לקבלת פסים.`,
                        `מניחים את העוף בתבנית, מכסים עד גובה חצי בנוזל החום ומכסים את התבנית בנייר כסף.`,
                        `מחממים תנור ל-180 מעלות ומכניסים את העוף ל-10 דקות.`,
                        `מנוזל העוף יוצרים את הרוטב הרצוי.`,
                    ],
                },
                'קציצות-קבב' :  {
                    pic: `kabab`,
                    description: `קציצות קבב על הפלאנצ'ה על מצע חציל שרוף`,
                    quantity: `10 מנות`,
                    time: `30 דקות`,
                    ingredients : [
                        `500 גרם בשר טחון`,
                        `בצל קצוץ ברונאז'`,
                        `צרור פטרוזיליה קצוץ`,
                        `כף פלפל שחור גרוס`,
                        `חצי כף מלח`,
                        `כפית בהרט`,
                        `2 כפות שמן זית`,
                        `טחינה`,
                        `חציל`,
                    ],
                    preparation : [
                        `מערבבים את הבשר טחון עם הבצל, פטרוזיליה, תבלינים ומעבדים היטב.`,
                        `נותנים לו "מנוחה" של שעה במקרר ומעבדים אותו שוב.`,
                        `מכדררים לקציצות – משטיחים אותן.`,
                        `שורפים את החציל, מקלפים ומתבלים אותו.`,
                        `מכינים טחינה גולמית לבנה או ירוקה.`,
                        `צורבים את הקבב על הפלאנצ'ה.`,
                        `מצלחתם על החציל ומזלפים טחינה על המנה.`,
                    ],
                },
                'קדירת-עוף-עם-ירקות-ושומר' :  {
                    pic: `chickenStue`,
                    description: ``,
                    quantity: `4 מנות`,
                    time: `1.25 שעות`,
                    ingredients : [
                        `4 יחידות כרעיים עוף`,
                        `1/2 כוס קמח`,
                        `כפית פפריקה`,
                        `1/4 כוס שמן`,
                        `1/4 בצל `,
                        `1 גזר`,
                        `2 גבעולי סלרי`,
                        `1 שומר`,
                        `שן שום קצוצה`,
                        `מלח`,
                        `פלפל`,
                        `קארי`,
                        `ליטר נוזל עוף`,
                    ],
                    preparation : [
                        `חותכים את העוף לשוקיים וירכיים.`,
                        `מקמחים את העוף ומתבלים בפפריקה, מלח, פלפל וסוגרים אותו בשמן.`,
                        `את הירקות חותכים קרה ומאדים אותם לפי קשיות, מחזירים את העוף לסיר עם הירקות, מורידים משקע עם הנזול של העוף עד לגובה 3/4 מהעוף, מכסים את הסיר ומבשלים כ-50 דקות בחום נמוך, מוסיפים תבלינים ומשלימים טעם.`,
                    ],
                },
                'שניצל-וינאי' :  {
                    pic: `snitzel`,
                    description: ``,
                    quantity: `10 מנות`,
                    time: `35 דקות`,
                    ingredients : [
                        `1 ק"ג בשר הודו/עוף`,
                        `500 גר' פירורי לחם`,
                        `2 יח' ביצים`,
                        `1 ליטר שמן לטיגון`,
                        `100 גר' קמח`,
                        `כף שטוחה מלח`,
                        `מעט פלפל`,
                        `*יש אפשרות לתבל את הביצה עם חרדל/מיונז/רוטב סויה*`,
                    ],
                    preparation : [
                        `מצפים את השניצל בציפוי וינאי (3 שלבים):`,
                        ` 1.קמח + תבלינים`,
                        `2. ביצה + חרדל/מיונז/רוטב סויה`,
                        `3. פירורי מאפה + שומשום `,
                        `אזי מצפים קודם בקמח ולאחר מכן בביצה ולבסוף בפירורי מאפה.`,
                        `מטגנים בשמן עמוק חם.`,
                    ],
                },
                'בשר-ברוטב-צלי' :  {
                    pic: `beefSlices`,
                    description: `פרוסות בשר בקר ברוטב צלי`,
                    quantity: `10 מנות`,
                    time: `4 שעות`,
                    ingredients : [
                        `2 קילו נתח בשר מספר 5`,
                        `כוס יין אדום`,
                        `3 יח' בצל`,
                        `5 עלי דפנה`,
                        `2 יח' גזר`,
                        `מעט פלפל אנגלי`,
                        `2 גבעולי סלרי`,
                        `כף מלח`,
                        `שורש כרישה`,
                        `מעט כורכום`,
                        `ראש שום`,
                        `כפית כמון`,
                        `צרור כוסברה`,
                        `2 ליטר מים`,
                        `30 מ"ל שמן זית`,
                    ],
                    preparation : [
                        `צולים בסיר עמוק ורחב את נתח הבשר מכל צדדיו (סגירה).`,
                        `מוציאים אותו מהסיר ומכניסים לאותו הסיר את כל הירקות חתוכים גס.`,
                        `מטלטלים בשמן את הירקות טיגון קל.`,
                        `מוסיפים כף רסק עגבניות ומערבבים.`,
                        `מוסיפים יין להרמת משקעים וממלאים את הסיר במים עד גובה הבשר.`,
                        `מחזירים את הבשר לסיר.`,
                        `מוסיפים עלי דפנה, פלפל אנגלי ומבשלים כ- 3 שעות עד ריכוך מלא.`,
                        `מוציאים את הבשר, מקררים ופורסים אותו לפרוסות הרצויות.`,
                        `משחימים בצל בסיר שטוח, מסדרים את פרוסות הבקר.`,
                        ` (אפשר להוסיף גם פטריות או ירק מסוים).`,
                        `מוסיפים את הנוזל המסונן שהבקר התבשל בו, מתבלים ומרתיחים להשלמת בישול וספיגת טעמים. `,
                    ],
                },
                'בשר-צלי-אסאדו' :  {
                    pic: `beefstue`,
                    description: `בשר צלי בקר צלוי פרוס קארווינג בסגנון אסאדו בליווי מתבלים`,
                    quantity: `20 מנות`,
                    time: `5-6 שעות`,
                    ingredients : [
                        `נתח בשר מספר 4`,
                        `עלי רוזמרין `,
                        `שיני שום שלמים קלופים`,
                        `פלפל שחור גרוס`,
                        `מלח גס`,
                        `שמן זית כתית`,
                    ],
                    preparation : [
                        `מפשירים את הבשר בקר, עושים בו חריצים לאורך מורחים בשמן זית, מלח גס, פלפל שחור גרוס, רוזמרין ואת שיני השום.`,
                        `לוקחים נייר כסף ונייר אפייה, עוטפים קודם עם נייר אפייה ולאחר מכן עם נייר הכסף.`,
                        `מכניסים לתנור ל-180 מעלות ל-5 שעות בישול.`,
                        `מוציאים, פורסים ומגישים לצד רוטב פלפלת.`,
                    ],
                },
                'סטייק-פרגית-ברוטב-טריאקי' :  {
                    pic: `pargitTariaki`,
                    description: ``,
                    quantity: `10 מנות`,
                    time: `20 דקות`,
                    ingredients : [
                        `1/4 כוס סויה`,
                        `2 כפות דבש`,
                        `1/4 כוס יין מתוק אדום`,
                        `2 כפות סוכר חום`,
                        `1/4 כוס מיץ תפוזים`,
                        `1.3 ק"ג פרגית`,
                    ],
                    preparation : [
                        `מחממים מחבת ללא שמן ומטגנים את הפרגיות.`,
                        `במקביל מערבבים את כל החומרים, מרתיחים, מרכזים ומוסיפים פלפל שטה יבש לא קצוץ.`,
                        `מסדרים את הפרגית במרכז הצלחת.`,
                        `מגישים עם מעט רוטב טריאקי.`,
                        `תוספת למנה דואט תפו"א (פירה).`,
                    ],
                },
                'סטייק-פרגית-בשום-וסילאן' :  {
                    pic: `pargitGarlic`,
                    description: `סטייק פרגית עוף צלויה בשום וסילאן`,
                    quantity: `10 מנות`,
                    time: `20 דקות`,
                    ingredients : [
                        `1.3 ק"ג פרגית עוף`,
                        `6-7 שיני שום `,
                        `עלי פטרוזיליה קצוצה`,
                        `2 כפות סילאן`,
                        `כף שטוחה מלח`,
                        `כפית פלפל גרוס`,
                        `30 מ"ל שמן זית`,
                        `כף שמן קנולה`,
                    ],
                    preparation : [
                        `מפרקים פרגית מירך עוף.`,
                        `מנקים אותה מעצמות, גידים ושאריות שומן.`,
                        `משטחים אותה לסטייק פרגית.`,
                        `מתבלים בשום קצוץ, פטרוזיליה, סילאן, שמן זית ושאר התבלינים.`,
                        `צולים על מחבת פסים או פלאנצ'ה משני הצדדים היטב על מחבת חמה.`,
                    ],
                },
                'עראיס' :  {
                    pic: `arais`,
                    description: `רבעי פיתות במילוי בשר צלוי על מחבת פסים או מנגל`,
                    quantity: `10 מנות`,
                    time: `30 דקות`,
                    ingredients : [
                        `1 ק"ג בשר טחון`,
                        `3 בצל בינוני`,
                        `צרור פטרוזיליה קצוצה`,
                        `כף מלח`,
                        `פלפל גרוס`,
                        `כפית בהרט`,
                        `פיתות (רבעים)`,
                        `שמן זית`,
                    ],
                    preparation : [
                        `קוצצים את הבצל והפטרוזיליה לתוך קערה עם הבשר טחון, מתבלים ומעבדים היטב את הבשר.`,
                        `ממלאים את רבעיי הפיתות בבשר טחון, מורחים שמן זית או מתיזים ספריי שמן וצולים על מחבת פסים או על מנגל.`,
                        `צולים מכל הכיוונים עד שמתקבלת צריבה של פסים, מסדרים על תבנית עם נייר אפייה ומכניסים ל-5-7 דקות השלמה בתנור. `,
                    ],
                },
                'המבורגר' :  {
                    pic: `humburger`,
                    description: ``,
                    quantity: `5 מנות`,
                    time: `30 דקות`,
                    ingredients : [
                        `1 ק"ג בשר טחון עם 25% - 30% שומן.`,
                        `1 בצל גדול קצוץ מטוגן`,
                        `מלח`,
                        `פלפל גרוס`,
                        `שמן זית`,
                    ],
                    preparation : [
                        `קוצצים בצל ומטגנים אותו במחבת עם מעט שמן זית.`,
                        `מוסיפים לבשר, מתבלים ומעבדים במשך 10 דקות.`,
                        `מכינים את ההמבורגרים בצור עגולה (לפי הגודל הרצוי).`,
                        `צולים על הפלאנצ'ה.`,
                        `מגישים בתוך לחמנית המבורגר עם תוספות של מבחר ירקות ורטבים.`,
                    ],
                },
                'פילה-אמנון-בסגנון-מזרחי' :  {
                    pic: `amnonFish`,
                    description: ``,
                    quantity: `10 מנות`,
                    time: `45 דקות`,
                    ingredients : [
                        `10 יח' דג פילה אמנון`,
                        `צרור כוסברה`,
                        `1 יח' לימון`,
                        `ראש שום`,
                        `5 יח' פלפל חריף`,
                        `2 יח' גמבה `,
                        `2 כפות פפריקה`,
                        `120 מ"ל שמן`,
                        `כף שטוחה מלח`,
                        `כפית מרק עוף`,
                    ],
                    preparation : [
                        `משרים את הדג בלימון ומלח כ-10 דקות ושוטפים אותו היטב להסרת ריחות וטעם לוואי.`,
                        `מגרדים חצי עגבנייה ושוזרים גבעולים ועלים של כוסברה בסיר רחב ושטוח (סוטאז').`,
                        `מוסיפים שיני שום ופלפלים חריפים.`,
                        `מאדים את הירקות למשך 5 דקות עם סיר מכוסה.`,
                        `מסדרים את חתיכות הדג על הירקות.`,
                        `מערבבים בקערה שמן עם פפריקה מתוקה, חצ כף מרק עוף, מלח ויוצקים על הדג.`,
                        `מוסיפים חצי כוס מים ומרתיחים כ-30 עד 40 דקות.`,
                        `מעטרים בכוסברה קצוצה לעוד 5 דקות בישול.`,
                    ],
                },
                'דג-פילה-לברק/אמנון' :  {
                    pic: `lavrekFish`,
                    description: `דג פילה לברק/אמנון בקראסט פיסטוקים`,
                    quantity: `10 מנות`,
                    time: `30 דקות`,
                    ingredients : [
                        `10 יח' דג פילה לברק/אמנון`,
                        `צרור פטרוזיליה`,
                        `6 יח' שום קצוץ`,
                        `1 יח' לימון`,
                        `30 מ"ל סילאן/דבש`,
                        `180 מ"ל שמן זית `,
                        `זעפרן /מעט כורכום`,
                        `כף מלח`,
                        `חצי כפית פלפל שחור טחון`,
                        `300 גר' פיסטוקים`,
                    ],
                    preparation : [
                        `קוצצים את הפיסטוקים עם שום קצוץ ופטרוזיליה.`,
                        `מערבבים בקערה שמן זית, לימון סחוט, סילאן, שום כתוש, מלח, פלפל וכורכום.`,
                        `מושכים את הדג, מפזרים על הדג את התערובת, מכניסים לאפייה בתנור שחומם מראש ל-180 מעלות כ-15 דקות.`,
                    ],
                },
                'נתחי-בשר-בקר-מבושל-בסגנון-"ראש-מרוקאי"' :  {
                    pic: `marocanMeat`,
                    description: ``,
                    quantity: `8 מנות`,
                    time: `2.5 שעות`,
                    ingredients : [
                        `1 קילו נתחי בשר בקר`,
                        `2 כוסות גרגירי חומוס לאחר השרייה`,
                        `ראש שיני שום`,
                        `5 יחידות פלפל צילי אדום חריף`,
                        `100 מיל' שמן`,
                        `3 כפות פפריקה אדומה`,
                        `חצי כף כמון`,
                        `כף שטוחה מלח`,
                        `מעט פלפל שחור גרוס`,
                        `צרור כוסברה`,
                    ],
                    preparation : [
                        `מרתיחים את נתחי הבשר, מורידים קצב ומבשלים במשך שעתיים (אפשר לבשל את הבשר בשלמותו כגוש שלם ולאחר מכן לחתוך אותו לקוביות) `,
                        `מבשלים את גרגרי החומוס ומקררים אותם.`,
                        ` מטלטלים בסיר מעט את השום והפלפלים, `,
                        `פותחים פפריקה על השמן והשום ומוסיפים את הנוזל החום של הבשר.`,
                        ` מוסיפים את גרגירי החומוס והכוסברה. מתבלים בכמון, מלח, פלפל ומגישים.`,
                    ],
                },
                'שווארמה-עוף/פרגית/הודו' :  {
                    pic: `shawarma`,
                    description: ``,
                    quantity: `8 מנות`,
                    time: `40 דקות`,
                    ingredients : [
                        `1 קילו חזה עוף/פרגית/הודו`,
                        `30 גרם תיבול שווארמה`,
                        `4-5 כפות שמן זית`,
                        `כף שטוחה מלח`,
                        `חצי כפית פלפל גרוס`,
                        `תבנית אינגליש קייק`,
                    ],
                    preparation : [
                        `פורסים את הבשר לפרוסות דקות, ומתבלים אותם בתיבול שווארמה, מלח, פלפל, ומעט שמן זית.`,
                        `משטיחים אותם בתבנית אינגליש קייק שתי וערב (אחד על השני) ממלאים 3 תבניות.`,
                        `אופים על 180 מעלות במשך 40 דקות.`,
                        `מוציאים את הנתח שמתקבל מהתבנית ופורסים פרוסות דקות לנתיחי שווארמה.`,
                    ],
                },
                // 'דוגמא' :  {
                //     pic: `tahinaSalad`,
                //     description: ``,
                //     quantity: `10 מנות`,
                //     time: `2.5-3 שעות`,
                //     ingredients : [
                //         ``,
                //     ],
                //     preparation : [
                //         ``,
                //     ],
                // },
            }, 
            baking : { // תת נושא
                'בצק-עלים' :  {
                    pic: `phillo`,
                    description: ``,
                    ingredients : [
                        `500 גר' קמח`,
                        `300 גר' מרגרינה`,
                        `10 גר' מלח`,
                        `1 כף חומץ`,
                        `חצי ביצה `,
                        `200-250 סמ"ק מים פושרים`,
                    ],
                    preparation : [
                        `מערבבים 30 גר' קמח עם המרגרינה ויוצרים קובייה ומערבבים למקרר.`,
                        `מערבבים 30 גר' מרגרינה עם הקמח ושאר החומרים.`,
                        `מעבדים לבצק חלק (בצורת כדור) עושים חתכים בבצק (בצורת+) ונותנים לבצק לנוח כאשר הוא מכוסה.`,
                        `פותחים את הבצק לריבוע כאשר באמצע הוא עבה.`,
                        `מניחים את המרגרינה במרכז הבצק ומקפלים בצורת מעטפה.`,
                        `מרדדים את הבצק לפי קיפולים  3-4.`,
                        `יש לתת לבצק לנוח בין הקיפולים ובסיום למנוחה במקרר.`,
                    ],
                },
                'בצק-פריך' :  {
                    pic: `parich`,
                    description: ``,
                    ingredients : [
                        `600 גר' מרגרינה`,
                        `300 גר' אבקת סוכר`,
                        `50 גר' חלמון`,
                        `100 גר' ביצים `,
                        `900 גר' קמח `,
                        `מעט וניל `,
                        `גרידת תפוז `,
                        `גרידת לימון `,
                        `קורט מלח `,
                    ],
                    preparation : [
                        `לערבב את המרגרינה ואבקת הסוכר.`,
                        `להוסיף בהדרגה חלמון וביצים.`,
                        `להוסיף את שאר המרכיבים ולערבב עד לקבלת בצק אחיד.`,
                    ],
                },
                'בראוניז-שוקולד' :  {
                    pic: `brownize`,
                    description: ``,
                    ingredients : [
                        `420 גר' ביצים`,
                        `500 גר' סוכר `,
                        `400 גר' חמאה `,
                        `20 גר' נס קפה`,
                        `400 גר' שוקולד `,
                        `250 גר' קמח`,
                        `5 גר' אבקת אפייה`,
                    ],
                    preparation : [
                        `מקציפים את הביצים והסוכר.`,
                        `מרתיחים את החמאה והנס קפה.`,
                        `מקפלים לשוקולד את תערובת החמאה ואת שאר המרכיבים.`,
                        `את השוקולד והחמאה מקפלים לביצים המוקצפות.`,
                        `אפיה 180 מעלות 20 דק'.`,
                    ],
                },
                "ספינג'" :  {
                    pic: `spinge`,
                    description: ``,
                    ingredients : [
                        `1 ק"ג קמח `,
                        `1 ביצה `,
                        `2 כפות סוכר `,
                        `1/2 כוס שמן`,
                        `2 כפות שמרים`,
                        `מעט מלח `,
                    ],
                    preparation : [
                        `שמים בקערת מיקסר את כל החומרים למעט מלח.`,
                        `מערבבים ומוסיפים מים קרים לפי הצורך עד שיהיה בצק רך וקצת דביק.`,
                        `להתפיח, להוריד ולעשות עיגולים על נייר אפייה ולהתפיח שוב.`,
                        `לעשות חור עם האצבעות, לפתוח ולהניח בשמן.`,
                        `לטגן בשמן על אש בינונית.`,
                        `להוציא ולטבול בסוכר או בסיפור דבש.`,
                    ],
                },
                'קראמבל' :  {
                    pic: `crambele`,
                    description: ``,
                    ingredients : [
                        `200 גר' סוכר `,
                        `200 גר' מרגרינה`,
                        `400 גר' קמח `,
                        `100 גר' אבקת שקדים `,
                    ],
                    preparation : [
                        `מערבלים הכל ביחד על מהירות איטית עד שמתקבלת תערובת פירורים.`,
                        `שומרים במקרר ומשתמשים במידת הצורך.`,
                    ],
                },
                'פאי-לימון' :  {
                    pic: `lrmonPie`,
                    description: ``,
                    ingredients : [
                        `ליטר מיץ לימון`,
                        `קילו סוכר`,
                        `ליטר מים גרידה מ-4 לימונים `,
                        `300 גרם חמאה`,
                        `20 ביצים שלמות `,
                        `500 גר' חלמונים `,
                        `בצק פריך`,
                    ],
                    preparation : [
                        `בסיר בישול שמים מיץ לימון, סוכר, מים, גרידת לימונים וחמאה.`,
                        `בקערה טורפים את הביצים והחלמונים.`,
                        `שהקערה של הבישול רותחת עושים השוואת טמפ' עם החלמונים ושופכים את הביצים במהירות אל הנוזל שבסיר, מנמיכים את הלהבה וטורפים כ-5 דק' עד שהמסה מסמיכה.`,
                        `יוצקים על גבי התחתיות פאי שאפינו באפיה עיוורת ומכניסים.`,
                    ],
                },
                'מרנג' :  {
                    pic: `marenge`,
                    description: `מתאים לקרמבו/ פאי לימון/ נשיקות/ פבלובה וכו'`,
                    ingredients : [
                        `חצי ליטר חלבון `,
                        `1 ק"ג סוכר`,
                    ],
                    preparation : [
                        `מחממים בשיטת בן מרי עד שהסוכר נמס בתערובת חמה.`,
                        `מעבירים למיקסר במהירות גבוהה עד שמתקבל מרנג יציב.`,
                    ],
                },
                'עוגת-תפוזים' :  {
                    pic: `orangeCake`,
                    description: ``,
                    ingredients : [
                        `2 ביצים`,
                        `שליש כוס (66 ג') סוכר`,
                        `שליש כוס (80 מ"ל) שמן`,
                        `חצי כוס (120 מ"ל) מיץ תפוזים סחוט טרי `,
                        `כוס קמח לבן (140 גרם)`,
                        `כפית אבקת אפייה (6 גר')`,
                        `לזיגוג: 2 כפות אבקת סוכר וכף מיץ תפוזים.`,
                    ],
                    preparation : [
                        `מחממים תנור מראש ל- 180 מעלות ומשמנים תבנית אינגליש קייק.`,
                        `מערבבים בעזרת מיקסר את הביצים עם הסוכר במשך כחצי דקה.`,
                        `מוסיפים שמן, מיץ וגרידת תפוז ומערבבים.`,
                        `בקערית נפרדת מערבבים קלות עד לאיחוד חומרים (שימו לב- ערבוב יתר פוגע באווריריות העוגה)`,
                        `מעבירים את התערובת לתבנית משומנת ומכניסים לתנור החם במשך 25-30 דק', עד שהקיסם יוצא יבש.`,
                        `כשהעוגה מוכנה, מזלפים מעליה בעזרת כפית את הזיגוג ועוטפים בניילון נצמד.`,
                    ],
                },
                'עוגת-שיש' :  {
                    pic: `marbelCake`,
                    description: ``,
                    ingredients : [
                        `כוס מיץ תפוזים/ מים/ חלב סויה `,
                        `5 ביצים טרופות היטב `,
                        `לתערובת השוקולד- תוספת של 3 כפות קקאו `,
                        `2 שקיות סוכר וניל `,
                        `6 כוסות סוכר`,
                        `קילו קמח תופח מנופה`,
                        `2 כוס שמן`,
                    ],
                    preparation : [
                        `מחממים את התנור לחום של 180 מעלות.`,
                        `מוסיפים לקערה את הקמח המנופה, הסוכר, הסוכר וניל ומערבבים.`,
                        `יוצרים גומה במרכז הקערה, ושופכים לתוכה את הביצים הטרופות, השמן והחלב.`,
                        `מערבבים מעט עם כף, ולאחר מכן מערבלים במיקסר לתערובת אחידה.`,
                        `יוצקים קצת יותר מחצי התערבות לתבנית אינגליש קייק משומנת.`,
                        `לשאר התערובת הנותרת שלא יצקנו לתבנית, מוסיפים את הקקאו ומערבבים היטב לתערובת אחידה וללא גושי קקאו.`,
                        `את תערובת השוקולד שנוצרה יוצקים בעדינות מעל התערובת הבהירה ומערבבים מעט מאוד עם קיסם.`,
                        `מכניסים לתנור שחומם ואופים בין 45-60 דק'.`,
                    ],
                },
                'עוגת-שוקולד' :  {
                    pic: `choclateCake`,
                    description: ``,
                    ingredients : [
                        `2 כוסות שמן`,
                        `קילו קמח`,
                        `6 ביצים`,
                        `אבקת אפייה`,
                        `מעט סודה לשתייה בצד`,
                        `600 גרם שוקולד מריר`,
                        `2 כוסות קקאו `,
                        `כוס סוכר`,
                        `6 כוסות מים `,
                        `1 מרגרינה`,
                    ],
                    preparation : [
                        `לחמם על הגז, לקרר ולהוסיף 2 חלמונים.`,
                        `מהתערובת הזו להפריש כוס בצד.`,
                        `להקציף חלבונים עם סוכר, להוסיף את שאר החלמונים לשוקולד.`,
                        `להוסיף לקציף שמן, אבקת אפייה, סודה וקמח.`,
                        `כשהעוגה מוכנה לשפוך את השוקולד חם על העוגה (הכוס שהשארנו בצד).`,
                    ],
                },
                'עוגת-שמרים' :  {
                    pic: `yeastCake`,
                    description: ``,
                    ingredients : [
                        `1 קג קמח`,
                        `50 גרם שנרים`,
                        `150 גרם סוכר`,
                        `4 ביצים`,
                        `כף תמצית וניל`,
                        `1 גרידת לימון`,
                        `200 גרם שמן/ מרגרינה מומסת`,
                        `10 גרם מלח.`,
                        `300 גרם מים קרים.`,
                    ],
                    preparation : [
                        `בקערת מיקסר עם וו לישה שמים`,
                        `קמח, שמרים ,סוכר ומערבלים`,
                        `מוסיפים מחצית מכמות המים, הביצים ,וניל , גרידת חלימון והשמן ומערבלים.`,
                        `מוסיפים מים עד לקבלת בצק לח אך לא דביק.`,
                        `לבסוף מוסיפים את המלח.`,
                        `מערבלים כ-10 דק במהירות בנונית עד לקבלת בצק חלק ואחיד.`,
                        `מכסים בניילון נצמד ונותנים מנוחה כשעתיים.`,
                        `כאשר הבצק נח ותפח מחלקים ל-6 כדורי בצק, בעזרת מערוך מרדדים לעלה ומורחים במלית האהובה.`,
                        `יוצרים צורה מהבצק המרודד(מגלגלים לרולדה) .`,
                        `מניחים בתבנית אפיה משומנת( אינגלישקייק) ומתפיחים לשעה לפני האפיה.`,
                        `מברישים בביצה טרופה.`,
                        `מחממים תנור לחום 180 מעלות ואופים כ-25-30 דק.`,
                        `לאחר האפיה מברישים במי סוכר.`,
                    ],
                },
                'פילו-במילוי-תפוחים' :  {
                    pic: `applePastry`,
                    description: ``,
                    ingredients : [
                        `1 חבילת דפי פילו `,
                        `200 גר' חמאה`,
                        `12 יחידות תפוחים מזן סמית' (ירוקים) קלופים וחתוכים לקוביות `,
                        `כוס סוכר`,
                        `כף קינמון`,
                        `100 גר' צימוקים בהירים`,
                        `חצי חבילת ביסקוויט בהיר טחון`,
                    ],
                    preparation : [
                        `מחממים סיר בישול עם מים.`,
                        `כשהמים רותחים מכניסים את קוביות התפוחים ומבשלים כ-5 דק'.`,
                        `מוציאים, שוטפים במים קרים ומסננים היטב.`,
                        `מפוררים את הביסקוויטים.`,
                        `מוסיפים את הסוכר, קינמון וצימוקים.`,
                        `מוסיפים את התפוחים ומערבבים היטב.`,
                        `ממיסים את החמאה.`,
                        `פותחים את הפילו, לוקחים עלה ומורחים בחמאה מניחים עלה נוסף.`,
                        `חוצים את הפילו ל-6 חלקים שווים.`,
                        `מניחים קומץ מהמלית במרכז הריבוע.`,
                        `סוגרים את הריבוע למרכז ויוצרים שקיקים.`,
                        `מסדרים על מגש אפייה עם נייר.`,
                        `מקפיאים לחצי שעה.`,
                        `מחממים תנור ל-180 מעלות ואופים כ-15 דק'.`,
                        `מפזרים אבקת סוכר ומגישים.`,
                    ],
                },
                'סופלה' :  {
                    pic: `sufle`,
                    description: ``,
                    ingredients : [
                        `1 ק"ג שוקולד`,
                        `1 ק"ג מרגרינה`,
                        `600 ג' סוכר`,
                        `20 ביצים `,
                        `600 ג' קמח `,
                        `10 ג' אבקת אפייה`,
                    ],
                    preparation : [
                        `להקציף את הביצים ולהוסיף את הסוכר בהדרגה להמיס את המרגרינה ולהוסיף את השוקולד (בין מרי) מוסיפים את השוקולד והמרגרינה לביצים ולערבב בצורת קיפול. `,
                        `להוסיף בהדרגה את הקמח ואבקת אפייה וגם לערבב בצורת קיפול ליצוק לקוקוטים ולהכניס לתנור 180 מעלות כ-6 דק'.`,
                    ],
                },
                'באונטי-קוקוס' :  {
                    pic: `coconutBounty`,
                    description: ``,
                    ingredients : [
                        `250 גרם קרם קוקוס`,
                        `200 גרם סוכר`,
                        `200 גרם מרגרינה`,
                        `500 גרם קוקוס טחון `,
                        `ציפוי - שוקולד מריר 200 גרם, קרם קוקוס 100 גרם.`,
                    ],
                    preparation : [
                        `מרתיחים חלב קוקוס סוכר, תמצית וניל ומרגרינה.`,
                        `מוסיפים קוקוס טחון ומערבבים באמצעות כף עץ עד לספיגת כל הנוזל, משטחים על תבנית אפייה מרופדת בנייר אפייה, מהדקים היטב את התערובת ומעבירים למקפיא להתייצבות. `,
                        `מחממים קרם קוקוס ומוסיפים שוקולד מריר עד להמסה, מורחים מעל בסיס הקוקוס שהוקפא מפזרים קוקוס לבן או חום, מקררים ומגישים.`,
                    ],
                },
                "פנקייק" :  {
                    pic: `pancake`,
                    description: `פרווה`,
                    ingredients : [
                        ` כוס קמח לבן (140 ג')`,
                        `1 כפית אבקת אפייה (5 ג')`,
                        `1 שקית סוכר וניל (10 ג') אפשר להוסיף במקום תמצית וניל`,
                        `2 כפות סוכר (25 ג')`,
                        `1 ביצה`,
                        `2 כפות שמן `,
                        `1 כוס מים או תפוזים `,
                        `קמצוץ מלח`,
                        `סירופ מייפל/ שוקולד`,
                    ],
                    preparation : [
                        `מערבבים היטב את כל החומרים בקערה עם מטרפה עד לקבלת בלילה חלקה.`,
                        `משמנים מחבת במרגרינה או בשמן.`,
                        `כשהמחבת חמה יוצקים את הבלילה בעזרת מצקת.`,
                        `לאחר כדקה כאשר מופיעות בועות קטנות בחלק העליון של הפנקייק, הופכים צד ומשאירים למש חצי דקה נוספת.`,
                        `מומלץ להגיש עם סירופ לצד הפנקייק.`,
                    ],
                },
                "בלינצ'ס" :  {
                    pic: `blinches`,
                    description: ``,
                    ingredients : [
                        `קילו קמח לבן`,
                        `כף (12.5) סוכר `,
                        `כפית מלח `,
                        `8 כוסות חלב סויה `,
                        `5 ביצים `,
                        `כפית תמצית וניל `,
                        `3/4 כוס שמן`,
                    ],
                    preparation : [
                        `מערבבים את כל החומרים בקערה בעזרת מטרפה,                              לפי הסדר בו רשומים, עד לתערובת חלקה ללא גושים.`,
                        `משמנים מחבת בקוטר של 24-26 ס"מ ומחממים על אש בינונית, כשהמחבת חמה יוצקים כמות של 3/4 מצקת ומטים את המחבת לצדדים בצורה מעגלית כדי שהבלילה תכסה את תחתית המחבת בצורה אחידה (זו צריכה להיות שכבה דקה).`,
                        `מבשלים על אש בינונית.`,
                        `מבשלים על אש בינונית במשך שתי דק'. `,
                        `הופכים בעזרת תרווד צד ומבשלים עוד כדקה.`,
                        `מעבירים לצלחת, משמנים שוב את המחבת וממשיכים הלאה עם יתר הבלילה.`,
                    ],
                },
                "מילוי-לבלינצ'ס-גבינה-פרווה" :  {
                    pic: `cheeseFilling`,
                    description: ``,
                    ingredients : [
                        `מלית גבינה פרווה טבעונית של תנובה 500 גרם `,
                        `קופסא של אינסטנט פודינג 80 גרם`,
                        `100 גרם צימוקים `,
                    ],
                    preparation : [
                        `טורפים הכל ביחד`,
                        `מעבירים לשקית זילוף, מזלפים בבלינצ'ס ומגלגלים.`,
                    ],
                },
                "מילוי-לבלינצ'ס-תפוחים" :  {
                    pic: `appleFilling`,
                    description: ``,
                    ingredients : [
                        `6 תפוחי עץ גרני סמית חתוכים לקוביות`,
                        `כפית קינמון `,
                        `כוס סוכר`,
                        `פתי בר לבן טחון לפירורים `,
                        `חצי כוס צימוקים (לא חובה)`,
                    ],
                    preparation : [
                        `את הקוביות של התפוחי עץ שולקים במים חמים.`,
                        `מסננים ומקררים במשך שעה שירדו כל המים.`,
                        `מוסיפים שאר תוספות.`,
                        `מורחים בבלינצ'ס מחמאה מומסת.`,
                        `אופים בתנור 10 דק' בחום של 160.`,
                    ],
                },
                "מילוי-לבלינצ'ס-בקלוואה" :  {
                    pic: `blinches`,
                    description: ``,
                    ingredients : [
                        `כוס בקלוואה קצוצים `,
                        `כוס פיסטוקים קצוצים `,
                        `כוס שקדים קצוצים `,
                        `שתי כפות שומשום לבן `,
                        `כף סוכר`,
                        `כף קינמון`,
                        `100 גרם חמאה מומסת `,
                    ],
                    preparation : [
                        `מערבבים את כל החומרים יחד, מסדרים על הבלינצ'ס ומגלגלים.`,
                        `מברישים בחמאה מומסת ואופים בתנור על 160 מעלות במשך 10 דק'.`,
                    ],
                },
                "בצק-לפיצה" :  {
                    pic: `pizza`,
                    description: ``,
                    ingredients : [
                        `1 ק"ג קמח לבן `,
                        `50 גרם שמרים יבשים `,
                        `650 מ"ל מים פושרים `,
                        `2 כפות סוכר לבן `,
                        `כף מלח `,
                        `1/3 כוס שמן זית `,
                    ],
                    preparation : [
                        `לשים את כל החומרים במיקסר עם וו לישה המהירות בינונית למשך 10 דק' ומניחים בצד לתפיחה עד להכפלת הנפח.`,
                        `מחלקים את הבצק ל-4 כדורים שווים.`,
                        `חשוב לא להתעסק יותר מידי עם הכדורים, כדי לא להוציא את האוויר מהבצק.`,
                        `משמנים את הכדורים במעט שמן זית למניעת התייבשות,`,
                        `מניחים על השטח מקומח היטב לתפיחה של 20 דק' ומרדדים את הבצק לצורה הרצויה.`,
                        `אופים בתנור שחומם מראש לחום של 240 מעלות במשך 8 דק'.`,
                    ],
                },
                "פוקאצ'ה" :  {
                    pic: `fukatcha`,
                    description: ``,
                    ingredients : [
                        `קילו גרם קמח`,
                        `שתי כפות שמרים יבשים `,
                        `כפית סוכר`,
                        `כפית מלח `,
                        `60 מ"ל שמן זית (רבע כוס)`,
                        `180 מ"ל מים חמים`,
                    ],
                    preparation : [
                        `לשים במיקסר את הקמח והשמרים, לערבב ולהוסיף את הסוכר, מלח, שמן ומים. `,
                        `לעבד עד שהבצק רך וחלק. `,
                        `לשים בקערה משומנת, לכסות ולהתפיח כ- 45 דק'.`,
                        `לחלק את הבצק ל-3 חלקים, ליצור כדורים ולהתפיח עוד כ-20  דק'.`,
                        `למתוח כל כדור עם האצבעות לאורך 30 ס"מ ולהניח בתבנית על נייר האפייה, להמתין 10 דק' ולעשות בורות עם האצבע.`,
                        `לחמם תנור ל225 מעלות `,
                        `להזליף שמן זית על הפוקאצ'ות ולפזר מלח גס, לאפות כ-20 דק' עד שמזהיב.`,
                    ],
                },
                "בצק-שמרים" :  {
                    pic: `dough`,
                    description: ``,
                    ingredients : [
                        `1 ק"ג קמח`,
                        `50 גרם מרגרינה`,
                        `2 י"ח ביצים`,
                        `מים פושרים`,
                        `מלח`,
                        `קליפת לימון מגורדת`,
                        `תמצית וניל לפי הטעם`,
                    ],
                    preparation : [
                        `מכינים בלילה שתשמש ראש- עיסה:`,
                        `מערבבים את כל כמות השמרים עם רבע מכמות הנוזלים, מעט קמח וכפית אחת סוכר.`,
                        `בוחשים עד שהתמיסה תהיה חלקה.`,
                        `מנפים את שאר הקמח ושמים אותו בסיר המערבל או על השולחן.`,
                        `יוצרים גומה במרכז הקמח ומניחים לראש העיסה לתסוס ולתפוח.`,
                        `מוסיפים לגומה לשאר הנוזלים, המרגרינה (כשהיא מותכת), הביצים, תמצית  הווניל וקליפת הלימון.`,
                        `מערבבים הכל יחד ולשים היטב לבצק חלק.`,
                        `שמים את הבצק כשהוא מכוסה- במקום חמים ומניחים לו לתפוח עד שיכפיל את מידותיו.`,
                        `לשים שנית, ומניחים להתפחה נוספת, לשים את הבצק בשלישית ומעבדים אותו לפי הצורך.`,
                        `לאחר העיבוד הבצק לעוגות, יש למרוח אותן בביצה טרופה.`,
                        `שמים את העוגות על התבניות ומניחים להתפחה אחרונה לפני האפייה.`,
                        `אופים בתנור בחום מעל בינוני במשך 30 דק', זמן האפייה תלוי בגודל העוגות.`,
                    ],
                },
                "חלות/-לחמניות" :  {
                    pic: `buns`,
                    description: ``,
                    ingredients : [
                        `קילו קמח רגיל `,
                        `2 כפות גדושות של שמרים יבשים `,
                        `8 כפות גדושות סוכר `,
                        `חצי כוס שמן `,
                        `50 גרם מרגרינה`,
                        `500 מ"ל מים פושרים`,
                        `כפית מלח `,
                    ],
                    preparation : [
                        `מערבבים את השמרים עם הקמח והסוכר ומוסיפים את השמן, את המרגרינה המומסת, כוס מים פושרים ומערבבים עד שהתערובת מתחילה להתגבש.`,
                        `לשים עד שנהיה בצק, אם הבצק קצת דביק אפשר להוסיף מעט קמח. אם הוא יבש אז להוסיף קצת מים.`,
                        `מפזרים מעל הבצק כפית מלח באופן אחיד וממשיכים ללוש במשך 4-5 דק' נוספות עד לקבלת בצק אחיד.`,
                        `מכסים את הקערה במגבת ומניחים בצד להתפחה של שעה עד שעה וחצי עד להכפלת הנפח.`,
                        `מקמחים קלות משטח עבודה ומחלקים את הבצק ל-4 חלקים שווים ומגלגלים כל חלק לרצועה ארוכה וקולעים לצמות.`,
                    ],
                },
                'עוגת-דבש' :  {
                    pic: `honeyCake`,
                    description: ``,
                    quantity: `20 מנות`,
                    time: `40 דקות`,
                    ingredients : [
                        `1 כוס מים`,
                        `1 כוס סוכר חום\דמררה`,
                        `4 ביצים`,
                        `2 כוסות קמח`,
                        `1 כפית סודה`,
                        `1 כפית אבקת אפייה`,
                        `1 כפית קינמון`,
                        `חצי כפית ציפורן טחון`,
                        `1 כפית קפה שחור`,
                    ],
                    preparation : [
                        `טורפים את כל הרטובים (הנוזלים) יחד. `,
                        `מוסיפים את כל היבשים ומערבבים היטב.`,
                        ` למזוג ל 2 תבניות אינגליש קייק. `,
                        `מכניסים לתנור ל 160 מעלות כ 25 דקות.`,
                    ],
                },
                // 'דוגמא' :  {
                //     pic: `tahinaSalad`,
                //     description: ``,
                //     quantity: `10 מנות`,
                //     time: `2.5-3 שעות`,
                //     ingredients : [
                //         ``,
                //     ],
                //     preparation : [
                //         ``,
                //     ],
                // },
            }, 
        }
    },
    // עמוד גלריה
    galleryPage : {
        topNavBar : {
            backgroundColor : `#0D635F`,
            img_button_menu : `3lines_white.svg`, // אודות / איקס / תפריט
            img_SearchIcon : `search_white.svg`, 
            div_topNavLine : ``,
            img_topNavTextIcon : `white_gallery.svg`,
            div_topNavText_gallery : `תמונות`,
            img_bhdLogo : `בהד 6.png`,
            img_tillLogo : `till_logo_white.svg`,
        },
        bottomNavBar : { // סמלים של הקטגוריות של המתכונים
            recipe : ["מתכונים", "green_cookbook", 0],
            events : ["אירועים", "green_events", 0],
        },  
        functions : [`showTopics()`], // פונקציות שצריכות לפעול
        content : {
            recipe: {},
            events: {}
        }
    },
    // עמוד וידיאו
    videosPage : {
        topNavBar : {
            backgroundColor : `#0D635F`,
            img_button_menu : `3lines_white.svg`, // אודות / איקס / תפריט
            img_SearchIcon : `search_white.svg`, 
            div_topNavLine : ``,
            img_topNavTextIcon : `white_videos.svg`,
            div_topNavText_videos : `סרטוני הדרכה`,
            img_bhdLogo : `בהד 6.png`,
            img_tillLogo : `till_logo_white.svg`,
        },
        bottomNavBar : { // סמלים של הקטגוריות של המתכונים
            recipe : ["מתכונים", "green_cookbook", 0],
            safty : ["בטיחות", "green_protection", 0],
            health : ['ברה"צ', "green_health", -100],
        },  
        functions : [`showTopics()`], // פונקציות שצריכות לפעול
        content: {
            recipe : {
                "שקשוקה": "https://www.youtube.com/embed/Yra-RfiiYLw",
                "חומוס": "https://www.youtube.com/embed/btS4XWfj6Ic",
                "בורקס": "https://www.youtube.com/embed/rH6MQdZtIbw",
                "טוניסאי": "https://www.youtube.com/embed/6AV9ZQKV2ew",
                "סביח": "https://www.youtube.com/embed/SbFLDK9A3-o",
                "שווארמה": "https://www.youtube.com/embed/fqppIe72NKk",
                "פרגיות": "https://www.youtube.com/embed/1QukGWt0iHE",
                "המבורגר": "https://www.youtube.com/embed/WwgozwzvcU8",
            },
            safty : {},
            health : {},
        },
    },
    // עמוד חומרי לימוד
    learningPage : {
        topNavBar : {
            backgroundColor : `#0D635F`,
            img_button_menu : `3lines_white.svg`, // אודות / איקס / תפריט
            img_SearchIcon : `search_white.svg`, 
            div_topNavLine : ``,
            img_topNavTextIcon : `white_materials.svg`,
            div_topNavText_learning : `סוגים 1-5`,
            img_bhdLogo : `בהד 6.png`,
            img_tillLogo : `till_logo_white.svg`,
        },
        bottomNavBar : { // סמלים של הקטגוריות של המתכונים
            subject1 : ["מטבח", "kitchen-green", 0],
            subject2 : ["חומרים", "materials-green", 0],
            subject3 : ["בשר", "meats-green", 0],
            subject4 : ["דגים", "fish-green", 0],
            // vegan : ["מנות טבעוניות", "green_vegan", -245],
            // mainCourse : ["מנות עיקריות", "green_maincourse", -450],
            // baking : ["קונדיטוריה", "green_baking", -450],
        },  
        functions : [`showTopics()`], // פונקציות שצריכות לפעול
        content: {
            subject1 : {
                "מבוא-למקצוע": {
                    "מבוא-למטבח":{
                        type : "listNumbers",
                        content: [
                            `מטבח קלאסי-מטבח זה מתחיל מאירופה מאנשי האצולה-צרפת, גרמניה ,ספרד ,פורטוגול ,אנגליה וכמובן אוסטריה. לכל איש אצולה היה שף פרטי, השף הפרטי רשם את כל המתכונים שלו ושל אלה שהיו לפניו, כלל השושלת.  לעולם לא היה לחץ של זמן בתקופה זאת, השפים ניסו בדקו עד שמצאו את המתכון הנכון לכל תבשיל.`,
                            `המהפכה הצרפתית-האנשים הפשוטים הרימו את הראש, והשפים של אנשי האצולה פתחו מסעדות, בתי מלון ובתי הארחה וגרמו לאוכל לצאת החוצה אל השווקים ואל כל העם.                        `,
                            `שף מארי אנטואן קארם-ריכז את הידע המקצועי שנאסף עד אותה עת בטבחות. הוא היה השף הפרטי של המלך.                        `,
                            `אוגוסט גורג' אסקופיה-תלמידו של מארי, עבד במטבחים הכי נחשבים באירופה.  הוא ערך חילק והביא רעיונות חדשים וכתב ספר- La Guide Collinear. זהו מדריך קולינרי שתורגם לשפות שונות והמטבח הזה הפך מצרפתי לבינלאומי.
                            חי בין השנים 1846-1935 מייסד המטבח הקלאסי המודרני, השף החשוב ביותר של המאה ה-20.
                            הספרות המקצועית שלו נחשבת לתנ"ך של כל הטבחים , והשפיע על המטבח המערבי.
                            היה הראשון שהכניס לתחום הזה מושגים של צוות עובדים מוגדר, חלוקת תפקידים, ארגון התפריט והנוהל של 3 מנות מינימום.
                            וגם את 5 או 6 מנות מקסימום כנורמה של כל בית מאכל או מסעדה.
                            `,
                            `אחידות במונחים המקצועיים שהפכו לבינלאומיים היו הבסיס  למטבח הקלאסי La Cuisine Classiqne.                        `,
                            `.המטבח החדש ה-Novelle Cuising  הומצא על ידי שף פרנדד פוון.
                            תלמידיו פול בוקוז וגלן טרגרו הפיצו את המטבח החדש המשמש עד היום בעיקר מסעדות וארוחות לפי הזמנה.
                            תפריט לפי הזמנה -A La Carte.
                            שמן זית במקום חמאה, ירקות ופירות, בישול מהיר וקל יותר במקום ארוחות כבדות.
                            `,
                            `כדאי לדעת <ul>
                            <li>גסטרונום הוא אדם המתמצא בתחום המזון ויודע להעריך ולזהות את איכותו.</li>
                            <li>הגסטרונומיה עוסקת – במזון, באיכותו, בדרכי הכנתו וטעמו.</li>
                            <li>בזכות מה ניתן לומר על שף שהוא גסטרונום? בתבשיליו קיים תמי איזון עדין בין הריח והמראה.</li>
                            <li>כאשר אומרים על מישהו שהוא גורמה הכוונה היא שאדם זה יודע להכיר באיכות גבוהה, הוא אנין טעם ונהנה מאוכל טוב.</li>
                            <li>הבסיס למטבח הקלאסי-ידע ושימוש בטכניקות הבישול של המטבח הצרפתי.</li></ul>
                            `,
                        ],
                    },
                    "סוגי-מטבחים":{
                        type : "listNumbers",
                        content: [
                            `מטבחי בתי החולים:
                            הדרישות המאוד ספציפיות של הכנת המזון במטבחים אלה, הן הקו המנחה בתכנונם והפעלתם של המטבחים. מטבחים אלה מספקים מזון לחולים, בהתאם למינון דיאטטי נדרש ולסגל העובדים הנוהג לסעוד במקום אופן קבוע, כך שיש לדאוג להם למזון מגוון לאורך זמן.
                            `,
                            `מטבחים צבאיים:
                            מטבח צבאי מתוכנן לפרטיו של ידי הרשויות הצבאיות.
                            בישול בכמויות גדולות:
                            ההגדרה של בישול בכמויות גדולות באה בעיקר על מנת לתאר תהליך של ייצור מזון שיש בו נטיה לסטנדרטיזציה של הכמויות-מתכונים קבועים. למעשה אותו שלב בבישול שאנו נוטים להגדירו כאומנות הבישול ואשר מאפיין את יכולתו של השף וצוותו הולך וקטן ככל שהכמויות גדלות, עד לשלב, שבו הבישול הופך לתהליך תעשייתי ובו כל המרכיבים שקולים ומדודים בדייקנות ותהליכי ההכנה מבוצעים בהתאם לתכנון זמנים מדויק. בשיטת עבודה כזו חייבים לשמור על רמת חומרי הגלם אחידה וקבוע. כל סטייה באיכות החומרים או באחידותם תביא לשינוי בטעם, בצורה ובאיכות המאכל בכלל.
                            `,
                            `המטבח הקלאסי:
                            מטבח העוסק בבישול והגשת מאכלים בתוכנם, וצורת הגשתם נקבעו במרצות הדורות על ידי אניני טעם ושפים גדולים.
                            `,
                            `המטבח הפשוט:
                            הגדרתו של תבשיל כפשוט, אינו מצביע בשום מקרה על איכותו, פשוטו של תבשיל פירושו העדר קישוטים קלאסיים יקרים, תהליך הכנה שאינו כרוך בשלבי בישול מסובכים וצורת הגשה פשוטה וקלה.
                            כשבאים לסווג מטבח כפשוט, כוונתו היא שהבישול בו מותאם לרמת מחירים מסויימת, בהתאם לאוכלוסייה המשתמשת בסוג מזון זה.
                            `,
                        ],
                    },
                    "סוגי-אנרגיה": {
                        type : "listNumbers",
                        content: [
                            `גז-מוצר לוואי של נפט או ישירות מהאדמה. תערובת נכונה של אוויר.
                            <br>יתרונות: חימום מהיר, ויסות מיידי, אין בזבוז, שימוש בכלים ללא הגבלה.
                            <br>חסרונות: חום לא אחיד, פייח, מסוכן, גז כבד מהאוויר.
                            <br>במסעדה השימוש בגז הוא מאוד משמעותי בגלל המהירות.
                            <br>להבה מפייחת אם יש מעט מדי אוויר שנכנס.
                            <br>להבה שבורחת זה אם יש הרבה אוויר שנכנס.
                            `,
                            `חשמל-מלבד בישול ישנו שימוש גם בקירור, הפעלת מכונות, תאורה,.
                            <br>יתרונות: קיים פיזור חום אחיד , אין צורך בנקודת גז.
                            <br>חסרונות: תגובה איטית , אינו נראה לעין, יש להיזהר במגע עם מים.
                            `,
                            `פחם- שימוש בגריל, תנור פחמים .<br>
                            יתרונות: טעם, ריח ונייד.  <br>חסרונות:  לכלוך, עשן, חם ומסורבל לשימוש.                        `,
                            `קיטור- רתיחה של מים בדודים מיוחדים לאספקת הקיטור למטבח על ידי צנרת עמידה בלחץ וחום.<br> יתרונות: מהיר ולא נשרף. <br> חסרונות: מערכת מסורבלת, מוגבל בשימוש .                         `,
                        ],
                    },
                    "סוגי-צוותים":{
                        type : "listDots",
                        content: [
                            `צוות מצומצם - טבח יחיד ועוזרים לא מקצועיים.<br>
                            הטבח עם ניסיון של שנה עד שנתיים במקצוע. 80 עד 100 סועדים. מלון ארוחת בוקר בלבד.
                            <br>ארוחה נוספת פשוטה.
                            <br>רוב המוצרים מגיעים מוכנים כמו עופות מפורקים וכדומה.
                            `,
                            `צוות קטן - טבח ראשי ועוזרים מקצועיים. לא יותר משלושה בתוספת עוזרים לא מקצועיים.<br> (ניקיון) הכפופים לטבח הראשי.
                            <br>יכולים להכין אוכל ל100 עד 200 אנשים , מכינים ארוחת בוקר וערב.
                            <br>שוטף כלים (סטיוארט) עוזר לטבח הראשי.
                            `,
                            `צוות בינוני - טבח ראשי ושישה בעלי מקצוע לפי מחלקות (טבח לרטבים, טבח לצלי, טבח לירקות, מטבח קר, ממלא מקום וקונדיטור.)
                            <br>בתוספת עוזרים הכפופים לטבח הראשי למחלקות ולעוזרים הכללים.
                            `,
                        ],
                    },
                },
                "הכנסות-והוצאות": {
                    "אחוז-ההוצאות-מכלל-ההכנסות-במזון-משקאות":{
                        type : "listDots",
                        content: [
                            `35 אחוז עלות מזון.`,
                            `23 אחוז רווח.`,
                            `35 אחוז עלות כוח אדם.`,
                            `7 אחוז הוצאות קבועות.`,
                        ],
                    },
                    "מבחנים":{
                        type : "text",
                        content: [
                            `מבחן הקצב BUTCHER TEST-זה פחת של הבשר מקבלת הסחורה דרך עיבודו עד להעברתו למטבח לבישול.`,
                            `מבחן הטבח- זה הפחת מרגע קבלת המוצר לבישול ועד הגשתו לאורח.`,
                            `מבחן התשואה- הרווח שיש לנו בעקבות ההשקעה, הרווח שמתקבל לנו לאחר מבחן הקצב ומבחן הטבח.`,
                            `מלאי מת- מוצרים שלא היו בשימוש ב3 חודשים האחרונים, כלומר לא ייצרו לנו רווחים, קנינו ולא מכרנו.`,
                        ],
                    },
                    "שף-מטבח": {
                        type : "listDots",
                        content: [
                            `ביקורת על איכות המוצרים.`,
                            `ביקורת שנעשה F.I.F.O במטבח.`,
                            `מעקב אחרי איכות הסחורה.`,
                            `חשיבה על ניהול מזון.`,
                            `הכנת מתכונים סטנדרטים על מנת לקבוע בדייקנות את עלות המוצר.`,
                            `ספירת מלאי עם המבקר.`,
                            `שותף בקביעת מחירי מנות.`,
                        ],
                    },
                    "רוחב-טמפרטורות-בעולם-המטבח-המקצועי":{
                        type : "listDots",
                        content: [
                            `40- הקפאה עמוקה.`,
                            `30- הקפאת גלידות.`,
                            `18- הקפאה.`,
                            `0-1/2 אחסנת דגים עם קרח גרוס מעל.`,
                            `0-2 יישון בשר.`,
                            `0-4 סלטים, מוצרי חלב וכו׳..`,
                            `5-9 פירות, ירקות.`,
                            `6-10 הפשרת בשר.`,
                            `6-8 מקרר ביצים.`,
                            `16-18 מחסן קשות.`,
                            `25-28 טמפרטורה במטבח.`,
                        ],
                    },
                    "תורת-החומרים-חומרי-הגלם-במטבח":{
                        type : "listDots",
                        content: [
                            `כל חומרי הגלם שמשמשים כחומרי מזון לבני האדם מצויינים בטבע בכל מיני דרכים. `,
                            `חלקם ניתנים לאכילה, חלקם ניתנים לשיפור הטעם ויש כאלה שצריך לשנות את מרקמם בכדי לאכול אותם.   `,
                            `סוגי השינוי במרקמים-כבישה, המלחה, תיבול ובישול.  טבח צריך להכיר את חומרי הגלם שאיתם עובדים על מנת לא להרוס את ערכם התזונתי. המטרה היא לשפר את מראהו, טעמו וצורתו בשיטות בישול מגוונת.`,
                        ],
                    },
                    "מקורות-החומרים-בטבע-(חי,-צומח-ומינרלים)":{
                        type : "listDots",
                        content: [
                            `מזונות מן החי: המזון מן החי נחשב אצל רוב בני האדם בסיס לתזונה טובה ולכן אוכלים אותו מידי יום בצורות שונות. המבחר המגוון המפורט בהמשך מאפשר לכל אדם למצוא את מבוקשו בין מזונות אלה, שניתן לסווגם לחמש קבוצות:<br>
                            <ol>
                            <li>דבש-  כשאנו קונים דבש ישנם כל מיני טעמים בשל סוגי הפרחים, התעשייה הדבש הוא טבעי לא מוסיפים לו טעמים. ישנם 2 דברים מיוחדים בדבש- זהו המוצר היחידי בטבע שהוא כשר שבא מחיה שהיא לא כשרה. דבש זהו המוצר היחידי בעולם שאין לו תפוגה של התוקף, אם הדבש מאוחסן בצורה אופטימלית הוא יכול להחזיק שנים. </li>
                            <li>בשר ומוצריו.</li>
                            <li>עופות/בעלי כנף</li>
                            <li>חלב 3% שומן. </li>
                            <li>בשן(גבינה מעושנת).- גבינה שנראת בגליל בצבע מעט חום. עם טעם מעושן.</li>
                            </ol>
                            `,
                            `קבוצות המזון מן הצומח הם כל הצומח באדמה ומעליה, בצורת פקעות(התחתית של הירק שצומח באדמה, בצלים,תפרחות  ועלים למיניהם ופירות לסוגיהם.                            `,
                            `מינרלים -
                            המינרלים נמצאים בכל חומרי המזון. הם משמשים לבניית גוף האדם לתפקודו התקין. ומהווים גורם מסייע בקליטת אבות מזון אחרים בגוף. המינרלים השונים מגיעים אלינו בתרכובות שונות.
                            `,
                            `מלח: <br>
                            <ul>
                            <li>שימור מזון בעזרת מלח גורמת ל: הפסקת התרבות חיידקי קלקול הקיבה.#</li>
                            <li>האפקט המשמר של מלח הבישול נובע מהפחתת כמות המים החופשיים במזון.#</li>
                            <li>במלח הבישול מצויה כמות רבה של נתרן.#</li>
                            <li>מלח סלפטר(אשלגן חנקתי, ידוע גם בשם "סלפטר" (מלטינית, "מלח אבן", אך ייתכן שהכוונה היא למלח של פטרה), הוא מלח המורכב מאשלגן, חנקן וחמצן.  הוא מלח לכבישות בשר.#</li>
                            <li>המלח לא מבטל לגמרי את החיידקים אך הוא מקטין את כמות החיידקים באחוז גבוה. </li>
                            <li>מלח בסטייק צריכים לשים לקראת הסוף כי המלח סופח את כל הנוזלים והסטייק מתייבש. יש כמה סוגים יש מלח דק, מלח הימלאיה, מלח אטלנטי שמגיעים ממחצבים וטיפה שונים בטעם , הם אינם מגיעים מהים כמו המלח הרגיל.</li>
                            <li>למלח יתרונות נוספים, שמים מלח כשמבשלים ביצה, המלח מעלה את טמפרטורת המים ל102 או 103 מעלות. אין קשר בין מלח לבין קילוף ביצה. ביצה עלומה עושים במים חמים בגובה 100 מעלות.</li>
                            </ul`,
                        ],
                    },
                    "המים-כחומר-יסוד-במטבח":{
                        type : "listDots",
                        content: [
                            `המים הם כה שימושיים במטבח עד כי נוטים לקבל את עובדת היותם כדבר מובן מאליו. אפשר להמשיך ולתפקד על אף הפסקת חשמל בעיות טכניות שונות או מחסור בחומר מסוים. אך אי אפשר לעבוד במטבח בלי מים. `,
                            `במים אין קלוריות. `,
                            `גרם שומן 9 קלוריות.`,
                            ` אלכוהול ערק 100 סמ"ק יש 280 קלוריות. `,
                            `אלכוהול 7 קלוריות. `,
                            `פחמימות וחלבונים 4 קלוריות לגרם.`,
                            `במטבח משמשים המים כחומר יסודי למטרות שונות:<br>
                            <ul>
                            <li>רחיצת ידיים.</li>
                            <li>שטיפת חומרי מזון.</li>
                            <li>ריכוך, בישול חומרי מזון, הכנת רטבים ומרקים.</li>
                            <li>רחיצת כלים.</li>
                            <li>הכנת משקאות.</li>
                            </ul>
                            `,
                        ],
                    },
                },
                "שיווק-מצרכי-מזון": {
                    "סוגי-מזון-שונים":{
                        type : "listDots",
                        content: [
                            `מזון טרי: ירקות ופירות למיניהם, משווקים במהירות האפשרית ובאריזות מתאימות: ירקות רכים בארגזים וקרטונים. וירקות קשים כגון תפוחי אדמה, בצל וגזר בשקים.`,
                            `חומרים טריים אחרים: דגים, בשר ועופות משווקים בקירור, בטמפרטורה קרובה ל0 מעלות צלזיוס, בתנאים שהוגדרו על ידי משרד הבריאות. כל ארגז בשר עובר דרך וטרינר של אותה עיר. כל מקום מכובד לא יכול לקבל בשר ללא אישור וטרינר חתום! אלא אם כן הזמנתי מקצב מקומי.`,
                            `בעלי כנף למיניהם:אותם משווקים כשהם ארוזים בארגזי פלסטיק מאווררים בשקיות ניילון.`,
                            `דגים: דגים נוטים להתקלקל במהירות ולכן משווקים אותם קרוב מאוד לשעת הדיג בדרך כלל הם ארוזים בכמויות קטנות כשהם מצוננים בפתיתי קרח.`,
                            `מוצרי חלב: כל מוצרי החלב משווקים בקירור, באריזות פלסטיק או קרטון, אחרי פסטור או עיקור.`,
                            `ביצים: אריזה מקובלת לשיווק ביצים היא המגש המיוחד, בעל 30 התאים, שבו מניחים את הביצים כדי שלא ישברו. את המגשים משווקים בארגזים של 12 מגשים, סה"כ 360 ביצים.`,
                        ],
                    },
                    "מזון-מעובד-למחצה":{
                        type : "listDots",
                        content: [
                            `מזון קפוא: שיווקם של מזונות המוגדרים קפואים, כגון: ירקות, עופות, סוגי בשר, דגים, ביצים בתפזורת, בצקים דברי מאפה מוכנים, ארוחות מוכנות ועוד.  הולך ומתרחב ותופס מקום של קבע במטבח המודרני בזכות יתרונותיו הרבים.   
                            יתרונות:<ol>
                            <li>אי תלות בהספקה עונתית של מזון טרי.</li>
                            <li>אי תלות בתוצרת מקומית.</li>
                            <li>גיוון תפריטים.</li>
                            <li>חיסכון בעיבודים ראשוניים, כמו קילוף וחיתוך.</li>
                            <li>גמישות ביכולת לספק ארוחות גם באירועים בלתי צפויים.</li>
                            <li>הוא זמין ונוח לשימוש.</li>
                            </ol>`,
                            `שימורים הם מצרכי מזון, עמידים בתנאי אחסון רגילים ללא קירור. בתהליך השימור נהרסים החיידקים גורמי הקלקול על ידי הבאת החומר לטמפרטורה של מעל 65 מעלות. ואריזתו באריזות אטומות כמו צנצנות, קופסאות פח, או אריזות פלסטיק שונות. לשימורים למיניהם מוסיפים בדרך כלל, חומרי טעים שונים למשל:
                            <ol>
                            <li>שימורי ירקות במלח.</li>
                            <li>שימורי ירקות מוחמצים – חומץ או מלח.</li>
                            <li>שימורי פירות בתרכיז סוכר.</li>
                            <li>שימורי בשר.</li>
                            <li>שימורי דגים.</li>
                            <li>שימורי ריבות וקונפיטורה (קונפיטורה זוהי ריבה עם חתיכות פרי!!)##</li>
                            <li>במלפפונים כבושים 7-9 או 9-11 זה כמות המלפפונים בקופסא## לא משפיע לא איכות או גודל. משפיע אך ורק על כמות!</li>
                            </ol>`,
                            `כל מה שבטמפרטורה גבוהה ויורד במהירות למהירות נמוכה החיידקים לא יתרבו. אך אם המזון חם מאוד ומכניסים למקרר שיירד הטמפרטורה לאט זוהי טעות גדולה שהחיידקים מתרבים יותר. כדאי להכניס ישר למקפיא ואז למקרר. זה יכול לקלקל את כל המזונות שנמצאים במקרר. כדאי להכניס ל40 או 50 מעלות ואז למקרר.                        `,
                            `בנוסף קיימת קבוצה גדולה של מצרכי מזון חצי מעובדים כגון: רטבים פיקנטיים, תרכיזים שונים וממרחים, שבחלקם מצוי חומר משמר, ובאחרים השימור נעשה בעזרת ריכוז גבוה של סוכר, מלח או חומץ. שיווקם ואחסונם הוא ללא קירור.
                            קבוצה נוספת של מזונות משומרים הם:
                            <ol>
                            <li>דגים כבושים. (היחסים בכבישה של דג קר הוא 60 אחוז סוכר 40 אחוז מלח כי המלח דומיננטי ביותר!)                            </li>
                            <li>דגים מעושנים.</li>
                            <li>נקניקים ובשרים מעושנים.</li>
                            <li>סלטים המכילים חומרים משמרים ששיווקם בקירור.</li>
                            </ol>
                            `,
                        ],
                    },
                    "חומרי-מזון-מעובדים-אבקות": {
                        type : "listDots",
                        content: [
                            `האבקות נוחות לשימוש, ומגבלתן העיקרית היא "אורך חייהן" הקצר למדי באחסון.  האבקות משווקות באריזות אטומות ללחות ולאור. בצורות שונות-בשקיות ובקופסאות.                        `,
                            `האבקות הנפוצות הן:<ul>
                                <li>אבקות מרק.   במטבח מקצועי זוהי מילה גסה. יכולים לעזור במקום צירים ומסייעים בחיזוק הטעם.          </li>
                                <li>אבקות רטבים. עמבה לדוגמה זהו חומר גלם שניתן להיעזר בו.</li>
                                <li>אבקת חלב.-חלב מיובש.</li>
                                <li>אבקת ביצים.-ביצים טריות שייבשו אותן וטחנו אותן, היתרון זהו שלביצה יש חיי מדף, בתאריך אחד לשיווק ואחד לשיווק במקרר. קונים את האבקה מדללים לבערך פי 7 עד 8. מערבבים עם מים או חלב. אבקת הביצים נשמרת ליותר זמן. לאחר פתיחה במים או בחלב חייב לצרוך את זה בישירות.</li>
                                <li>קפה. פולי קפה הנטחנים לאבקה.</li>
                                <li>קקאו.</li>
                                <li>תה.</li>
                                <li>פירות.</li>
                                <li>ירקות מיובשים.</li>
                                <li>אבקות מנות קינוח.-סחלב , ג'לי, מלבי . בלילת טמפורה-בבלילה יש סודה. בירה זה לבצק אורלי !!</li>
                                <li>מונוסודיום גלוטמט-מחזק טעם לכבישת בשר. </li>
                            </ul>`,
                            ``,
                        ],
                    },
                    "רכישות-מוצרים":{
                        type : "listDots",
                        content: [
                            `חומרי גלם מהווים חלק נכבד מהוצאות המטבח, לכן בכל מקום שבו קיים מטבח גדול, יש אדם האחראי על רכישת המצרכים.  במקום אחד עושה זאת הקניין, במקום אחר המחסנאי, האחראי על מחלקת מזון ומשקאות או הטבח הראשי האחראי על רכישת המוצרים חייב להכיר את עקרונות הקנייה הטובה:
                            <ul>
                            <li>קנייה בזמן נכון.</li>
                            <li>קניית הכמות הנכונה.</li>
                            <li>קנייה במחיר טוב.</li>
                            </ul>                        `,
                            `יש להימנע משני מצבים קיצוניים: קניות של הרגע האחרון ואגירת מלאי גדול של מצרכים.                        `,
                            `מלאי=כסף`,
                            `בתבלינים יש קומבינות שעל מנת להגדיל את הכמות דוחפים פנימה דוחן זוהי שעורה חיטה. `,
                            `אם התבלין מכיל גלוטן זה אומר שיש דוחן.`,
                            `בריקס- אחוז ברכז במוצר! לדוגמה כמו ברסק עגבניות. ככל שאחוז הבריקס גבוה יותר כך המוצר עשיר יותר בעגבנייה לדוגמה אם זה רסק.`,
                        ],
                    },
                },
                "אחסון-מזון": {
                    "כללי":{
                        type : "text",
                        content: [
                            `חשוב לדעת איך לאחסן מזון בצורה נכונה. כל חומר מזון המגיע למטבח, עד לשימוש בו. זאת על מנת למנוע קלקול , אובדן, ערכו, צורתו וטיבו. צריך להקפיד על תנאי התברואה המונעים או מאיטים תהליכים לא רצויים, כהתפתחות חיידקים, התפוררות, קלקול או תסיסה.
                            `,
                        ],
                    },
                    "אחסנה-בקירור":{
                        type : "text",
                        content: [
                            `המקרר אינו מיועד לשמור את המוצרים לזמן לא מוגבל, אלא להאריך את משך ההשתמרות הטבעית.
                            `,
                            `אין בכוחו למנוע קלקול מצרכי מזון, אלא להאט את התהליך הלא רצוי של השתנות החומרים. רצוי שיהיו מספר מקררים לפרודוקטים שונים. כמו מקרר לבשר, מקרר למוצרי חלב, מקרר לירקות ופירות, מקרר לביצים, מקרר להפשרה. למניעת ריחות לא רצויים יש לאחסן את המזון בתוך כלים סגורים.
                            `,
                        ],
                    },
                    "אחסנה-בהקפאה":{
                        type : "text",
                        content: [
                            `תהליך ההקפאה בדומה לתהליך הקירור במקרר, המקפיא מאפשר להוציא את החום שבמזון מהר יותר, לשמור אותו בטמפרטורה נוכה מאוד. `,
                            `בשיטה של הקפאה מהירה ועמוקה -18 עד -40 בבלסט צ'ילר. טיפות הנוזל שבתוך המזון הופכות למוצק בצורה של גרגירים מעוגלים שאינם מזיקים למעטפת התא.  לעומת זאת בהקפאה נמוכה ואיטית עד כ-10 מעלות, נוזל התאים מתגבש לגבישים מחודדים, הדומים לקוצים. הקצוות המחודדים "פוצעים" את מעטפת התא. `,
                            `בעת הפשרת מזון מהקפאה נמוכה, מאבד החומר מצורתו ומטיבו המקוריים. בהפשרה מהקפאה עמוקה נשמרת יותר שלמות ואיכות החומר, עקרונית אפשר לשמור בשר קפוא, דגים וירקות קפואים בטמפרטורה של -18 מעלות לתקופות ארוכות.
                            `,
                        ],
                    },
                    "אחסנה-ללא-קירור":{
                        type : "text",
                        content: [
                            `מצרכי מזון יבשים יש לאחסן במכלי פלסטיק מתאימים, לא בצפיפות, בגובה של 30 סנטימטר מעל הרצפה. זאת כדי לאפשר אוורור טוב וגישה נוחה לניקוי. רצוי להימנע מאחסנה בשקים, לתקופה ממושכת. במקרה של אחסנה בשקים צריך להניחם על גבי סורגים בכדי למנוע עובש.
                            `,
                        ],
                    },
                    "תנאי-אחסנה-של-מצרכים-שונים": {
                        type : "textAndPics",
                        pic : [`../assets/images/learning/storing.png`,],
                        content: [
                     
                        ],
                    },
                    "מצרכי-מזון-מהצומח":{
                        type : "text",
                        content: [
                            `הכרת תכונותיהם של חומרי היסוד שאנו משתמשים בהם מדי יום במטבח, היא היסוד לניצולם בצורה הטובה ביותר.`,
                            `בעידן התיעוש, חומרים רבים משנים צורה ותכונות, השימוש בהם הופך לפשוט וקל, ואין צורך בידע רב כדי להפיק מהם את המירב. רצוי להתעדכן בשינויים החלים בצורת האריזה ובתנאי האחסנה בעקבות צורות העיבוד המשתנות והמתקדמות.
                            `,
                        ],
                    },
                    "סמני-ההכר-לאיכות-וטריות-של-הפירות-והירקות":{
                        type : "listDots",
                        content: [
                            `גודל אופייני.`,
                            `ריח אופייני.`,
                            `צבע.`,
                            `מרקם.`,
                            `עונות השנה.`,
                            `צורת אחסנה.`,
                            `ללא פגמים.`,
                        ],
                    },
                    "סוגי-ירקות":{
                        type : "listDots",
                        content: [
                            `ירקות בעלי שורשים מעובים או פקעות.-גזר, סלרי, קולורבי, צנון, צנונית,בטטה כתומה/אדומה, גזר כתום/סגול/צהוב, גזר גמדי(זן מיוחד קטן),שורש סלרי, לפת, סלק אדום, צנון לבן, שורש כוסברה, תפוחי אדמה לסוגיהם, שורש פטרוזיליה. כל מה שצומח מתחת לאדמה ואוכלים אותו.`,
                            `ירקות בעלי עלים ירוקים.-חסה ערבית/רומית, חסה עגולה (אייסברג) ,פטרוזיליה עלים, בזיליקום, חסה מסולסלת, חסה ראש זן: בן שמן, מנגולד-עלי סלק, כוסברה עלים, פטרוזיליה מסולסלת, תרד, ובאק צ'וי משתמשים כתוספת ירק מבושל גבעול ועלים באק צ'וי זה ירק שהגיע מהמזרח מזכיר חסה, אוכלים אותו לאחר בישול קצר בין חצי דקה לדקה.`,
                            `ירקות בעלי פרי.-גמבה אדומה/ צהובה, מלפפונים, פלפל ירוק זן:נהריה, קישואים, שועיעת ירוקה/צהובה, פלפל קאיין פלפל אדום קטן וחריף מאוד, במיה, חצילים לסוגיהם, עגבנייה, פלפל ירוק זן:קליפורניה, פלפל חריף, תירס`,
                            `הכרוב לסוגיו.-ברוקולי, כרוב לבן למילוי, כרוב מסולסל, כרוב ניצנים, קולורבי, קייל, כרוב לבן, כרוב אדום, כרוב סיני, כרובית.`,
                            `ירקות בעלי גבעול.-אספרגוס לבן, אספרגוס ירוק (שומרים עם בד לח במקרר), עירית, בצל ירוק, כרישה, סלרי עלים (כרפס אמריקני), שומר. האספרגוס נקטף באורך 15 ס"מ מעל פני האדמה`,
                            `אספרגוס אמור להיות עבה כמה שיותר, משתמשים בכתר ועוד חלק קטן, האמצע לסלט ואת החלק התחתון זורקים.`,
                            `הבצל לסוגיו.-בצל זן: בן שמן. בצל זמן: גרנו 5. בצל זן:העמק (מצרי). בצלצלי פנינה, בצלי שאלוט, בצל סגול.   `,
                            `בצל יבש מאחסנים במקום קריר ומוצל ומאוורר על רשתות.`,
                        ],
                    },
                },
                "כלים": {
                    "כלים-במטבח-ושימושיהם":{
                        type : "listDots",
                        content: [
                            `כף פריזיאן-שימושה ליצור צורת עיגול של כדורים מירקות ופירות, ישנה מנה ששמה תפו"א פריזיאן. שימוש נוסף של הכף לרוקן, לנקות, לחפור.`,
                            `זסטר-לגרידת תפוז, לימון, לקבלת פסים של הפרי, לקישוטים.`,
                            `שתול-מסייע לריענון להב הסכין.`,
                            `מספריים-משמש לניקוי דגים , עופות, כנפיים.`,
                            `תפוחן-משמש להוצאת ליבת התפוח.`,
                            `מועך-משמש למעיכת ירקות ולמעיכת תפו"א.`,
                            `מזלג-מסייע בחיתוך בשר.`,
                            `משטח-משטח בשרים קרפציו, כל השניצלים למיניהם.`,
                            `מנדולינה-מכשיר לחיתוך ירקות לפריסה אחידה ודקה.`,
                            `כותש שום-מועך את שיני השום לשום כתוש.`,
                            `כסרול-סיר לצלייה והמשך בישול.`,
                            `מרמיט- סיר לבישולים בנוזלים, מרקים, צירים, רטבים וכו'.`,
                            `קלחת-צמצום רטבים, חימום של מנות לפי הזמנה, העברת מזון.`,
                            `פויקה-סיר לתבשילי קדירה, בישול ארוך, באש גבוהה.`,
                            `Roti-צלייה בתנור, יבשה ללא נוזלים. מתאים לצלייה של רוסטביף, סינטה.`,
                            `Braise-אפשר גם לטגן וגם להוסיף נוזלים, כתף מספר 5 לדוגמה.`,
                            `מסננת סינית- בעיקר לסינון של נוזלים, מרקים, רטבים צירים.`,
                            `מסננת רשת- לסינון מוצרים מוצקים יותר, כמו תפו"א וירקות.`,
                            `סלמנדר- תנור המשמש להקרמות.`,
                            `קונבקטומר- אפייה או צלייה באוויר חם.`,
                            `ארון חימום צריך להיות בין 65-75 מעלות מעבר לזה האוכל מתייבש.`,
                            `תבנית גסטרונום מידה בינלאומית שתואמת לכלל המכשירים. מתחלק לגדלים של מגשים, 5, 10, 15, 20.`,
                        ],
                    },
                },
            },
            subject2 : {
                "תורת-החומרים-קטניות": {
                    "קטניות-וסוגיהן":{
                        type : "text",
                        content: [
                            `הקטניות הן זרעים שנמצאים בתרמילים של צמחים בעלי פרחים. אלו צמחים שהמאפיין העיקרי שלהם הוא התרמיל, legume שהוא הפרי שלהם.                                        `,
                            ` סוגים נפוצים: אפונה, עדשים בצבעים שונים (כתום, ירוק ושחור), שעועית מסוגים שונים, חומוס, פול, תורמוס, סויה ועוד. גם הקפה והקקאו הם קטניות.`,
                        ],
                    },
                    "מזון-בריאות":{
                        type : "text",
                        content: [
                            ` לקטניות יש יתרונות תזונתיים חשובים שהופכים אותן למזון בריאות חשוב:
                            <ul>
                            <li>הקטנייה היא פחמימה מורכבת ועשירה מאוד בחלבון. שילוב שתורם לספיגה איטית בגוף ולתחושת שובע מתמשכת</li>
                            <li>סיבים תזונתיים מסיסים שתורמים להורדת הכולסטרול, מניעת מחלות לב, סכרת והשמנה.</li>
                            <li>ויטמינים, מינרלים ועוד חומרים טבעיים, ביניהם כאלו שתורמים להגנה מפני תהליכים סרטניים.</li>
                            <li>כיצד מבשלים שעועית יבשה להכנת מחית?-אחרי השרייה של לילה בקירור, מתחילים לבשל במי ברז</li>
                            </ul>                        `,
                        ],
                    },
                    "סוגי-הקטניות":{
                        type : "listDots",
                        content: [
                            `עדשים אדומות ירוקות ושחורות. חומוס (הדס וספרדי), פול (שלם,גדול וגרוס) , פולי סויה (טבעיים וקלויים), אדזוקי, ואפונה (שלמה וחצאים), שעועית מסוגים שונים , בובס/ לבנה ענקית, שחורה, ברבוניה, לוביה ומאש.`,
                            `אפונה- טובה לאנמיה, עשירה בברזל ובטא קרוטן.`,
                            `חומוס- מגביר מרץ, טיפול נגד טפילי מעיים, חיטוי דרכי השתן.`,
                            `עדשים- העשירות בחלבון טובות לשחרור שרירים, עוזרים למחזור הדם.`,
                            `שעועית אדומה: משתנת.`,
                            `שעועית מאנג- מאש: בעיקר להנבטה, משתנת,שתיית מי השעועית בזמן הרעלת מזון יעילה למצבי שלשול.`,
                            `שעועית אזוקי-"מלך השעועית" , טיפול בבעית כליה ושלפוחית שתן, הגדלת ייצור חלב אם.`,
                        ],
                    },
                    "פטריות-מאכל":{
                        type : "text",
                        content: [
                            `הפטרייה היא צמח בדרגה ביולוגית נמוכה ביותר. מרכיביה הם: 85-90 % מים, 6% חלבון, 5% פחמימות, 1% מינרלים, 0.5% שומן. הן מכילות פרו ויטמין וגם מספר ויטמינים מקבוצת B. עקב הקושיב עיכול אין ניצל מלא של החלבונים.                        `,
                            `הפטריות מתקלקלות מהר ורצוי להשתמש בהן תוך יום מהאיסוף. אפשר להשתמש בהן גם כשהן מיובשות, כאבקה, כתמציות ומשומרות, במים או בחומץ.`,
                            `לא כל סוגי הפטריות אכילות חלקן אף רעילות ביותר, מומלץ להכיר את הפטריות בעת ליקוטן.`,
                        ],
                    },
                    "סוגי-הפטריות":{
                        type : "listDots",
                        content: [
                            `פטריית שמפיניון-הכי נפוצה בישראל, לרוב בקופסאות שימורים, אפשר לקנות גם טרי. יש לה חיי מדף קצרים ורצוי להשתמש באופן מיידי. מתאים לצלייה ובישול ארוך.`,
                            `פטריית פורטבלה-עולות חדשות יחסית שייכות למשפחת השמפיניון אך בשרניות יותר. ניתן לשמש כתחליף לבשר שאינו מכיל שומן נתרן או כולסטרול. מתאים לטיגון צלייה ובישול, אוכלים חם או קר.`,
                            `פטריית יער-טעם עדין ומרקם קטיפתי, משמש כתחליף בשר, וניתן לצלות על הגריל. מתאים לתבשילי עוף דגים מרקים ורטבים, עדיפות לאכול אותה חמה.`,
                            `פטריית שיטאקי-גדלה במזרח הרחוק, יש בתוכה ריכוז גבוה של המינרל גרנמיום זהו נוגד חמצון ומחזק את מערכת החיסון. מתאים לבישול דגנים ומרקים, מקלה על העיכול של בשר. ארומטית ביותר, מתאימה כתוספת או כבסיס לציר פטריות משובח.`,
                            `פטריית פורצ'יני-התגלתה לראשונה באיטליה. חלקן רעילות. הטובות והיקרות ביותר גדלות ביערות בהם גדלים עצי ערמונים וטעמן מזכיר בשר וערמונים. טיפ לבישול: משולבות בתבשילי קדרה, אורז, פסטות מאפים ומרקים. רצוי לבשל בנוזל בעיקר את המיובשות לפחות 20 דקות לריכוך ולשחרור הטעמים.`,
                            `פטריית ירדן-מוכרת כפטריית יער ואוזנית הצדף, היא פטריית בר שגדלה בארץ על גבי גזעי עצים. מרקם בשרני ויכול לשמש כתחליף לצמחונים. ניתן לשלב אותה בתבשילי בשר, מאפים, פסטה, אומלטים אורז ומרקים.`,
                            `פטריית האנוקי-בעלות צבע צהבהב בהיר ראש קטן ורגליים ארוכות. בארץ גדלות בתוך בקבוקים. בטבע היא גדלה בהרים באזורי קו השלג על העצים ורגליה קצות.  מתאימות לסלטים חמים וקרים, פסטות ואומלטים. בעלות טעם עדין וזמן בישול קצר. מזכירה נבטים ואפשר להשתמש בה כתיבול בסוף הכנת המנה.`,
                            `פטריית מלך היער-בעלות טעם נפלא ומראה ייחודי, מוגשות במסעדות יוקרה, וחביבות על השפים כי אוכלים את כולה. מראה אלגנטי ורגל ארוכה ורחבה, מרקם בשרני ואיננה דומה לאחרות.`,
                            `פטריית המורל-פטרייה זאת היקרה ביותר, גדלה ביערות אך נוטה גם לצמוח במקומות שהיו בהן שריפות מסיבה בלתי מוסברת. למורל יש תקופה גדילה מאוד קצרה בדומה לפטריות כמהין. היא לא צומחת באותו מקום יותר מפעם אחת ומחירה יקר 5000 שקל לקילו.`,
                            `פטריית כמהין-היוקרתית גדלה מתחת לפני הקרקע וצומחת כלפי מעלה, לכיוון האור. מתחלקות לשחורות או לבנות. הלבנות יקרות יותרץ טעם חזק ועשיר ניתן גם להשיג שמן וממרחים.`,
                        ],
                    },
                },
                "תורת-החומרים-דגנים-ומוצרי-טחינה": {
                    "הדגנים":{
                        type : "text",
                        content: [
                            `דגנים הם צמחים שמגדלים בשדות חקלאיים. לאחר הקצירה טוחנים ומייצרים מהם קמח ולחם לאחר מכן.`,
                            `קבוצת הדגנים כוללת: אורז, חיטה, שעורה, שיפון, שיבולת שועל, דוחן ותירס.`,
                            ``,
                        ],
                    },
                    "האורז":{
                        type : "listDots",
                        content: [
                            `אורז גדל במים, באקלים מסויים.`,
                            ` בדרך כלל העבודה היא ידנית. `,
                            `האורז הוא אחד הפופולריים אצל בני האדם. `,
                            `בארצות מסוימות הוא המזון העיקר, גדל במזג אוויר חם וזקוק להרבה מים. `,
                            `גדל בעיקר בהודו סין ויפן. מוצאו ממזרח אסיה. גדל באקלים טרופי ומונוסוני.`,
                            ` כ90 אחוז מהאורז מגיע מאסיה. `,
                            `ב100 גרם אורז יש 100 קלוריות.`,
                            `ניתן לשמור עד שנה, אין רגישות או אלרגיה לאורז.`,
                        ],
                    },
                    "אורז-במהלך-העיבוד":{
                        type : "listDots",
                        content: [
                            `אורז פדי- אורז ראשוני בלתי אכיל וקשה.`,
                            `אורז גולמי-אורז מקולף, אך לא קילוף סופי. צבע אפור ומלוכלך.`,
                            `אורז מלא-אורז מקולף ללא ליטוש. מוסרת רק הקליפה החיצונית.-`,
                            `אורז מלוטש-הוא האורז הגולמי העובר עיבוד נוסף, הליטוש גורם לנשירת הקליפה הדקה, השומנית ואחר כך הוא מלוטש סופית בעזרת סירופ עמילני ואבקת טלקום.`,
                            `אורז שבור- אורז שנשבר במהלך העיבוד, לא שלם ומשתמשים בו בעיקר בתעשייה.`,
                        ],
                    },
                    "סוגי-האורז":{
                        type : "listDots",
                        content: [
                            `אורז יסמין תאילנדי אינו דביק יחסית.`,
                            `אורז יפני ואורז דבק סיני, מכינים הסינים עם זה כופתאות אורז והיפנים לסושי.`,
                            `ישנם סוגים של אורז הודי בסמטי ארוך גרעין, פטנה בעל אורך גרעין בינוני ומסורי קצר הגרעין.`,
                        ],
                    },
                    "יתרונות-האורז":{
                        type : "listNumbers",
                        content: [
                            `אחסון טוב וקל לאורך זמן.`,
                            `זול יחסית.`,
                            `מגוון.`,
                            `משביע.`,
                            `סופג טעמים.`,
                            `זמין כל השנה.`,
                            `מהיר הכנה.`,
                            `קל להכנה גם בכמויות גדולות.`,
                            `אחסון בטמפ' החדר בכלי סגור בלבד.`,
                        ],
                    },
                    "חיטה":{
                        type : "listDots",
                        content: [
                            `החיטה היא דגן והיא מוזכרת כמזון עיקרי של האדם עוד בהיסטוריה.`,
                            `החיטה היא מקור מזון חשוב גם בימים אלה.`,
                            `מהחיטה טוחנים קמח.`,
                            `איזה מוצרים עיקריים עשויים מקמח חיטה?<ul>
                            <li>לחם.</li>
                            <li>דברי מאפה.</li>
                            <li>פסטה.</li>
                            <li>סולת.</li>
                            </ul>
                            `,
                            `הקליפה של גרעין החיטה נקראת :סובין.`,
                            `הסובין משמש מזון לבעלי חיים.`,
                            `יש חיטה רכה וקשה.`,
                            `החלבון הנמצא בחיטה נקרא גלוטן.`,
                            `יש חלק קטן מהאוכלוסיה שרגיש לגלוטן(צליאקי) ומייצרים עבורם מוצרים מיוחדים מחיטה ללא גלוטן.`,
                        ],
                    },
                    "דגנים":{
                        type : "listDots",
                        content: [
                            `שיפון-דגן המשמש למזון האדם. (לחם מקמח שיפון).`,
                            `שעורה-אחד מהדגנים הקדומים ביותר. משורה מנביטים לתת-משמש להכנת בירה. מכינים ממנה גם יישן שרף וויסקי ותחליף קפה.`,
                            `תירס-מקור התירס במרכז אמריקה. משמש מזון לאדם ולבעלי חיים.`,
                        ],
                    },
                    "תירס":{
                        type : "listDots",
                        content: [
                            `מוצרים מתירס
                            <ul>
                            <li>סולת תירס-להכנת דייסות פולנטה</li>
                            <li>עמילן תירס-קורנפלור משמש להסמכה.</li>
                            <li>קמח תירס.</li>
                            <li>פופ קורן.</li>
                            </ul>`,
                            `יחסי הסמכה:<ul>
                            <li>יחס של הסמכה קמח ומים של 70 גרם קמח על ליטר מים.</li>
                            <li>יחס של הסמכה קורנפלור ומים זה ליטר מים על 35 גרם קורנפלור.</li>
                            </ul>`,
                            `פולנטה:
                            <ul>
                            <li>זה טחון דק, היחס הוא נוזל לחומר גלם 4 ל1.
                            </li>
                            <li>שמים חמאה ופותחים אותה עם חלב ושמנת מלח ופלפל חום הכי נמוך ומערבבים כל הזמן.
                            </li>
                            <li>התירס סופג את הטעמים ונהיה מחיתי.</li>
                            <li>אפשר לקחת את הפולנטה להקשות אותה לצורות להקפיא אותה ואז לצפות אותה ולטגן אותה.</li>
                            </ul>`,
                            `קרוקט (לביבה מטוגנת ומוכנה לאכילה):
                            <ul>
                            <li>בקורס נעשה קרוקט תפו"א.</li>
                            <li>מכינים פירה מייבשים אותו ואז מוסיפים כשהוא קר חלמון. מזלפים לאצבעות ומקפיאים.</li>
                            <li>מצפים בקמח וביצה ואז פירורי לחם ומטגנים בשמן עמוק.</li>
                            </ul>`,
                        ],
                    },
                },
                "פירות": {
                    "סוגי-פירות":{
                        type : "listDots",
                        content: [
                            `פירות בעלי גלעין.-זיתים,אפרסק,שזיף, נקטרינה, שסק, תמרים יבשים, דובדבנים, משמש, תמרים לחים, אבוקדו.`,
                            `פירות בעלי חרצנים.-אבטיח, אגס, חבושים, מלון, תפוחי עץ (יונתן,סמית,דלישס) .`,
                            `פירות דמויי גרגירים.-ענבים ירוקים (מוסקט מרלו שרדונה), ענבים אדומים, רימון, תות שדה.`,
                            `פרי הדר.-תפוז, מנדרינה (קלמנטינה), אשכולית, אשכולית דם, לימון, תפוז דם, פומלה(קליפה עבה במיוחד).`,
                            `פירות בעלי קליפה קשה.-אגוזי פקאן, אגוזי מלך, פיסטוק, אגוז מקדמיה, בוטנים, שקדים, אגוז ברזילאי.`,
                            `פירות אקזוטיים- אבוקדו (זן איכותי האס), אפרסמון, גויאבות, פיג'ואה, פסיפלורה, סברס, קרמבולה, אנונה, בננות, מנגו, פיטנגה, פפאיה(מרכך בשר טבעי), קיווי, תאנים. מה שמסמל פירות אקזוטיים זה הצבע המראה האזור גידול שלו, המעבר ממדינה למדינה.
                            בפפאיה יש אנזים שמפרק את הבשר.
                            .`,
                        ],
                    },
                    "פירות-לעומת-ירקות":{
                        type : "text",
                        content: [
                            `כל מה שצומח על העץ נחשב לפרי.`,
                            `כל מה שצומח מהאדמה נחשב לירק.`,
                        ],
                    },
                    "סימני-היכר-לטריות-ירקות/-פירות": {
                        type : "listDots",
                        content: [
                            `ירק קשה, נשבר בקלות.`,
                            `ירק חלק ללא קמטים, פגיעות או נביטה.`,
                            `ריח אופייני (בעוקץ).`,
                            `צבע אופייני , אחיד (ללא כתמים).`,
                            `החיבור עם הצמח לא יבש.`,
                            `לא קל מידי (מלבד חציל).`,
                            `גודל אחיד.`,
                            `מעט אדמה על הירק (שורש).`,
                            `קנייה ממקור בטוח, אישור משרד הבריאות (חותמת).`,
                        ],
                    },
                    "פירות-כמנה-ראשונה":{
                        type : "listDots",
                        content: [
                            `כמנה ראשונה אפשר להגיש פירות שונים בצורותיהם הטבעיות, זאת בתנאי שהפרי רק יעורר את התיאבון לקראת המשך הארוחה אבל לא ישביע. נהוג להגיש פרי כמנה ראשונה קר מאוד, ממולא ביין פורט, באותו פרי חתוך קטן או במבחר פירות. לדוגמה חצי מלון ממולא ביין פורט מוגש על גבי קרח כתוש. או מניפת מלון בליווי חזה אווז מעושן. חצי אשכולית מוגשת קרה מאוד על גבי מפית בד, ניתן לפזר מעל מעט סוכר ולהשחים עם ברנר או לא.`,
                            `בננה ג'מייקה-ממלאים קליפת בננה בתערובת של קוביות בננה, תפוזים, אשכוליות וצנובר מעורבבים עם רוטב מיונז.`,
                        ],
                    },
                },
                "חומרי-גלם": {
                    "סוכר":{
                        type : "listDots",
                        content: [
                            `הסוכר מיוצר מסלק סוכר או מקנה הסוכר, אין הבדל במוצר הסופי.                        `,
                            `סוגי סוכר: <ul>
                            <li>סוכר חום-הוא סוכר שלא זוקק סופית, נמכר בעיקר לטבעונים ומתכונים מיוחדים.</li>
                            <li>סוכר גבישי לבן-דרגת בזיקוק שלו קובעת את צבעו.</li>
                            <li>אבקת סוכר-זהו סוכר טחון דק, משמש לקישוט, להכנת קרמים, לאפיה ועבודות סוכר.</li>
                            <li>סוכר קוביות-הקוביות מופיעות בשוק בגדלים שונים.</li>
                            <li>סוכר קאנדיס- סוכר מזוקק, בעל גבישים גדולים ושקופים, משמש כממתק בתעשיה.</li>
                            <li>סוכר וניל- תערובת של ונילין וסוכר (ונילין הוא המרכיב הכימי של הוניל). </li>
                            </ul>`,
                        ],
                    },
                    "סוגי-שומנים-ושמנים":{
                        type : "text",
                        content: [
                            `השומנים הם מקורות המזון המרוכזים ביותר, המספקים אנרגיה לגופנו, בכמות של שליש מהצריכה היומית בקלוריות. מקור השומנים הוא בטבע, והם נוצרים בצמחים למיניהם בזרעיהם, בקליפתם ובנבטים. בעלי החיים האוכלים את הצמחים, בונים מהם את השומנים הדרושים להם לבניית הרקמות בגוף וכמקור אנרגיה.`,
                            `מקורות השומן  אחד מהצומח והשני מהחי.                        `,
                            `<ul>
                            <li>שמן נוזלי: כגון שמן זית, כותנה, בוטנים, תירס, סויה, קנולה, חמניות, שומשום, אבוקדו ועוד. כמה שהחומציות (P.H) של שמן זית יותר נמוכה הוא יותר איכותי</li>
                            <li>שומן קשה מהצומח: שמן קוקוס, דקלים, חמאת קקאו.</li>
                            <li>שומן מן החי: חמאה, שומן אווזים, שומן בקר ועוד.</li>
                            </ul>`,
                            `דרגת העישון של השומנים השונים נעה בין 180-220 מעלות. חמאה ומרגרינה נשרפות בטמפ' יותר נמוכה, על כן אינן מתאימות לטיגון עמוק.`,
                            `כל שומן מהצומח אין בו כולסטרול.`,
                            `כל שומן מהחי יש כולסטרול.`,
                            `טיגון בשמן סויה.`,
                            `שמן דקלים לטיגון ולא לתיבול. הוא שמן שמחזיק הרבה זמן בטיגון. `,
                        ],
                    },
                    "חומץ":{
                        type : "listDots",
                        content: [
                            `התססה של סוכר (בעיקר פירות) הופך לכוהל.`,
                            `הכוהל מתחמצן, מדללים לקבלת הריכוז 5-8 %.`,
                            `בלסמי: בן יין שעובר יישון. בן יין מיוצר מענבים, בערך כמו יין מקולקל.`,
                            `שימושים: תיבול, שימור מייצב, חיטוי, הלבנה.`,
                        ],
                    },
                    "רסק עגבניות":{
                        type : "listDots",
                        content: [
                            `עגבניות מרוסקות מסוננות, מבשלים עד הריכוז ממלאים ומעקרים.`,
                            `Brix- אחוז (22-33) המוצקים ברסק העגבניות. (יותר גבוה-יותר כהה, פחות חמוץ).`,
                            `שימושים:קבלת טעם, צבע (מרוכז), מסמיך.`,
                            `לנטרל חמיצות מטגנים ומוסיפים מעט סוכר.`,
                        ],
                    },
                    "ריבה":{
                        type : "listDots",
                        content: [
                            `הריבה סמיכה, חלקה ללא חתיכות פרי.`,
                            `המרקחת (קונפיטורה) דלילה יותר עם הפרי.`,
                            `פקטין- חומר הנמצא בפרי לקרישת הריבה.`,
                            `אגר הינו ג'לטין צמחי מאצות ים, משרים כ10 דקות בנוזל (חסר טעם) ומחממים עד המסה.`,
                            ` קולי-מחית חלקה.`,
                        ],
                    },
                },
            },
            subject3 : {
                "בעלי-כנף": {
                    "בשר-בהיר-וכהה":{
                        type : "listNumbers",
                        content: [
                            `בעלי בשר בהיר-חיי המדף של הבשר בהיר הם קצרים יחסית, סלמונלה מתפתחת רק בעופות האלה, בתקלת בקושי בבשר הכהה. הטעמים הם פחות דומיננטים, העוף סופג טעמים טוב יותר. בשר בהיר צריך להגיע לרמת עשייה של וול דאן!! אסור להגיד בשר עוף בהיר מתחת לדרגת רמת מוכנות מלאה!`,
                            `בעלי בשר כהה- הפוך כמעט לחלוטין מבעלי בשר בהיר, חיי המדף שלהם ארוך יותר, פחות סיכוי לסלמונלה, טעמים דומיננטים. בשר חזה רצוי להגיש מדיום.`,
                        ],
                    },
                    "סוגי-בעלי-כנף":{
                        type : "listNumbers",
                        content: [
                            `הודו-Turky. בהיר.`,
                            `אווז-GOOSE. כהה.`,
                            `ברבר-Barbary duck. כהה.`,
                            `פנינית-Guinea fowl. כהה.`,
                            `מולארד-Mallard. כהה.`,
                            `עופיון-Poussin. בהיר.`,
                            `שליו-Quail. כהה.`,
                            `חוגלה-Parthridge. כהה.`,
                            `יונה-Pigeon squab. בהיר.`,
                            `פסיון-Pheasant. כהה.`,
                            `עוף-chicken. בהיר.`,
                            `ברווז-Aylesbury duck. כהה.`,
                        ],
                    },
                    "סימני-היכר-לאיכות-וטריות-בעלי-הכנף":{
                        type : "listDots",
                        content: [
                            `רגליים חלקות.`,
                            `מקור וציפורניים חדים וחלקים.`,
                            `פלומה עדינה בין הנוצות.`,
                            `קצה עצם החזה סחוסי ורך.`,
                            `שכבת שומן עדינה ודקה מתחת לעור.`,
                            `אחוז בשר גבוהה על העצמות.`,
                            `בשר מופרד בקלות מן העצמות.`,
                            `ריח אופייני והיעדר ריריות.`,
                            `צבע אופייני ללא שטפי דם.`,
                            `עופר ללא פגמים, עצמות לא שבורות.`,
                            `ברווזים/ אווזים קרום שחייה ברגליים עדין וניתן לקריעה.`,
                            `עוף טרי בתנאי שיווק ואחסון נכונים טוב לשימוש-עד 4 ימים.`,
                        ],
                    },
                    "המינים-השונים-של-העופות":{
                        type : "listDots",
                        content: [
                            `האפרוח-LE POUSSIN-הכוונה לעוף צעיר, במשקל של כ-300 גרם-טיגון, גריל וצלוי.`,
                            `פרגית אביבית-POULET DE GRAIN-עוף צעיר במשקל 600-800 גרם. צלוי (ממולא), גריל.`,
                            `פרגית-POULET-במשקל של כ-700-1000 גרם. מכינים כמו פרגית אביבית.`,
                            `תרנגולת-POULARDE-במשקל של כ1100-1800 גרם. שליקה, צלייה בנוזלים, צלייה יבשה, גריל, הברקה.`,
                            `תרנגול-COQE-בשרו יבש ולא טעים. צריך לבשל הרבה זמן לריכוך. בישול מרק, טחינה.`,
                            `תרנגולת זקנה-POULE-מכינים כמו התרנגול. ###עוף מבוגר זקן ומתאים לבישול בנוזל או להכנת מרק###.`,
                            `יונה-PIGEON-משתמשים רק ביונים צעירות. צלוי, גריל וטיגון.`,
                        ],
                    },
                    "יתרונות-בולטים-לשימוש-בבעלי-כנף":{
                        type : "listDots",
                        content: [
                            `זמינות בכל ימות השנה-מחרוזי גידול קצרים.`,
                            `מתאים לכל שיטות הבישול, מאשר הפקת מגוון רחב של מנות.`,
                            `מחיר זול יחסית, בשר בריא ופלות שומני.`,
                            `ניצול מקסימאלי של כל חלקי העוף כולל חלקי פנים.`,
                            `זמני הכנה קצרים ופשוטים יחסית.`,
                            `מנעד גדלים רחב להתאמה לשימושים השונים.`,
                            `זמינות של בעלי הכנף כמוצרי טרי/ קפוא.`,
                            `שליטה בחיתוך מס' מנות מדוייק בהגדרה מראש.(1/2, 1/4, 1/8).`,
                        ],
                    },
                    "חלקי-בשר-העוף":{
                        type : "listDots",
                        content: [
                            `אבטי דה וולאי-ABATIS DE VOLAILLE-חלקי פנים של העוף. לב, כבד, טחול.`,
                            `קורקבן- כינוי לקיבת השרירים.`,
                            `כנפיים (בגריל, גם ברוטב, כמו כנפי באפלו.`,
                            `חזה-נתח זה משמש לרוב להכנת שניצלים, מאכלים מוקפצים ועוד.`,
                            `כרעיים-זהו צירוף של שוק וירך מחוברים. נקרא בסלנג "רבע עוף".`,
                            `שוקיים-(פולקע) חלק שומני יותר, מכוסה עור, מכיל עצם, ניתן לבישול וצלייה.`,
                            `ירכיים-חלק שומני, מכוסה עור, מכיל עצמות. מחלק זה ניתן להוציא את העצמות והעור, והבשר שנשאר מכונה בסלנג: "פרגיות". הפרגיות הן בשר מצוין לצלייה, כנתח או על שיפודים.`,
                            `גרון-מעין נתח דל מאוד בבשר , משמש בעיקר למרק.`,
                            `גב- עמוד השדרה של העוף והעצמות המחוברות אליו-משמש להכנת מרק בלבד.`,
                        ],
                    },
                    "בישול-חלקי-העוף":{
                        type : "listDots",
                        content: [
                            `איך מכינים חטיפי עוף מטוגנים? טובלים את הבשר בבצק טיגון ומטגנים בשמן עמוק דל בשומן ודורש בישול קצר או טיגון.`,
                            `ניתן לבשל עופות בשלמותם, מפורקים או טחונים. לבישול העוף בשלמותו מתאימות שליקה, אפייה וצלייה. לצלייה הכי מתאימים עופות צעירים פרגיות על הגב מתחילים ב200 מעלות ומורידים ל180, עוף שלם ניתן גם למלא נקרא עוף ממולא בנוסח מזרחי.`,
                            `עוף מפורק וחלקי פנים ניתן לבשל גם על ידי טיגון. בשר עוף טחון מתאים בעיקר לשליקה או צלייה. בדרך כלל כקציצות או כמילוי לנקניקיות.`,
                            `מורידים את החזה מהשלד ומורידים את העור. אפשר לחתוך לשניצל, למוקפץ, לטיגון, לשליקה, לבשל באדים ועוד. או להשאיר את החזה בשלמותו.`,
                            `אפשר לעשות כיס בחזה שלם ולמלא בסוגים רבים של מילויים. חזה ממולא בדוקסל, חזה ממולא במנגולד ופירות יבשים. צלוי, מזוגג, מבושל באדים.`,
                            `צ'יקן קייב-חזה עוף ממולא חמאת שום שמיר, מצופה ציפוי אנגלי, מטוגן בשמן עמוק.`,
                            `חזה עוף גלנטין ממולא לפלטות קרות במזנונים קרים.`,
                        ],
                    },
                    "בלוטין":{
                        type : "listDots",
                        content: [
                            `מתייחס לשוקי עוף מממולאים. יכול להיות גם לברווזנים תרנגולי הודו צעירים, כתף וחזה מעגל או מטלה שפרקו מהם את כל העצמות. זה מגיע עם או בלי חומרי קישוט. לאחר מילוי קושרים את הבלוטין לסוג של רולדה עבה או לצורה הקודמת של החלק ומכינים באחד מאופני ההכנה הבאים:`,
                            `-בישול בנוזל טוב.`,
                            `-צלייה בנוזל/ רוטב.`,
                            `-הברקה.`,
                            `-לשוקי עוף בלוטין הכי מתאים זיגוג במהלך פעולת הזיגוג של עוף ממולא יוצקים עליו מהנוזלים שהצטברו מתחילת הזיגוג`,
                        ],
                    },
                    "גלנטין":{
                        type : "listDots",
                        content: [
                            `זהו חזה עוף ממולא בסוגים שונים של מילויים, לפלטות קרות במזנונים קרים. עשוי בשליקה. `,
                        ],
                    },
                    "כדאי-לדעת":{
                        type : "listDots",
                        content: [
                            `מהו הטעם הדומיננטי בתבשיל עוף הגל החדש?-תפוזים.`,
                            `מהו הציפוי המקובל לקרוקט עוף?-קמח, ביצים, פירורי לחם.`,
                            `ממה מכינים רוטב לעוף צלוי בתנור?-ממשקע הצלייה, המירפואה ונוזל חום.`,
                            `צלי עוף באלפס מתאים להגיש עם אורז.`,
                            `באיזה יין משתמשים להכנת עוף ביין?-יין אדום יבש.`,
                            `פעולת הציפוי של כתיתות (שניצל) בפירורים נקראת PANER.`,
                            `ההשלמה של עוף בנוסח "הציידים"-פטריות ועגבניות קונקסה.`,
                            `איך מוגשת ההשלמה של נקניקיות ובצלצלים, בצלי עוף באלפס בנוסח צ'יפוטלה? יחד עם כל מרכיבי המנה.`,
                            `כדי להכין עופיון או פרגית באסכלה (גריל)-פותחים את העוף לאורך עמוד השדרה ומשטחים.`,
                            `עיבוד בסיסי לעופות לפני צלייה כולל-קשירה ותיבול.`,
                            `מה השלב האחרון בהכנת שניצל מחזה עוף לקראת טיגון והגשה?-ציפוי בפירורי לחם.`,
                            `לאיזה תבשיל מתאים להגיש רוטב טריאקי?-שיפודי עוף בגריל.`,
                            `כיצד מקובל להגיש חזה עוף בנוסח הסרט הכחול?-על גבי עלה חסה ולימון לקישוט.`,
                            `ההגשה הקלאסית המומלצת לנתחוני עוף בנוסח אסיאתי היא:-בכלי מרכזי בליווי קערית אורז.`,
                            `איזה תבשיל עוף מכינים על ידי טיגון בשמן עמוק?-שניצל בציפוי וינאי מחזה עוף.`,
                            `אלו עופות או חלקי עופות מתאימים לצלייה ברוטב (BRAISER)-עופות שאינם צעירים חתוכים לרבעים או לשמיניות.`,
                            `עוף מבושל קלאסי מקובל להגיש עם רוטב-עידית.`,
                            `חזה עוף בנוסח "ארג'נטיי" (ARGENTEUIL) מגישים עם:-אספרגוס ורוטב עידית.`,
                        ],
                    },
                },
                "פרה": {
                    "חלקי-הפרה":{
                        type : "listDots",
                        content: [
                            `חלקים נייחים- 1- ורד הצלע (צלעות מכוסות). 11- סינטה (בר מותן). 12-פילה (מותנית). 13-שייטל (מותן). חלקים נייחים הם החלקים שנמצאים בגב הפרה, שפחות פעילים בתזוזת הגוף. והם יותר רכים משאר חלקי הפרה. רצוי מאוד ליישן אותם. הכנה קצרה ללא נוזלים. חלקים אלה הם לפי מידת עשייה.`,
                            `חלקיים ניידים-כל שאר החלקים הם חלקים ניידים. חלקים קשים יותר, הם תמיד בתנועה ותמיד זזים. חייבים בבישול ארוך עם נוזלים, עד לריכוך מלא.`,
                            ` כתף מרכזית 4  צלי כתף 5 ופילה מדומה 6 הם חלקי הכתף , אווזית אגוזית 14 צ'אך נתח הירך 15 ופינת הירך כף 16 הם חלקי הירך. 8- שוק. 9- צלעות שטוחות (שפונדרה, אסאדו). 10- צוואר. 17- בטן פלדה. 18- שוק אחורי. 19- ראש הירכה-וויסבראטן. 3- חזה. 2- צלעות נמוכות.`,
                        ],
                    },
                    "איכות-הבשר":{
                        type : "listDots",
                        content: [
                            `גיל ומין-צעיר=רך , הבדל בין השרירים קטנים יותר, פחות טעמים.`,
                            `הנקבה פחות שרירית, מבנה טוב יותר.`,
                            `תזונת הבהמה משפיעה על איכות הבשר והשומן, עדינות וטעם.`,
                            `השיטה היום תזונה טובה ואינטנסיבית שחיטה בגיל צעיר ובמשקל גבוה יחסית.`,
                            `טיפול לפני ואחרי השחיטה-מנוחה וללא לחץ לפני השחיטה. מנוחה לשרירים אחרי השחיטה. `,
                            `זן הבקר-בזנים איכותיים, תפוקת הבשר, אחוזי השומן ואיכות הבשר טובים יותר. שרולה לימוזין ואנגוס הכי טובים בסטייק. A5  זהו הבשר הטוב ביותר.`,
                        ],
                    },
                    "צורות-שיווק":{
                        type : "listDots",
                        content: [
                            `בשר בקר מעובד- מוצר המיוצר מבשר קפוא לרוב, אשר עבר טיפול כגון: הוספת מים (לא יותר מ10%), פוספטים תבלינים, חומרי כבישה שימור או חומרים אחרים. לרוב מופיע בצורת קציצות, קבב, והמבורגר תעשייתיים או גושי בקר קפואים. חובה לרשום על האריזה.`,
                            `בשר בקר קפוא-לא מעובד, בשר שלא עבר טיפול כלשהו, למעט הקפאה בטמפרטורה נמוכה באופן שמאפשר אחסון למשך זמן של מספר חודשים. צריך הקפאה מהירה והפשרה ממש איטית. בהקפאה ובעיקר ההפשרה הבשר מאבד נוזלים ויחד עם זה טעמים, המרקם משתנה והערך התזונתי נהרס.`,
                            `בשר בקר טרי-בשר אשר לא עבר תהליך כלשהו, למעט צינון בטמפרטורה בין 0ל4 מעלות. בשר טרי לא הוקפא מעולם, אין בו תוספים מלאכותיים, כימיקלים או חומרי ריכוך. בשר טרי עשיר בברזל, ויטמין   B12,אבץ ומרכיבים נוספים היוצרים ערך תזונתי גבוה יותר.`,
                            `יישון בשר-תהליך טבעי לריכוך הבשר, האנזימים שבתוך הבשר מפרקים את החלבונים. ריכוז הטעמים על ידי איבוד נוזלים. צבע הבשר הופך לכהה יותר, בלחיצת אצבע נשאר שקע. ישנם 2 סוגי יישון בשר, הראשון הוא יישון יבש על ידי תליה על וו במרווחים. שמים במקרר יבש 0-4 מעלות שבועיים עד שלושה (קילוף השכבה החיצונית). היישון השני הוא יישון בוואקום, הנתח נארז בוואקום, מכניסים לנוזלים והופכים מדי פעם, עסיסיות נשמרת ויישון אחיד. היישון השלישי האפשרי הוא יישון בשמן, משרים בשמן והופכים מדי פעם, השמן מונע חדירת חמצן והתחמצנות חודר בין הסיבים ומפרק את החלבון.`,
                        ],
                    },
                    "סימני-זיהוי-לאיכות-וטריות":{
                        type : "listDots",
                        content: [
                            `צבע הבשר אדום זוהר.`,
                            `שכבת שומן בהירה בעובי 1-2 ס"מ על גבי הבשר.`,
                            `בשר משויש.- שזור בסיבי שומן.`,
                            `סיבים דקים ועסיסיים.`,
                            `ריח אופייני.`,
                            `בשר מלא (יחסית לעצמות).`,
                            `הבשר ניתן לפירוק בקלות מהעצמות.`,
                            `הבשר אינו לח ואינו זגוגי.`,
                            `בשר מיושן: רך, בלחיצת אצבע נשאר שקע (צבע כהה).`,
                            `מ1-10 כלל חלקי הפרה הם קדמיים.`,
                            `מ11 ומעלה חלקי הפרה הם אחוריים וחייבים בניקור.`,
                        ],
                    },
                },
                "עגל-חלב": {
                    "בשר-העגל":{
                        type : "listDots",
                        content: [
                            `נחשב בשר משובח. גיל רצוי לשחיטה כשלושה חודשים. בין 10 ל12 שבועות.`,
                            `צבע הבשר וורוד, רקמות עדינות, מוצק ולח. צבע שומן לבן.`,
                            `כתפיים, ירכיים וצלעות קצרות ומלאות בשר. משקל טבחה כ120 ק"ג.`,
                            `העצמות נקבוביות ואדומות, ניסור ללא שבבים.`,
                            `אם מיועד לשיווק כבן בקר, עובר לפיטום.`,
                        ],
                    },
                    "עגל-מרבק":{
                        type : "text",
                        content: [
                            `קשב לפקח על התזונה חלב ועשב.`,
                            `בשר: כהה יותר, מלוח יותר קשה ביותר.`,
                            ``,
                        ],
                    },
                    "חלוקת-העגל":{
                        type : "listNumbers",
                        content: [
                            `ירך –Cuissot נחשב לחלק איכותי.`,
                            `גב- Selle  נחשב לחלק איכותי , חלק מהכתף מקביל למספר 4.`,
                            `כתף- Epaule.`,
                            `חזה- Poitrine.`,
                            `צוואר- Cou.`,
                        ],
                    },
                },
                "טלה": {
                    "בשר-טלה":{
                        type : "listDots",
                        content: [
                            `טלה חלב הוא עד 6 חודשים, ניזון מחלב ותחליפיו.`,
                            `בבשר עדין ובהיר.`,
                            `ללא ריח אופייני.`,
                            `טלה רגיל הוא עד גיל שנה.`,
                            `בשר אדום בוהר אך סיבים עדינים.`,
                            `בעל ריח אופייני עדין.`,
                        ],
                    },
                },
                "כבש": {
                    "בשר-כבש":{
                        type : "listDots",
                        content: [
                            `כבש מסורס או נקבה שטרם המליטה, עד גיל שנתיים, נחשב לבשר מעולה, צבע אדום כהה, סיבים עבים אך עסיסיים וטובים.`,
                            `מעל גיל שנתיים- צבע אדום חום, סיבים גסים, בעלי ריח אופייני חזק, שומני מאוד (משתמשים בתבלינים ארומתיים-רוזמרין, שום, קינמון וכדומה).`,
                            `רצוי להשהות במקרר לפחות שבוע מזמן השחיטה.`,
                        ],
                    },
                },
            },
            subject4 : {
                "דגים-בתפריט": {
                    "מנות-ראשונות":{
                        type : "listDots",
                        content: [
                            `מנות ראשונות קרות מדגים-סביצ'ה, קרפצ'יו, סושי, סשימי וטרטר. המשקל בין 80-120 גרם.                            `,
                            `FUME-דג מעושן- עישון קר- העישון מתבצע בטמפ' של 25 מעלות. העשן מגיע קר לדג מתאים לדגים עדינים כמו סלמון, פורל וטונה.`,
                            `עישון חם- בעזרת עישון חם, החום מבשל את הדג עם טעמים של סוג העץ שאיתו מעשנים. מתאים לקרדה, סלמון טונה ומקרל.`,
                            `אילתית מעושנת (סלמון) כמנה ראשונה קרה, טוב להגיש עם רוטב קר של שמנת עם חזרת.`,
                            `צורת הגשה קלאסית היא בצלחת מתאימה לגודל המנה בתוספת טוסט וחמאה.`,
                            `גראבלקס- סלמון כבוש- על פילה דג של 900 גרם מערבבים 75 גרם מלח עם 120 גרם סוכר, 2 כפיות גרגרי פלפל לבן, מפזרים על הדג את התערובת ומעל מפזרים שמיר. משרים את הדג במשך יומיים.`,
                            `MARINE דג כבוש-יש שני סוגי כבישה, כבישה לבנה וכבישה אדומה שהכבישה זו נשתמש בסלק. הכבישה מתבצעת במרינדה עם מים, מלח וחומץ, ירקות ותבלינים. מטיאס והרינג דגים מתאימים.`,
                            `דג מלוח –SALE- מפזרים כמות גדולה ל מלח גס לשם הוצאת נוזלים מהדג, סרדינים אנשובי ובמיוחד הרינג!!!`,
                            `דג מיובש-SACHE- ייבוש הדג נעשה על ידי משוב אוויר, ייבוש המים בדג יש המשתמשים במלח, חיי מדף ארוכים (סול, קוד ובקלה).`,
                            `דג נא-דג שלא עבר בישול, צריך להיות מדג איכותי עדין וטרי ביותר.`,
                            `סשימי-דג טרי איכותי, נא וללא עצמות, פרוס דק!!! מגישים על קרח. דרך כלל מגישים ליד ווסבי, ג'ינג'ר, רוטב על בסיס סויה קר ומלפפון ירוק.`,
                            `טרטר-קוצצים את הדג נא לברונואז קטן. מוסיפים את חומרי הקישוט, עשבי תיבול, בצל קצוץ, זיתים שחורים וכו'. הכל חתוך לקוביות קטנות. רצוי להשלים טעם קרוב ככל האפשר לפני ההגשה.`,
                            `קרפצ'יו-פורסים את הדג הנא דק דק, ורגע קצר לפני הגשה נותנים לו את הכבישה. מלח גס, פלפל שחור גרוס, שמן זית ולימון או חומץ.`,
                            `איקרה-IKRA- מכינים מביצי דגים שמן ולימון לרוב מקרפיון, ממליחים או שמשרים במים מלוחים. מוסיפים פירורי לחם לבן מושרה בחומץ ובצל קצוץ, טוחנים עד מרקם חלק ומוסיפים שמן בזרם דק כמו למיונז. משלימים טעם עם חומץ ומלח. המרקם כמו של מיונז סמיך.`,
                            `הגשה- על לחם, עגבניות, מלפפונים וכדומה או כמילוי למנות ראשונות. הצבע תלוי מסוג הדגים או צבע מאכל. בטורגו-ביצי בורי ממולחים, מיובשים, עטופים בשעווה.`,
                            `סביצ'ה דג נא טרי-CEVICHE-מקור הסביצ'ה בדרום אמריקה בפרו, אך הוא נפוץ בכל העולם. בדרך כלל מה שמוכר במטבח האסייתי והאירופאי הכנת הדג נעשת על המקום, על מנת לא לבשל את הדג, אך יש מתכונים שמקורם בפרו שתהליך ההכנה יכול להיות גם שעתיים, על מנת לחזק את הטעמים. הסביצ'ה מורכב מדגים לא מבושלים, דג נא המושרים במיץ ליים או לימון, ניתן להשתמש גם במיצים אחרים. עם בצל קצוץ ירקות פירות מנגו  עשבי תיבול כוסברה וכדומה. ותוספות שונות אלכוהול וטקילה. ###שמן זית ומיץ לימון### בתיבולים שונים###.`,
                            `אסקבש דגים-ESCABECHE DE POISSON- מקמחים ומטגנים בשמן דגים קטנים או חתיכות של דגים גדולים. בנפרד מכינים רוטב: פורסים גזר ובצל לאמנסה. מטגנים בשמן, מוסיפים חומץ מהול במים, שום שלם, עלי דפנה ופלפל אנגלי. יוצקים חם על הדגים ומקררים ל24 שעות בתוך הרוטב. לאחר הקירור מסדרים מהדגים על גבי צלחת ההגשה, מקשטים באמנסה של הגזר והבצל מהרוטב, יוצקים קצת מהרוטב ומפזרים פטרוזיליה קצוצה.`,
                        ],
                    },
                    "מקום-הדגים-בתפריט":{
                        type : "listDots",
                        content: [
                            `מנה ראשונה לדוגמא: סביצ'ה, קרפצ'יו, סושי, סשימי. משקל הדג המנה הראשונה בין 80-120 גרם. מנה קרה.`,
                            `מנות ביניים לדוגמה: דג נסיכה מזרחי, קבב דגים, נתחוני דג בטמפורה. מגישים אותה תמיד מנה חמה. משקל הדג כמנת ביניים עם עצם בין 160-250 גרם. משקל הדג כמנת ביניים ללא עצם בין 80-120 גרם.`,
                            `מנות עיקריות לדוגמה: דג בגריל, פילה דג ברוטב, דג מטוגן. משקל הדג במנה עיקרית עם עצם בין 350-500 גרם. משקל הדג במנה עיקרית בלי עצם: 180-230 גרם.`,
                        ],
                    },
                    "פילוט-וכשרות":{
                        type : "listDots",
                        content: [
                            `כאשר מפלטים דגים מהעצמות, הפחת מגיע ל50% ממשקל הדג.`,
                            `דג כשר הוא דג שיש לו קשקשים וסנפירים.`,
                            `אין צורך להכשיר דגים`,
                        ],
                    },
                },
                "אחסון-וטריות": {
                    "סימני-טריות-לדגים":{
                        type : "listDots",
                        content: [
                            `ריח אופייני.`,
                            `מרקם הבשר-קשה וגמיש, לא נשאר שקע.`,
                            `עיניים בולטות ובהירות.`,
                            `זימים אדומים.`,
                            `מכסה הזימים סגור.`,
                            `קשקשים צמודים לדג. (אינם יורדים בקלות.)`,
                            `מכסה הזימים סגור היטב.`,
                            `ברק אופייני לעור הדג.`,
                            `הבטן לא נפוחה מגזים.`,
                            `דג טרי המונח במים שוקע.`,
                            `בדגים לא לוקחים סיכון, סימן אחד מספיק כדי לפסול שימוש בדג.`,
                        ],
                    },
                    "אחסון-דגים-טריים":{
                        type : "listDots",
                        content: [
                            `טמפ' 1 עד 1- מעלות.`,
                            `מכוסה בפתיתי קרח.`,
                            `קצר עד כמה שאפשר- יום עד יומיים.`,
                            `לבדוק טריות שוב לפני השימוש.`,
                        ],
                    },
                    "אחסון-דגים-קפואים":{
                        type : "listDots",
                        content: [
                            `לא לאחסן דג לא נקי.- יש צורך לנקות את כל הזימים והבטן , לאחר מכן מייבשים ואז מקפיאים אותו.`,
                            `טמפ' 18- עד 22-.`,
                            `לעטוף במספר שכבות של ניילון נצמד או וואקום.`,
                            `הקפאה מהירה, הפשרה איטית.`,
                        ],
                    },
                    "דרכי-שימור":{
                        type : "listDots",
                        content: [
                            `כבישה בחומץ או מיץ לימון.`,
                            `כבישה במלח/סוכר.`,
                            `עישון.`,
                            `ייבוש.`,
                            `שימורים.`,
                            `הקפאה.`,
                        ],
                    },
                },
                "סוגי-דגים":{
                    "דגי-נחלים-ואגמים-מים-מתוקים":{
                        type : "listDots",
                        content: [
                            `טעמם פחות עשיר מדגי הים.`,
                            `בשר רך וכהה יותר מבדרך כלל.`,
                            `שמנים יותר. (מפוזר בתוך רקמת הבשר).`,
                            `גודל וזמינות לא קבועים.`,
                        ],
                    },
                    "דגי-החקלאות-הימית":{
                        type : "listDots",
                        content: [
                            `זמינות וגודל קבועים.`,
                            `מחיר קבוע.`,
                            `טעמם ומרקמם תלוי בגידול`,
                        ],
                    },
                    "דגי-ים":{
                        type : "listDots",
                        content: [
                            `חיים בטבע, לכן נלחמים על מזונם.`,
                            `בשרם שרירי ומוצק.`,
                            `רזים יותר. (השומן בעיקר באזור הבטן).`,
                            `טעמם עשיר יותר , בגלל מגוון המזון.`,
                        ],
                    },
                },
                "סוגי-דגים-אצלנו-בארץ-מים-מתוקים":{
                    "בורי-קיפון":{
                        type : "listDots",
                        content: [
                            `מקום גידול: בריכות מים מתוקים,גודל בין 1 ל2 ק"ג.`,
                            `בשר מוצק ולבן, בעל רצועה אפורה לאורך הגב.`,
                            `מומלץ להמליח ליבש ולשמר את ביציי הבורי. הבריכה טובה מהים ללא טעם לוואי.`,
                            `שיטת ריכוך: צלייה ברוטב, אפיה, טיגון או גריל.`,
                        ],
                    },
                    "אמנון,-מושט":{
                        type : "listDots",
                        content: [
                            `מקום גידול מים מתוקים.`,
                            `גודל ממוצע 250-1 קילו. אורך 20-30 ס"מ.`,
                            `בשר הדג רך ומעט שומני.`,
                            `צבע לבן ירקרק או אפור.`,
                            `שיטות ריכוך: טיגון, אפיה, צלייה ברוטב.`,
                        ],
                    },
                    "קרפיון":{
                        type : "listDots",
                        content: [
                            `גדל במים מתוקים. גודל בין 300 ל500 גרם, 20-60 ס"מ.`,
                            `בשר שמן טעמו בוצי במקצת.`,
                            `מונה למעלה מאלף סוגי קרפיון.`,
                            `איקרה ביצי הדג.`,
                            `שיטות ריכוך: בישול, צלייה ברוטב.`,
                        ],
                    },
                    "פורל":{
                        type : "listDots",
                        content: [
                            `גדל בבריכה מים קרים וחמצן רב.`,
                            `גודל ממוצע: אורך בין 20 ל30 ס"מ ומשקל של 250 עד 800 גרם.`,
                            `בשר שמן מוצק בעל טעם עדין.`,
                            `מאבד מטעמו לאחר היציאה מהמים.`,
                            `שיטות ריכוך: מטוגן, צלייה בגריל, בתנור, באדים, שליקה (בישול בנוזל מתחת לרתיחה.), בישול כחול`,
                        ],
                    },
                    "אילתית,-סלמון":{
                        type : "listDots",
                        content: [
                            `גדל אזורים הצפוניים באוקייאנוס ובנהרות.`,
                            `כ5-6 ק"ג.`,
                            `בשר שמן עדין ואיכותי.`,
                            `שיטות ריכוך: נא, גריל, באדים, טיכון במחבת, כבוש, מעושן.`,
                        ],
                    },
                },
                "דגי-ים-דגי-מים-מלוחים":{
                    "דניס,-צ'יפורה":{
                        type : "listDots",
                        content: [
                            `מקום גידול בריכות ובאזורים סלעיים בים.`,
                            `גודל בין 300 ל700 גרם.`,
                            `בשר לבן מוצק שומני ועשיר בחלבון ובוויטמינים.`,
                            `צבע אפור כסוף, כתם זהוב בין העיניים.`,
                            `שיטות בישול גריל ואפיה. טיגון במחבת.`,
                        ],
                    },
                    "זאב-ים-בקלה":{
                        type : "listDots",
                        content: [
                            `מי ים עמוקים בים התיכון והאוקיינוס האטלנטי.`,
                            `גודל בין 15 ל50 ס"מ. 100 גרם עד 2.5 ק"ג.`,
                            `בשר רזה לבן ורך.`,
                            `בארץ קפוא, קטן-שלם ללא ראש, גדול-מפולט.`,
                            `שיטות ריכוך: מטוגן, צלוי ברוטב, אפוי.`,
                            `שיטת בישול להשרות בתבלינים לשים במקרר שעתיים ואז לייבש ולטגן בציפוי.`,
                        ],
                    },
                    "באס":{
                        type : "listDots",
                        content: [
                            `בריכות מים מתוקים או בים.`,
                            `גודל בין 350-600 גרם.`,
                            `בשר רך לבן ועדין.`,
                            `הדג בצבע כסוף בהיר, גב כהה בגווני תכלת.`,
                            `דג טורף, עשיר באומגה 3.`,
                            `שיטות ריכוך: מטוגן במחבת, אפייה.`,
                        ],
                    },
                    "לברק":{
                        type : "listDots",
                        content: [
                            `גדל בבריכות ובים.`,
                            `גב אפור- כסוף, בטן צהובה, כתם ליד הזימים.`,
                            `אותו דבר כמו הבאס והמוסר.`,
                        ],
                    },
                    "מוסר-עיט-הים":{
                        type : "listDots",
                        content: [
                            `מאוד פופלרי בארץ.`,
                            `שיטות ריכוך: טיגון במחבת, אפייה.`,
                            `באס לברק ומוסר מאוד טובים לאכילה גם בצורה נאה, ובמאפייניהם.`,
                        ],
                    },
                    "ברבוניה,-סולטן-איברהים,-מולית-אדומה":{
                        type : "listDots",
                        content: [
                            `גדל בים הפתוח רחוק מהחוף.`,
                            `דג קטן בצבע וורוד אדום.`,
                            `בשר יציב ומעט נוקשה. בגופו אחוז גבוה של זרחן מתבשל במהירות.`,
                            `שיטות ריכוך: טיגון בשמן עמוק או במחבת.`,
                        ],
                    },
                    "סרדין":{
                        type : "listDots",
                        content: [
                            `חי בלהקות לאורך החופים, בעיקר בחורף.`,
                            `בשר כהה, עשיר בחלבונים, סידן, זרחן, ברזל, אשלגן, ויטמין 6B ואומגה 3.`,
                            `ניקוי קל אפשר לאכול אותו עם האידרה.`,
                            `שיטות ריכוך: שימור בשמן, מטוגן(ממולא), גריל.`,
                        ],
                    },
                    "לוקוס-לבן":{
                        type : "listDots",
                        content: [
                            `גדל בימים בעלי מים חמימים.`,
                            `בשר לבן ונוקשה.`,
                            `הלוקוס הטעים ביותר, המבוקש ביותר.`,
                            `שיטות ריכוך: דג נא, באדים, אפוי.`,
                        ],
                    },
                    "לוקוס-הסלע-דאור":{
                        type : "listDots",
                        content: [
                            `גדל באזורים סלעיים בים התיכון.`,
                            `בשר לבן פחות עסיסי מהלבן. עור עבה וחזק.`,
                            `שיטת ריכוך: צלייה ברוטב ואפייה.`,
                        ],
                    },
                    "לוקוס-חפש":{
                        type : "listDots",
                        content: [
                            `גדל במים חמים.`,
                            `בשר פחות עדין משאר המשפחה.`,
                            `זול יחסית טוב לצלייה ברוטב.`,
                        ],
                    },
                    "אינטיאס-ילו-טייל-שולה":{
                        type : "listDots",
                        content: [
                            `גדל בים התיכון. בשר לבן מוצק מאוד בעל טעמים חזקים.`,
                            `עין גדולה , פס צהוב לאורכו, דג טורף.`,
                            `שיטות ריכוך: אפיה, צלייה ברוטב, גריל, נא.`,
                        ],
                    },
                    "טונה-כחולה":{
                        type : "listDots",
                        content: [
                            `גדל באוקיינוס האטלנטי.`,
                            `גדול כחצי טון. אורך כ2.5 מטר.`,
                            `בשר דג מאוד עשיר (טורף).`,
                            `מהיקרים ביותר בין 50 ל200 דולר למנה. מספרם קטן עקב ביקוש.`,
                            `שיטות ריכוך: דג נא או צרוב.`,
                            `קיימים סוגים שונים של דגי טונה, בשיטות הכנה שונות.`,
                        ],
                    },
                    "מקרל-לקרדה":{
                        type : "listDots",
                        content: [
                            `בריא מאודף עשיר באומגה 3, אינו יקר יחסית.`,
                            `נפוץ בים התיכון וים סוף.`,
                            `בשן דג שמן, כהה, בעל טעם חזק.`,
                            `טוב לעישון חם וגריל.`,
                        ],
                    },
                    "סול-צפוני":{
                        type : "listDots",
                        content: [
                            `דג שטוח רזה וחום.`,
                            `גדל באוקייאנוס האטלנטי, על קרקע חולית. טעם עדין`,
                            `שיטות ריכוך: טיגון במחבת, טיגון בשמן, שליקה.`,
                        ],
                    },
                    "פארידה":{
                        type : "listDots",
                        content: [
                            `גדל בים סוף, דג לבן ועסיס עשיר בטעמו.`,
                            `מתייבש בבישול, יקר יחסית.`,
                            `שיטות ריכוך: טיגון, גריל ואפייה.`,
                        ],
                    },
                },
                "שיטות-בישול-לדגים":{
                    "דג-אפוי-AU-FOUR":{
                        type : "listDots",
                        content: [
                            `מתאים לדגים איכותיים שלמים.`,
                            `חורצים את הדג לפי גודל המנה.`,
                            `מתבלים ומשמנים ואופים (140-160 מעלות).`,
                            `אפשר שיהיה מצע מתחת של עגבניות, ירקות, עשבי תיבול. `,
                            `בזמן האפייה בוזקים מהשומן המצטבר, בדגים שלמים אפשר להוסיף מעט נוזל.`,
                            `אפשר לעטוף או לכסות בנייר כסף.`,
                        ],
                    },
                    "מבושל-BOUILLI":{
                        type : "listDots",
                        content: [
                            `מבשלים את ציר הדגים במשך 30 דקות.`,
                            `בישול עדין של דגים שלמים בנוזל קר.`,
                            `מכניסים את הדגים ומבשלים בטמפרטורה של 90-95 מעלות.`,
                            `מבשלים את הדגים בין 10 ל20 דקות, תלוי בגודל הדג.`,
                            `דגים קטנים או מנות דגים נתחיל לבשל בנוזל רותח. הגשה חמה. כמות הנוזלים בגובה הדג.`,
                            `רצוי לבשל דגים שלמים, כך נשמר טעמם.`,
                            `דגים גדולים נתחיל לבשל במים קרים ומחממים באיטיות, עד לנקודת רתיחה. בדרך כלל מוגש קר למזנונים עם רטבים קרים.`,
                            `תוספות המקובלות: תפו"א מבושלים, ירקות מבושלים.`,
                            `רטבים פיקנטיים על בסיס יין לבן- צלפים, חרדל, חזרת, עשבי תיבול.`,
                            `רוטב יין לבן (SAUCE VIN BLANC) מוגש לדגים מבושלים.`,
                            `דג קרפיון מבושל טוב להגיש עם- חזרת אדומה.`,
                            `דגים מבושלים במטבח הקלאסי מגישים עם – תפוחי אדמה בפטרוזיליה.`,
                        ],
                    },
                    "שליקה-POCHER":{
                        type : "listDots",
                        content: [
                            `לשיטה זו מתאימים דגים קטנים, נתחוני דגים או פילה דגים. מנות מעוצבות מפילה דגים. כופתאות דגים. שמירה על צורה וערך תזונתי (חלבון).`,
                            `משמנים כלי שטוח.`,
                            `מניחים את הדג.`,
                            `מטבלים מלח, פלפל לבן, מיץ לימון ויין לבן.`,
                            `מכסים בנייר פרגמנט.`,
                            `מכניסים לתנור בחום בינוני או על הגז בטמפ' מתחת לרתיחה.`,
                            `מרככים את הדג עד שהוא מוכן מבלי להגיע לנקודת רתיחה.`,
                            `###לדג מעודן מוגש בדרך כלל רוטב יין לבן###.`,
                            `יש אפשרות להניח את הדג על בצל מאודה או ירקות שורש. תוספות מקובלות- תפוחי אדמה מבושלים או מחית.`,
                        ],
                    },
                    "בישול-כחול-AU-BLEO":{
                        type : "listDots",
                        content: [
                            `שיטת בישול זו מתאימה לדגים בעלי שכבת עור בלתי פגומה, לדוגמה קרפיון. לדגים בעל ריריות חיצונית, לדוגמה פורל שיצא עכשו מהמים. צריך שהדג יהיה הכי טרי שיש. `,
                            `התנאים לקבלת צבע כחול הם:`,
                            `הדג צריך להיות טרי לחלוטין.`,
                            `אסור להוריד את הקשקשים והסנפירים.`,
                            `זמן קצר לפני הבישול יש לצקת על הדג מעט חומץ מהול במים.`,
                            `מבשלים בציר דגים המכיל 10% חומץ ו15 גרם מלח לכל ליטר נוזל.`,
                            `מכניסים את הדגים למים בטמפ' של 95 מעלות מתחת לנקודת הרתיחה על מנת למנוע את התפוצצות העור.`,
                            `ההגשה נעשית לייני האורח. (קילוף העור ופילוט).`,
                            `הרטבים ההשלמות והתוספות כמו בPOCHE.`,
                            `שמך זהו דג פורל.`,
                        ],
                    },
                    "טיגון-במחבת-S.A.P":{
                        type : "listDots",
                        content: [
                            ``,
                            ``,
                            ``,
                        ],
                    },
                    "תת-נושא-4":{
                        type : "listDots",
                        content: [
                            ``,
                            ``,
                            ``,
                        ],
                    },
                    "תת-נושא-4":{
                        type : "listDots",
                        content: [
                            ``,
                            ``,
                            ``,
                        ],
                    },
                },
                "תת-נושא-4":{
                    "תת-נושא-4":{
                        type : "listDots",
                        content: [
                            ``,
                            ``,
                            ``,
                        ],
                    },
                    "תת-נושא-4":{
                        type : "listDots",
                        content: [
                            ``,
                            ``,
                            ``,
                        ],
                    },
                    "תת-נושא-4":{
                        type : "listDots",
                        content: [
                            ``,
                            ``,
                            ``,
                        ],
                    },
                    "תת-נושא-4":{
                        type : "listDots",
                        content: [
                            ``,
                            ``,
                            ``,
                        ],
                    },
                    "תת-נושא-4":{
                        type : "listDots",
                        content: [
                            ``,
                            ``,
                            ``,
                        ],
                    },
                },
            },
            subject5 : {
            },
            subject : {
                "נושא": {
                    "תת-נושא-1":{
                        type : "listNumbers",
                        content: [
                            ``,
                            ``,
                            ``,
                        ],
                    },
                    "תת-נושא-2":{
                        type : "text",
                        content: [
                            ``,
                            ``,
                            ``,
                        ],
                    },
                    "תת-נושא-3": {
                        type : "textAndPics",
                        pic : [`../assets/images/foodImages/eventGallary/event79.jpeg`, `../assets/images/foodImages/eventGallary/event75.jpeg`,],
                        content: [
                            ``,
                            ``,
                            ``,
                        ],
                    },
                    "תת-נושא-4":{
                        type : "listDots",
                        content: [
                            ``,
                            ``,
                            ``,
                        ],
                    },
                },
            },
        },
    },
}

// varubles
let strCurrentPage = "mainPage";
let strFormerPage = "mainPage";
var strCurrentTopic_recipePage = "salads";
var strCurrentTopic_videosPage = "recipe";
var strCurrentTopic_galleryPage = "recipe";
var strCurrentTopic_learningPage = "subject1";
let nCurrentTopicNumber = 0;
let currentPicNum;
let currentPicName;
let currTopic;


/* loading function
--------------------------------------------------------------
Description: */
window.addEventListener(`load`, () => {
    document.querySelector(`.loader`).classList.add(`fade`);
    let arrMainPageButtons = document.querySelectorAll('.mainPageButton');
    for (let i = 0; i < arrMainPageButtons.length; i++) {
        arrMainPageButtons[i].addEventListener('click', showPage);
    };
    showNavBar();
    document.querySelector(`.recipesScrollContainer`).addEventListener('swiped', showTopics);
    document.querySelector(`.videosScrollContainer`).addEventListener('swiped', showTopics);
});

/* showPage
--------------------------------------------------------------
Description:  */
const showPage = (event) => {
    // מעלים דיב קודם שומר דיב נוכחי ומראה אותו
    document.querySelector(`.${strCurrentPage}`).classList.add("hidden");
    if (event.currentTarget.classList[1] !== "x") {   // מטפל במקרה של תפריט
        if (strCurrentPage === "menuPage") {
            document.querySelector(`.${strCurrentPage}`).classList.add("hidden");
            strCurrentPage = `${event.currentTarget.classList[2]}Page`;
        } else {
            strFormerPage = strCurrentPage;
            strCurrentPage = event.currentTarget.classList[1] + "Page";
        }
    } else {
        strCurrentPage = strFormerPage;
    }
    document.querySelector(`.${strCurrentPage}`).classList.remove("hidden");
    // מראה תפריט עליון
    showNavBar();
    // שומר קטגוריה נוכחית
    if (event.currentTarget.classList[0] === "menuDropDownItemContainer") {
        window[`strCurrentTopic_${strCurrentPage}`] = event.currentTarget.classList[1];
    }
    // מראה בר תחתון
    if (PAGES[strCurrentPage].bottomNavBar) {
        let nNumberTheSymbols = 0; 
        document.querySelector(`.${strCurrentPage} .bottomNavBar`).innerHTML = "";
        for (let key of Object.keys(PAGES[strCurrentPage].bottomNavBar)) {
            let bottomNavBarTopic = El("div", 
            {attributes: {class: `bottomNavBarTopic ${key} ${nNumberTheSymbols}`}, 
            listeners : {click : showTopics}},
            El ("img", {attributes: {class : "bottomNavBarPic" , src: `../assets/images/grapics/bottomNavBar/${PAGES[strCurrentPage].bottomNavBar[key][1]}.svg`}}),
            El ("div", {cls: "bottomNavBarText"}, PAGES[strCurrentPage].bottomNavBar[key][0])
            );
            document.querySelector(`.${strCurrentPage} .bottomNavBar`).append(bottomNavBarTopic);
            nNumberTheSymbols++;
        }
        document.querySelector(`.${strCurrentPage} .bottomNavBar .${eval(`strCurrentTopic_${strCurrentPage}`)}`).classList.add("bold");
        document.querySelector(`.bottomNavBar`).scrollLeft = 0;
        document.querySelector(`.bottomNavBar`).scrollLeft = PAGES[strCurrentPage].bottomNavBar[eval(`strCurrentTopic_${strCurrentPage}`)][2];
    }
    // קורא לפונקציות אם צריך
    if (PAGES[strCurrentPage].functions) {
        for (let i = 0; i < PAGES[strCurrentPage].functions.length; i++) {
            eval(PAGES[strCurrentPage].functions[i]);
        }
    }
    // שם מאזינים אם צריך
    if (PAGES[strCurrentPage].listeners) {
        for (key of Object.keys(PAGES[strCurrentPage].listeners)) {
            document.querySelector(`.${strCurrentPage} .${key}`).addEventListener('click', eval(PAGES[strCurrentPage].listeners[key]));
        }
    }
    if(document.querySelector(`.recipeContent`)) {
        let recipeContent = document.querySelector(`.recipeContent`);
        document.querySelector(`.recipePage`).removeChild(recipeContent);
    }
}

/* showRecipe
--------------------------------------------------------------
Description:  */
const showRecipe = (event) => {
    // שומר מתכון וקטגוריה נוכחיים
    let strCurrentRecipe = event.currentTarget.classList[1];
    if(event.currentTarget.classList[2]) {
        strCurrentTopic_recipePage = event.currentTarget.classList[2];
    }
    // אם באים מחיפוש
    if (document.querySelector('.searchScreen').classList[2] === undefined || strCurrentPage === "galleryPage") {
        document.querySelector('.searchScreen').classList.add("hidden");
        // מעלים דיב קודם שומר דיב נוכחי ומראה אותו
        document.querySelector(`.${strCurrentPage}`).classList.add("hidden");
        strCurrentPage = "recipePage";
        document.querySelector(`.${strCurrentPage}`).classList.remove("hidden");
        // מראה תפריט עליון
        showNavBar();
    }
    // מרוקן דיבים
    document.querySelector(`.recipesScrollContainer`).innerHTML = "";
    document.querySelector(`.${strCurrentPage} .bottomNavBar`).innerHTML = "";
    if(document.querySelector(`.recipeContent`)) {
        let recipeContent = document.querySelector(`.recipeContent`);
        document.querySelector(`.recipePage`).removeChild(recipeContent);
    }
    // יוצר מתכון ומכניס לדף
    let recipeContent = El("div", {cls : "recipeContent"},
        El("img", 
        {attributes: {class: `recipeContentPic`, 
        src : `../assets/images/foodImages/${strCurrentTopic_recipePage}/${PAGES[strCurrentPage].content[strCurrentTopic_recipePage][strCurrentRecipe].pic}.jpeg`}}),
        El("div", {cls : "recipeContentHeadline"}, addSpace(strCurrentRecipe)),
        El("div", {cls : "recipeContentDescription"}, PAGES[strCurrentPage].content[strCurrentTopic_recipePage][strCurrentRecipe].description),
        El("div", {cls: "recipeInfoConteiner"}, // מידע על המנה
            El("div", {classes: ["headers", "quantity"]},
                El("div", {cls: "headerContainer"},
                    El("img",{attributes: {class: `recipeInfoPics`, 
                    src : `../assets/images/grapics/recipe/serving_size_icon.svg`}}),
                    "כמות:",
                ),
                El("div", {cls: "recipeInfoText"},  PAGES[strCurrentPage].content[strCurrentTopic_recipePage][strCurrentRecipe].quantity)
            ),
            El("div", {cls: "headers"},
                El("div", {cls: "headerContainer"},
                    El("img",{attributes: {class: `recipeInfoPics`, 
                    src : `../assets/images/grapics/recipe/timer.svg`}}),
                    "זמן הכנה:",
                ),
                El("div", {cls: "recipeInfoText"},  PAGES[strCurrentPage].content[strCurrentTopic_recipePage][strCurrentRecipe].time)
            ),
        ),
        El("div", {cls : "ingredientsContainer"},
            El("div", {cls : "recipeContentIngredientHead"}, "מצרכים"),
        ),
        El("div", {cls : "preparationsContainer"},
            El("div", {cls : "recipeContentIngredientHead"}, "אופן הכנה"),
        ),
    );
    document.querySelector(`.recipePage`).append(recipeContent);
    // מכניס מצרכים
    for (let i = 0; i < PAGES[strCurrentPage].content[strCurrentTopic_recipePage][strCurrentRecipe].ingredients.length; i++ ) {
        let ingredient = El("div", {cls : "ingredientContainer"},
        El("img",{attributes: {class: `ingredientCheckPic ingredientCheckPic${i}`, 
        src : `../assets/images/grapics/recipe/checkbox_blank.svg`},
        listeners : {click: onClickCheckBox}}),
        PAGES[strCurrentPage].content[strCurrentTopic_recipePage][strCurrentRecipe].ingredients[i]
        );
        document.querySelector(`.ingredientsContainer`).append(ingredient);
    }
    // מכניס אופן הכנה
    for (let i = 0; i < PAGES[strCurrentPage].content[strCurrentTopic_recipePage][strCurrentRecipe].preparation.length; i++ ) {
        let preparation = El("div", {cls : "preparationContainer"},
        El("img",{attributes: {class: `preparationCheckPic preparationCheckPic${i} gray`, 
        src : `../assets/images/grapics/recipe/round_checkbox.svg`},
        listeners : {click: onClickCheckBox}}),
        PAGES[strCurrentPage].content[strCurrentTopic_recipePage][strCurrentRecipe].preparation[i]
        );
        document.querySelector(`.preparationsContainer`).append(preparation);
    }
    
    // כפתור חזור
    document.querySelector(`.button_menu`).setAttribute("src", "../assets/images/grapics/general/right_arrow.svg");
    document.querySelector(`.button_menu`).classList.remove("menu");
    if (event.currentTarget.classList[0] === "galleryToRecipe") {
        document.querySelector(`.button_menu`).classList.add("gallery");
    } else {
        document.querySelector(`.button_menu`).classList.add("recipe");
    }
}

/* showTopics
--------------------------------------------------------------
Description: change hyphen to space */
const showTopics = (event) => {
    // שם מאזינים להחלקה ושומר את הקטגוריות במערך
    let arrTopic = [];
    for (let topics of Object.keys(PAGES[strCurrentPage].content)) {
        arrTopic.push(topics);
    }

    currTopic = eval(`strCurrentTopic_${strCurrentPage}`)

    // מוריד בולד לקטגוריה הקודמת, שומר קטגוריה נוכחית ושם עליה בולד
    document.querySelector(`.${strCurrentPage} .${currTopic}`).classList.remove("bold");
    document.querySelector(`.${strCurrentPage} .${currTopic} .bottomNavBarPic`).style.height = "5vh";
    if(event) { // בודק אם נעשתה לחיצה או החלקה
        if (event.currentTarget.classList[0] === "bottomNavBarTopic") { 
            document.querySelector(`.recipesScrollContainer`).scrollTop = 0;
            // בלחיצה שומר קטגוריה נוכחית ואת מספרה
            currTopic = event.currentTarget.classList[1];
            nCurrentTopicNumber = Number(event.currentTarget.classList[2]);
        } else {
            // בהחלקה בודק לאיזה כיוון ההחלקה ומשנה קטגוריה בהתאם
            if(event.detail.dir === "left" && nCurrentTopicNumber > 0) {
                document.querySelector(`.recipesScrollContainer`).scrollTop = 0;
                nCurrentTopicNumber--;
            } else if (event.detail.dir === "right" && nCurrentTopicNumber < Object.keys(PAGES.recipePage.bottomNavBar).length -1) {
                document.querySelector(`.recipesScrollContainer`).scrollTop = 0;
                nCurrentTopicNumber++;
            }
            currTopic = arrTopic[nCurrentTopicNumber];
        }
    } else { // שומר את מספר הקטגוריה אם באים מהתפריט או מההתחלה
        nCurrentTopicNumber = Number(document.querySelector(`.${strCurrentPage} .${currTopic}`).classList[2]);
    }

    document.querySelector(`.bottomNavBar`).scrollLeft = PAGES[strCurrentPage].bottomNavBar[currTopic][2];

    document.querySelector(`.${strCurrentPage} .${currTopic}`).classList.add("bold");
    document.querySelector(`.${strCurrentPage} .${currTopic} .bottomNavBarPic`).style.height = "6vh";
    
    eval(`createTopic_${strCurrentPage}(currTopic)`);
}

/* createTopic_recipePage
--------------------------------------------------------------
Description: */
const createTopic_recipePage = (currTopic) => {
    strCurrentTopic_recipePage = currTopic
    // מוחק מידע קודם ומכניס תמונות וטקסט בהתאם לקטגוריה
    document.querySelector(`.recipesScrollContainer`).innerHTML = "";

    for(let key of Object.keys(PAGES[strCurrentPage].content[strCurrentTopic_recipePage])) {
        let recipeDisplay = El("div",
        {attributes: {class: `recipeDisplay ${key}`}, 
        listeners : {click : showRecipe}},
        El("img",
        {attributes: {class: `recipeDisplayPic`, 
        src : `../assets/images/foodImages/${strCurrentTopic_recipePage}/${PAGES[strCurrentPage].content[strCurrentTopic_recipePage][key].pic}.jpeg`},}),
        El("div", {cls: `recipeDisplayText`}, addSpace(key))
        )
        document.querySelector(`.recipesScrollContainer`).append(recipeDisplay)
    }
}

/* createTopic_learningPage
--------------------------------------------------------------
Description: */
const createTopic_learningPage = (currTopic) => {
    strCurrentTopic_learningPage = currTopic
    // מוחק מידע קודם ומכניס תמונות וטקסט בהתאם לקטגוריה
    document.querySelector(`.learningScrollContainer`).innerHTML = "";
    for(let key of Object.keys(PAGES[strCurrentPage].content[strCurrentTopic_learningPage])) {
        let menuDisplay = El("div",{ classes: [`learningContainer`, key]},
            El("div",
                {attributes: {class: `learningItem ${key}`}}, 
                    El("div", {classes: [`learningItemContainer`,"container", key],}, 
                        addSpace(key)
                    ),
                    El("img",
                        {attributes: {class: `learningItemArrow ${key}`, 
                        src : `../assets/images/grapics/menu/dropdown_sideArrow.svg`},
                        listeners : {click : learningDropDown}}),
            )
        )
        document.querySelector(`.learningScrollContainer`).append(menuDisplay)
    }
}

/* menuDropDown
--------------------------------------------------------------
Description:  */
const learningDropDown = (event) => {
    let currentTopic = event.currentTarget.classList[1];
    let objCurrentDropDown = PAGES.learningPage.content[strCurrentTopic_learningPage][currentTopic];
    // מראה דרופ דאון
    if (document.querySelector(`.learningPage .${currentTopic} .learningItem `).lastChild.getAttribute("src") === "../assets/images/grapics/menu/dropdown_sideArrow.svg") {
        document.querySelector(`.learningPage .${currentTopic} .learningItem `).lastChild.setAttribute("src", "../assets/images/grapics/menu/opened_dropdown.svg");
        for(let key of Object.keys(objCurrentDropDown)) {
            let menuDropDown = 
                El("div", {classes: [`learningDropDownItemContainer`, key, currentTopic],
                listeners : {click : showLearningContent}}, 
                    // El("img",
                    // {attributes: {class: `menuDropDownItemicon`, 
                    // src : `../assets/images/grapics/menu/${objCurrentDropDown[key][1]}.svg`},}),
                    addSpace(key),
                );
            document.querySelector(`.learningPage .${currentTopic}`).append(menuDropDown)
        }
    } else { // מעלים דרופ דאון
        document.querySelector(`.learningPage .${currentTopic} > .learningItem`).lastChild.setAttribute("src", "../assets/images/grapics/menu/dropdown_sideArrow.svg");
        let arrDropDownItems = document.querySelectorAll(`.learningPage .${currentTopic} .learningDropDownItemContainer`);
        for (let i = 0; i < arrDropDownItems.length; i++) {
            document.querySelector(`.learningPage .${currentTopic}`).removeChild(arrDropDownItems[i]);
        };
    }

}


/* showLearningContent
--------------------------------------------------------------
Description: */
const showLearningContent = (event) => {
    let subjectTitle = event.currentTarget.classList[1];
    let topic = event.currentTarget.classList[2];
    let subjectContent = PAGES[strCurrentPage].content[strCurrentTopic_learningPage][topic][subjectTitle];
    // כפתור חזורErmou, Athina, Greeceמונסטיראקי Monastiraki, Athens, Greece
    document.querySelector(`.button_menu`).setAttribute("src", "../assets/images/grapics/general/right_arrow.svg");
    document.querySelector(`.button_menu`).classList.remove("menu");
    document.querySelector(`.button_menu`).classList.add("learning");

    document.querySelector(`.learningScrollContainer`).innerHTML = "";
    document.querySelector(`.${strCurrentPage} .bottomNavBar`).innerHTML = "";

    let content = El("div", {cls: "learningContantContainer"},
        El("div", {cls: "learningContantTitle"}, addSpace(subjectTitle)), );
    let container;
    document.querySelector(`.learningScrollContainer`).append(content);
    switch (subjectContent.type) {
        case 'text':
            container =  El("div", {cls: "learningContant"},);
            document.querySelector(`.learningContantContainer`).append(container);
            for(let i = 0; i < subjectContent.content.length; i++){
                let parah = El("div", {cls : "IdParah"}, );
                parah.innerHTML = subjectContent.content[i];
                document.querySelector(`.learningContant`).append(parah); 
            }
            break;
        case 'listDots': 
            container =  El("ul", {cls: "learningContant"},);
            document.querySelector(`.learningContantContainer`).append(container);
            for(let i = 0; i < subjectContent.content.length; i++){
                let parah = El("li", {cls : "listItem"},);
                parah.innerHTML = subjectContent.content[i];
                document.querySelector(`.learningContant`).append(parah); 
            }
            break;
        case 'listNumbers':
            container =  El("ol", {cls: "learningContant"},);
            document.querySelector(`.learningContantContainer`).append(container);
            for(let i = 0; i < subjectContent.content.length; i++){
                let parah = El("li", {cls : "listItem"},);
                parah.innerHTML = subjectContent.content[i];
                document.querySelector(`.learningContant`).append(parah); 
            }
            break;
        case 'textAndPics':
            container =  El("div", {cls: "learningContant"},);
            document.querySelector(`.learningContantContainer`).append(container);
            for(let i = 0; i < subjectContent.content.length; i++){
                let parah = El("div", {cls : "IdParah"},);
                parah.innerHTML = subjectContent.content[i];
                document.querySelector(`.learningContant`).append(parah); 
            }
            container = El("div", {cls: "idPicContainer"});
            document.querySelector(`.learningContantContainer`).append(container);
            for(let i = 0; i < subjectContent.pic.length; i++){
                let parah = El("img", {cls : "picId", attributes : {src : subjectContent.pic[i]}});
                document.querySelector(`.idPicContainer`).append(parah); 
            }
            break;
        default: console.log("default");
    }
}


/* createTopic_videosPage
--------------------------------------------------------------
Description: */
const createTopic_videosPage = (currTopic) => {
    strCurrentTopic_videosPage = currTopic
    // מוחק מידע קודם ומכניס תמונות וטקסט בהתאם לקטגוריה
    document.querySelector(`.videosScrollContainer`).innerHTML = "";

    for(let key of Object.keys(PAGES[strCurrentPage].content[strCurrentTopic_videosPage])) {
        let recipeDisplay =
        El("div",
            {classes: [`youtubeVideoContainer`, key],},
            El("iframe", {attributes:
                {class: "youtubeVideo",
                src: PAGES[strCurrentPage].content[strCurrentTopic_videosPage][key],
                allow: "accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture",
                allowfullscreen: true,
            }}),
            El("div", {cls: `videosDisplayText`}, addSpace(key))
        )
        document.querySelector(`.videosScrollContainer`).append(recipeDisplay)
    }
}

/* createTopic_galleryPage
--------------------------------------------------------------
Description: change hyphen to space */
const createTopic_galleryPage = (currTopic) => {
    strCurrentTopic_galleryPage = currTopic
    let currentPic = 0;
    // מוחק מידע קודם ומכניס תמונות וטקסט בהתאם לקטגוריה
    document.querySelector(`.galleryScrollContainer`).innerHTML = "";
    if(strCurrentTopic_galleryPage === "recipe") {
        for(let topics of Object.keys(PAGES.recipePage.content)) {
            for(let recipe of Object.keys(PAGES.recipePage.content[topics])) {      
                if(!PAGES[strCurrentPage].content[strCurrentTopic_galleryPage][recipe]) {
                    PAGES[strCurrentPage].content[strCurrentTopic_galleryPage][recipe] = [PAGES.recipePage.content[topics][recipe].pic, topics];
                }
            }
        }
        for(let key of Object.keys(PAGES[strCurrentPage].content[strCurrentTopic_galleryPage])) {
            let recipeDisplay = El("div",
            {attributes: {class: `galleryScrollDisplay ${key} ${currentPic}`}, 
            listeners : {click : showPicDisplay}},
            )
            recipeDisplay.style.backgroundImage = `url(../assets/images/foodImages/${PAGES[strCurrentPage].content[strCurrentTopic_galleryPage][key][1]}/${PAGES[strCurrentPage].content[strCurrentTopic_galleryPage][key][0]}.jpeg)`
            document.querySelector(`.galleryScrollContainer`).append(recipeDisplay);
            currentPic++;
        }
    } else {
        for(let i = 1; i <= 97; i++ ) {
            let recipeDisplay = El("div",
            {attributes: {class: `galleryScrollDisplay pic${i} ${currentPic}`}, 
            listeners : {click : showPicDisplay}},
            )
            recipeDisplay.style.backgroundImage = `url(../assets/images/foodImages/eventGallary/event${i}.jpeg)`
            document.querySelector(`.galleryScrollContainer`).append(recipeDisplay);
            if(!PAGES[strCurrentPage].content[strCurrentTopic_galleryPage][`pic${i}`]) {
                PAGES[strCurrentPage].content[strCurrentTopic_galleryPage][`pic${i}`] = `event${i}`;
            }
            currentPic++;
        }
    }
}

/* showPicDisplay
--------------------------------------------------------------
Description:  */
const showPicDisplay = (event) => {
    const NUMBER_OF_PICTUERS = Object.keys(PAGES[strCurrentPage].content[strCurrentTopic_galleryPage]).length - 1;

    // שם מאזין לרקע להעלמת התצוגה
    document.querySelector(`.galleryPage .darkScreen`).addEventListener("click", () => {
        document.querySelector(`.galleryPicDisplay`).classList.add("hidden");
        document.querySelector(`.galleryPage .darkScreen`).classList.add("hidden");
    });

    // בודק מה נלחץ ומשנה תמונה נוכחית בהתאם
    if(event.currentTarget.classList[0] === "rightArrow") {
        currentPicNum--;
        if (Number(currentPicNum) === -1) {
            currentPicNum = NUMBER_OF_PICTUERS;
        }
    } else if(event.currentTarget.classList[0] === "leftArrow") {
        currentPicNum++;
        if (Number(currentPicNum) === NUMBER_OF_PICTUERS + 1) {
            currentPicNum = 0;
        }
    } else if(event.currentTarget.classList[0] === "galleryScrollDisplay") {
        currentPicNum = event.currentTarget.classList[2];
    }
    // שומר שם של תמונה נוכחית
    currentPicName = Object.keys(PAGES[strCurrentPage].content[strCurrentTopic_galleryPage])[currentPicNum];
    // מראה את תצוגת התמונה ומרוקן אותה
    document.querySelector(`.galleryPage .darkScreen`).classList.remove("hidden");
    document.querySelector(`.galleryPicDisplay`).classList.remove("hidden");
    document.querySelector(`.galleryPicDisplay`).innerHTML = "";
    // יוצר את התצוגה ומכניס לדיב
    if(strCurrentTopic_galleryPage === "recipe"){
        let picDisplay = El("div", {cls : `picDisplayContiner`},
            El("img", 
            {attributes: {class: `galleryDisplayPic`, 
            src : `../assets/images/foodImages/${PAGES[strCurrentPage].content[strCurrentTopic_galleryPage][currentPicName][1]}/${PAGES[strCurrentPage].content[strCurrentTopic_galleryPage][currentPicName][0]}.jpeg`},}),
            El("div", {cls: `galleryDisplayText`}, addSpace(currentPicName)),
            El("div", {cls: "toRecipeButton"}),
            El ("div", {cls: `galleryDisplayArrows`},
                El("img", 
                {attributes: {class: `rightArrow arrow`, 
                src : `../assets/images/grapics/general/right_arrow.svg`},
                listeners : {click : showPicDisplay}}),
                El("img", 
                {attributes: {class: `leftArrow arrow`, 
                src : `../assets/images/grapics/general/left_arrow.svg`},
                listeners : {click : showPicDisplay}}),
            )
        );
        document.querySelector(`.galleryPicDisplay`).append(picDisplay);
        let toRecipe = El("img", {attributes: {class: `galleryToRecipe ${currentPicName} ${PAGES[strCurrentPage].content[strCurrentTopic_galleryPage][currentPicName][1]}`, 
        src : `../assets/images/grapics/general/lamatkon_button.svg`},
        listeners : {click : showRecipe}})
        document.querySelector(`.toRecipeButton`).append(toRecipe);
    } else {
        let picDisplay = El("div", {cls : `picDisplayContiner`},
        El("img", 
        {attributes: {class: `galleryDisplayPic`, 
        src : `../assets/images/foodImages/eventGallary/${PAGES[strCurrentPage].content[strCurrentTopic_galleryPage][currentPicName]}.jpeg`},}),
        // El("div", {cls: `galleryDisplayText`}, addSpace(currentPicName)),
        El("div", {cls: "toRecipeButton"}),
        El ("div", {cls: `galleryDisplayArrows`},
            El("img", 
            {attributes: {class: `rightArrow arrow`, 
            src : `../assets/images/grapics/general/right_arrow.svg`},
            listeners : {click : showPicDisplay}}),
            El("img", 
            {attributes: {class: `leftArrow arrow`, 
            src : `../assets/images/grapics/general/left_arrow.svg`},
            listeners : {click : showPicDisplay}}),
        )
    );
    document.querySelector(`.galleryPicDisplay`).append(picDisplay);  
    }
}

/* onClickCheckBox
--------------------------------------------------------------
Description:  */
const onClickCheckBox = (event) => {
    if (event.currentTarget.classList[0] === "preparationCheckPic") {
        if(event.currentTarget.classList[2] === "gray") {
            document.querySelector(`.${event.currentTarget.classList[1]}`).classList.remove("gray");
        } else {
            document.querySelector(`.${event.currentTarget.classList[1]}`).classList.add("gray");
        }
    } else {
        if (document.querySelector(`.${event.currentTarget.classList[1]}`).getAttribute("src") === `../assets/images/grapics/recipe/checkbox_v.svg`) {
            document.querySelector(`.${event.currentTarget.classList[1]}`).setAttribute("src", `../assets/images/grapics/recipe/checkbox_blank.svg`);
        } else {
            document.querySelector(`.${event.currentTarget.classList[1]}`).setAttribute("src", `../assets/images/grapics/recipe/checkbox_v.svg`);
        }
    }

}

/* showMenu
--------------------------------------------------------------
Description:  */
const showMenu = () => {
    // מוחק מידע קודם ומכניס תמונות וטקסט בהתאם לקטגוריה
    document.querySelector(`.menuPage`).innerHTML = "";
    for(let key of Object.keys(PAGES.menuPage.content)) {
        let menuDisplay = El("div",{classes: [`menuContainer`, key]},
            El("div",
            {attributes: {class: `menuItem`}}, 
                El("div", {classes: [`menuItemContainer`,"container", key],
                listeners : {click : showPage}}, 
                    El("img",
                    {attributes: {class: `menuItemicon`, 
                    src : `../assets/images/grapics/menu/${PAGES.menuPage.content[key][1]}.svg`},}),
                    PAGES.menuPage.content[key][0],
                ),
                El("img",
                    {attributes: {class: `menuItemArrow ${key}`, 
                    src : `../assets/images/grapics/menu/dropdown_sideArrow.svg`},
                    listeners : {click : menuDropDown}}),
                )
        )
        document.querySelector(`.menuPage`).append(menuDisplay)
    }

}

/* menuDropDown
--------------------------------------------------------------
Description:  */
const menuDropDown = (event) => {
    let currentPage = event.currentTarget.classList[1];
    let objCurrentDropDown = PAGES.menuPage.content[event.currentTarget.classList[1]][2];
    // מראה דרופ דאון
    if (document.querySelector(`.menuPage > .${currentPage} > .menuItem`).lastChild.getAttribute("src") === "../assets/images/grapics/menu/dropdown_sideArrow.svg") {
        document.querySelector(`.menuPage > .${currentPage} > .menuItem`).lastChild.setAttribute("src", "../assets/images/grapics/menu/opened_dropdown.svg");
        for(let key of Object.keys(objCurrentDropDown)) {
            let menuDropDown = 
                El("div", {classes: [`menuDropDownItemContainer`, key, currentPage],
                listeners : {click : showPage}}, 
                    El("img",
                    {attributes: {class: `menuDropDownItemicon`, 
                    src : `../assets/images/grapics/menu/${objCurrentDropDown[key][1]}.svg`},}),
                    objCurrentDropDown[key][0],
                );
            document.querySelector(`.menuPage > .${currentPage}`).append(menuDropDown)
        }
    } else { // מעלים דרופ דאון
        document.querySelector(`.menuPage > .${currentPage} > .menuItem`).lastChild.setAttribute("src", "../assets/images/grapics/menu/dropdown_sideArrow.svg");
        let arrDropDownItems = document.querySelectorAll(`.menuPage > .${currentPage} .menuDropDownItemContainer`);
        for (let i = 0; i < arrDropDownItems.length; i++) {
            document.querySelector(`.menuPage > .${currentPage}`).removeChild(arrDropDownItems[i]);
        };
    }

}

/* onClickSearch
--------------------------------------------------------------
Description:  */
const onClickSearch = () => {
    document.querySelector('.searchScreen').classList.remove("hidden");
    document.querySelector(`.closeSearch`).addEventListener('click', () => {
        document.querySelector('.searchScreen').classList.add("hidden");
    });
    document.querySelector(`.searchBox`).addEventListener("input", onSearch);
}

/* onSearch
--------------------------------------------------------------
Description: cheack for search match and creat dropdown accordingly */
const onSearch = () => {
    document.querySelector('.dropDown').innerHTML = "";
    // עובר על כול הקטגוריות של המתכונים
    for (let keys of Object.keys(PAGES.recipePage.content)){
        // בכול קטגוריה, עובר על כול המתכונים ומחפש התאמה לחיפוש
        for (let key of Object.keys(PAGES.recipePage.content[keys])) {
            let strUserInput = document.querySelector(`.searchBox`).value;
            if(key.includes(strUserInput) && strUserInput !== ""){
                let dropDownItem = El("div", {classes : ["dropDownItem", key, keys], listeners : {click : showRecipe}}, addSpace(key))
                document.querySelector('.dropDown').append(dropDownItem);
            }
        }
    
    }
}

/* showNavBar
--------------------------------------------------------------
Description: change hyphen to space */
const showNavBar = () => {
    // מוחק מידע קודם ומכניס תפריט ניווט עליון לפי העמוד הנוכחי 
    document.querySelector(`.topNavBar`).innerHTML = "";
    for (key of Object.keys(PAGES[strCurrentPage].topNavBar)) {
        let navBarItem
        if (key.slice(0,3) === "img") {
            if (key.includes("button")) { // כפתור עליון שמאלי
                navBarItem = El(key.slice(0,3), 
                { attributes: { src: `../assets/images/grapics/topNavBar/${PAGES[strCurrentPage].topNavBar[key]}`, class: `${key.slice(4)} ${key.slice(11)}`},
                listeners: {click : showPage}});
                document.querySelector(`.topNavBar`).append(navBarItem);
            } else if (key === "img_SearchIcon") { // חיפוש
                navBarItem = El(key.slice(0,3), 
                { attributes: { src: `../assets/images/grapics/topNavBar/${PAGES[strCurrentPage].topNavBar[key]}`, class: key.slice(4)},
                listeners: {click : onClickSearch}});
                document.querySelector(`.topNavBar`).append(navBarItem);
            }else if (key === "img_home"){
                navBarItem = El(key.slice(0,3), 
                { attributes: { src: `../assets/images/grapics/topNavBar/${PAGES[strCurrentPage].topNavBar[key]}`, class: `${key.slice(4)} backToHome main`},
                listeners: {click : showPage}});
                document.querySelector(`.topNavBar`).append(navBarItem);
            }else { // סמלים
                navBarItem = El(key.slice(0,3), 
                { attributes: { src: `../assets/images/grapics/topNavBar/${PAGES[strCurrentPage].topNavBar[key]}`, class: key.slice(4)}});
                document.querySelector(`.topNavBar`).append(navBarItem);
            }
        } else if (key.slice(0,3) === "div"){ // כותרת
            if(key.slice(4,14) === "topNavText") {
                navBarItem = El(key.slice(0,3), { classes: [key.slice(4,14), key.slice(15)], listeners : {click: showPage}}, PAGES[strCurrentPage].topNavBar[key]);
                document.querySelector(`.topNavBar`).append(navBarItem);
            } else {
                navBarItem = El(key.slice(0,3), { cls: key.slice(4)}, PAGES[strCurrentPage].topNavBar[key]);
                document.querySelector(`.topNavBar`).append(navBarItem);
            }
        } else { // צבע רקע
            document.querySelector(`.topNavBar`).style[key] = PAGES[strCurrentPage].topNavBar[key];
        }
    }
}

/* addSpace
--------------------------------------------------------------
Description: change hyphen to space */
const addSpace = (phrase) => {
    return phrase.replace(/-/g, ' ');
}


//   @template T
//   @param {keyof HTMLElementTagNameMap} tagName 
//   @param {{classes?: string[], cls?: string, id?: string, attributes: {[index: string]: string | { toString(): string }}, listeners: Listeners}} options 
//   @param  {...string | Node} children 
function El(tagName, options = {}, ...children) {
    let el = Object.assign(document.createElement(tagName), options.fields || {});
    if (options.classes && options.classes.length) el.classList.add(...options.classes);
    else if (options.cls) el.classList.add(options.cls);
    if (options.id) el.id = options.id;
    el.append(...children.filter(el => el));
    for (let listenerName of Object.keys(options.listeners || {}))
        if (options.listeners[listenerName]) el.addEventListener(listenerName, options.listeners[listenerName], false);
    for (let attributeName of Object.keys(options.attributes || {})) {
        if (options.attributes[attributeName] !== undefined) el.setAttribute(attributeName, options.attributes[attributeName]);
    }
    return el;
}